Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/wapt-reporting.po
Languages: fr

source: Using the reporting functions in WAPT
fr: Utiliser les fonctions de reporting dans WAPT

source: WAPT, console, reporting, SQL, query, PostgreSQL, documentation
fr: WAPT, console, reporting, rapports, SQL, query, requêtes, PostgreSQL, documentation

source: Feature only available with WAPT **Enterprise**.
fr: Fonctionnalité disponible uniquement avec WAPT **Enterprise**.

source: Working principle
fr: Principe de fonctionnement

source: WAPT **Enterprise** offers advanced reporting capabilities.
fr: WAPT **Enterprise** offre des fonctionnalités avancées de reporting.

source: Indeed, who better than you to know what you want in your report.
fr: En effet, qui mieux que vous même pour savoir ce que vous voulez dans votre rapport.

source: With WAPT we offer to write your own SQL queries to display the result in the wapt console.
fr: Avec WAPT nous vous proposons d'écrire vos propres requêtes SQL pour afficher vos résultats souhaités dans votre console WAPT.

source: WAPT query Designer
fr: Concepteur de requêtes WAPT

source: The query designer offers you the ability to edit your own queries on the WAPT PostgreSQL database.
fr: Le concepteur de requêtes vous offre la possibilité d'éditer vos propres requêtes à exécuter sur la base de données PostgreSQL du serveur WAPT.

source: To create a new report, click on :menuselection:`Reporting --> Design Mode --> New query`.
fr: Pour créer un nouveau rapport, cliquez sur :menuselection:`Rapport --> Mode Conception --> Nouvelle Requête`.

source: Designing a query in WAPT reporting
fr: Concevoir une requête pour le reporting WAPT

source: to rename a query, press the :kbd:`F2` key;
fr: pour renommer une requête, appuyez sur la touche :kbd:`F2` ;

source: in the top banner, you can write your SQL query;
fr: dans la bannière supérieure, vous pouvez écrire votre requête SQL ;

source: To edit / modify / save your reports:
fr: Pour éditer / modifier / sauvegarder vos rapports :

source: the :guilabel:`Reload queries` button is used to reload queries saved on the server, for example, if a colleague has just edited a new query;
fr: le bouton :guilabel:`Recharger les requêtes` est utilisé pour recharger les requêtes enregistrées sur le serveur, par exemple, si un collègue vient de modifier une nouvelle requête ;

source: the :guilabel:`New query` button will add a new blank query to the list;
fr: le bouton :guilabel:`Nouvelle requête` ajoutera une nouvelle requête vide à la liste ;

source: the :guilabel:`Delete query` button will delete the selected query from the WAPT server;
fr: le bouton :guilabel:`Supprimer la requête` supprimera la requête sélectionnée du serveur WAPT ;

source: the :guilabel:`Export to Excel` button will export the result of your query to a spreadsheet;
fr: le bouton :guilabel:`Exporter vers Excel` exportera le résultat de votre requête vers une feuille de calcul ;

source: the :guilabel:`Save queries` button will save your query to the WAPT server;
fr: le bouton :guilabel:`Enregistrer la requête` enregistrera votre requête sur le serveur WAPT ;

source: the :guilabel:`Duplicate` button will duplicate an existing query to avoid writing a request from scratch;
fr: le bouton :guilabel:`Dupliquer` dupliquera une requête existante pour éviter d'écrire une requête à partir de zéro ;

source: the :guilabel:`Execute` button executes the selected query;
fr: le bouton :guilabel:`Exécuter` exécute la requête sélectionnée ;

source: the queries are saved in the PostgreSQL WAPT database;
fr: les requêtes sont sauvegardées dans la base de données PostgreSQL du serveur WAPT ;

source: the shortcut :kbd:`CTRL+space` allows you to build your queries more effectively;
fr: le raccourci :kbd:`CTRL+Espace` vous permet de construire vos requêtes plus efficacement en mode conception ;

source: Query examples
fr: Exemples de requêtes

source: Computers query
fr: Requêtes ordinateurs :

source: Number of hosts
fr: Nombre de postes

source: Computers list:
fr: Liste des ordinateurs :

source: Computers MAC addresses and IP:
fr: Adresses MAC et IP des ordinateurs :

source: Windows versions:
fr: versions de Windows:

source: Lists OS diversity
fr: Lister les différents OS

source: List hosts not seen in a while
fr: Lister les postes inactife depuis longtemps

source: Filter hosts by Chassis types
fr: Filter les hotes par type de Chassis

source: List hosts with their Windows Serial Key
fr: Lister les hotes avec leur numéro de série Windows

source: WAPT query
fr: Requêtes WAPT

source: List WAPT Packages in WAPT server repository
fr: Lister les paquets WAPT du serveur

source: List hosts needing upgrade
fr: Lister les hotes nécessitant une mise à jour

source: Packages query
fr: Requêtes paquets

source: List packages with their number of installation
fr: Lister les paquets avec leur nombre d'installation

source: Software query
fr: Requêtes logicielles

source: WAPT Community agents
fr: Agent WAPT Community

source: List hosts with their 7zip version associated
fr: Lister les hotes avec la version de 7zip associée

source: List hosts with their softwares
fr: Lister les hotes avec leur logiciels

source: List normalized softwares
fr: Normaliser les noms d'un logiciel

source: You can also find several more examples of queries on `Tranquil IT's Forum <https://forum.tranquil.it/viewforum.php?f=18&sid=b2a0081dd9a8adb5c57386974d691c6d>`_.
fr: Vous pouvez également trouver plusieurs autres exemples de requêtes sur le forum de `Tranquil IT <https://forum.tranquil.it/viewforum.php?f=18&sid=b2a0081dd9a8adb5c57386974d691c6d>`_.

source: Feel free to post your own queries on the same forum with an explanation of what your query does, ideally with a screen capture or a table showing a sample of your query result.
fr: N'hésitez pas à poster vos propres requêtes sur le même forum avec une explication de ce que fait votre requête, idéalement avec une capture d'écran ou un tableau montrant un échantillon du résultat de votre requête.

source: Normalizing software names
fr: Normaliser les noms d'un logiciel

source: Sometimes, the version of the software or its architecture are an integral part of the software name. When they register with the WAPT Server inventory, they appear as different software whereas they are just one software for us humans.
fr: Parfois, la version du logiciel ou son architecture font partie intégrante du nom du logiciel. Lorsqu'ils s'inscrivent dans l'inventaire du serveur WAPT, ils apparaissent comme des logiciels différents alors qu'ils ne sont qu'un seul logiciel pour nous, les humains.

source: To solve this problem, we propose to standardize the name of the software with WAPT.
fr: Pour résoudre ce problème, nous proposons de standardiser le nom de certains logiciels.

source: Normalizing the name of software
fr: Normaliser les noms d'un logiciel

source: click :guilabel:`Normalize Software Names` in the :guilabel:`Tools` menu;
fr: cliquez sur :guilabel:`Normaliser les noms de logiciels` dans le menu :guilabel:`Outils` ;

source: select the software to standardize, for example, all different version of Adobe Flash Player;
fr: sélectionner le logiciel à standardiser, par exemple, toutes les différentes versions d'Adobe Flash Player ;

source: on the column :guilabel:`normalized`, press :kbd:`F2` to assign a standardized name to the selected software. Then press :kbd:`Enter`;
fr: sur la colonne :guilabel:`normalized`, appuyez sur :kbd:`F2` pour attribuer un nom standardisé au logiciel sélectionné. Puis appuyez sur :kbd:`Entrée` ;

source: to select several programs, select them with the :kbd:`shift-up/down` key combination;
fr: pour sélectionner plusieurs programmes, sélectionnez-les avec la combinaison de touches :kbd:`shift-up/down` ;

source: you can also indicate a software like *windows update* or *banned* (Press :kbd:`spacebar` in the corresponding column);
fr: vous pouvez aussi indiquer un logiciel comme *windows update* ou *banned* (Appuyez sur :kbd:`Espace` dans la colonne correspondante) ;

source: press on :guilabel:`Import` to load the changes from the server;
fr: cliquez sur :guilabel:`Importer` pour charger les changements depuis le serveur ;

source: press on :guilabel:`Write` to save your changes;
fr: cliquez sur :guilabel:`Ecrire` pour sauvegarder vos modifications ;

source: You can now run your queries on this standardized name.
fr: Vous pouvez maintenant exécuter vos requêtes avec ce nom standardisé.

source: Video demonstration
fr: Vidéo de démonstration
