Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/wapt-organizational-unit.po
Languages: fr

source: Using Organizational Unit packages in WAPT
fr: Utilisation des paquets d'unités organisationnelles dans WAPT

source: Feature only available with WAPT **Enterprise**.
fr: Cette fonctionnalité est disponible uniquement dans la version **WAPT Enterprise**.

source: Working principle
fr: Principe de fonctionnement

source: WAPT Enterprise offers organizational unit packages functionnality.
fr: WAPT Enterprise offre des fonctionnalités d'unités organisationnelles.

source: It automates software installations based on your Active Directory infrastructure.
fr: Cette méthode automatise les installations de logiciels basées sur votre infrastructure Active Directory.

source: The WAPT agent is aware of its position in the Active Directorytree structure, therefore it knows the hierarchy of Organizational Units that concerns it, for example:
fr: L'agent WAPT est conscient de sa position dans l'arborescence Active Directory, il connaît donc la hiérarchie des Unités Organisationnelles qui le concerne, par exemple :

source: If an Organizational Unit package is defined on each level, WAPT agent will automtically download packages and configurations that are attached to each level, by inheritance, and apply attached packages and their dependencies.
fr: Si un paquet d'Unité Organisationnelle est défini à chaque niveau, l'agent WAPT téléchargera automatiquement les paquets et les configurations qui sont attachés à chaque niveau, par héritage, et appliquera les paquets attachés et leurs dépendances.

source: Filters and actions available with Organizational Units
fr: Filtres et actions disponibles avec les Unités Organisationnelles

source: WAPT console showing options applicable to OU
fr: Console WAPT montrant les options applicables à l'UO

source: You can see in the picture that **update** and **upgrade** actions can be performed through this menu, thus selecting hosts by their Organizational Unit.
fr: Vous pouvez voir sur l'image que les actions **vérifier les mises à jour** et **mettre à jour** peuvent être effectuées au travers de ce menu, vous pouvez sélectionner ainsi les hôtes rattachés à l'Unité Organisationnelle sélectionnée.

source: In the **Enterprise** version, you may filter how hosts are displayed based on the Active Directory :abbr:`OU (Organizational Units)` they belong to.
fr: Dans la version **Enterprise**, vous pouvez filtrer la façon dont les hôtes sont affichés en fonction :abbr:`OU (Organizational Units)` auquel ils appartiennent dans l'Active Directory.

source: The checkbox :guilabel:`Include hosts in subfolders` allows to display hosts in subfolders.
fr: La case à cocher :guilabel:`Inclure les hôtes dans les sous-dossiers` permet d'afficher les hôtes dans les sous-dossiers.

source: Creating Organizational Unit packages in the WAPT console
fr: Créer des paquets d'Unités Organisationnelles dans la console WAPT

source: You can create *unit* packages by :menuselection:`Right clicking on an OU --> Create or edit the unit package`.
fr: Vous pouvez créer des paquets *unit* en faisant :menuselection:`Clic droit sur une UO --> Créer ou éditer le paquet UO`.

source: Right-click on OU to create unit package.
fr: Cliquez avec le bouton droit de la souris sur OU pour créer un paquet d'unités.

source: A window opens and you are prompted to choose which packages must be in **unit** bundle.
fr: Une fenêtre s'ouvre et vous êtes invité à choisir les paquets à mettre en dépendance de l'UO.

source: Adding package to unit bundle.
fr: Ajouter un paquet à l'UO.

source: Save the package and it will be uploaded to the WAPT server.
fr: Enregistrez le paquet et il sera chargé sur le serveur WAPT.

source: Faking organizational unit for WORKGROUP hosts
fr: Simuler une Unité Organisationnelle pour des machines en WORKGROUP

source: It can happen that some specific hosts cannot be joined to an Active Directory domain.
fr: Il peut arriver que certains hôtes spécifiques ne puissent pas être joints à un domaine Active Directory.

source: With that specificity, such hosts do not show up in your Active Directory Organizational Units in your WAPT Console.
fr: Avec cette spécificité, ces hôtes n'apparaissent pas dans vos Unités Organisationnelles Active Directory dans votre console WAPT.

source: To make all hosts show up in the console under the right Organizational Unit, whether they are joined to an AD domain or not, WAPT allows you to specify a *fake* Organizational Unit WAPT agent configuration file.
fr: Pour que tous les hôtes apparaissent dans la console sous la bonne Unité Organisationnelle, qu'ils soient liés à un domaine AD ou non, WAPT vous permet de spécifier un fichier de configuration d'agent WAPT avec une Unité Organisationnelle *simulée*.

source: The benefits of this trick are:
fr: Les avantages de l'astuce sont :

source: you can manage these hosts with WAPT as if they where joined to the AD;
fr: vous pouvez gérer ces machines avec WAPT comme si elles étaient jointes à l'AD ;

source: out-of-domain and workgroup hosts are now showing up in AD tree view;
fr: Les machines hors domaine et les machines en mode groupes de travail apparaissent désormais dans l'arborescence AD ;

source: *unit* packages are usable on these hosts;
fr: les paquets *unit* fonctionnerons avec ces machines ;

source: To setup a *fake* Organisational Unit on hosts, create an empty WAPT package;
fr: Pour configurer une Unité Organisationnelle *simulée* sur les machines, créer un paquet WAPT vide ;

source: Then use the following code:
fr: Utilisez ensuite le code suivant :

source: The ``host_organizational_unit_dn`` must be like below in :file:`wapt-get.ini`:
fr: Le paramètre ``host_organizational_unit_dn`` doit être comme ci-dessous dans :file:`wapt-get.ini` :
