Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/waptexit.po
Languages: fr

source: Using WAPTExit
fr: Utiliser WAPTexit

source: WAPT, shutdown, shutting down, documentation
fr: WAPT, extinction, documentation, arrêt de la machine

source: :program:`waptexit` allows to upgrade and install WAPT packages when a host is shutting down, at the user's request, or at a scheduled time.
fr: Le composant :program:`waptexit` permet l'installation des mises à jour et des paquets WAPT sur le système lors de l'extinction de l'ordinateur, à la demande de l'utilisateur ou à un moment programmé.

source: The mechanism is simple. If packages are waiting to be upgraded, they'll be installed.
fr: Son fonctionnement est simple. Si des paquets sont en attente d'installation, ils sont installés.

source: When to use WAPTexit?
fr: Dans quelles situations utiliser WAPTexit ?

source: The WAPTexit method is very effective in most situation because it does not require the intervention of the :term:`User` or the :term:`Administrator`.
fr: La méthode WAPTexit est efficace dans la grande majorité des situations quand on veut laisser les choses se faire par elles-mêmes. Elle ne nécessite pas l'intervention de l':term:`Utilisateur` ou de l':term:`Administrateur`.

source: WAPTexit window
fr: Fenêtre WAPTexit

source: :program:`waptexit` executes by default on shutdown; it is installed by default with the WAPT agent.
fr: :program:`waptexit` s'exécute à l'extinction de la machine; il est installé par défaut avec l'agent WAPT.

source: The behavior of :program:`waptexit` is customizable in :file:`C:\\Program Files (x86)\\wapt\\wapt-get.ini`.
fr: Le comportement de :program:`waptexit` est personnalisable dans :file:`C:\\Program Files (x86)\\wapt\\wapt-get.ini`.

source: Manually triggering the execution of WAPTexit
fr: Exécution manuelle

source: By creating a desktop shortcut, one can allow users to launch upgrades by themselves at a time that is convenient to them simply by clicking the :guilabel:`WAPTexit` icon.
fr: En créant un raccourci sur le bureau des utilisateurs, on permet aux utilisateurs de mettre à jour leurs ordinateurs facilement en cliquant sur l'icône :guilabel:`WAPTexit`.

source: Triggering WAPTexit with a scheduled task
fr: Déclencher WAPTexit avec une tâche planifiée

source: One can deploy a GPO or a WAPT package that will trigger WAPTexit at a pre-scheduled time.
fr: On peut déployer un GPO ou un paquet WAPT qui déclenchera WAPTexit à un moment programmé à l'avance.

source: **Triggering WAPTexit with a scheduled task is best suited for servers that are not shutdown frequently.**
fr: **Le déclenchement de WAPTexit avec une tâche planifiée est mieux adapté aux serveurs qui ne sont pas arrêtés fréquemment.**

source: You may adapt the procedure describing how to deploy the WAPT agent to :ref:`trigger the WAPTexit.exe script at the time of your choosing <deploy_waptagent_with_GPO>`.
fr: Vous pouvez adapter la procédure décrivant comment déployer l'agent WAPT pour :ref:`déclencher le script WAPTexit.exe au moment de votre choix <déployer_waptagent_avec_GPO>`.

source: You can use the following script for your scheduled task, adapted to your need (**Enterprise only**):
fr: Vous pouvez utiliser le script suivant pour votre tâche programmée, adapté à votre besoin (**Enterprise uniquement**) :

source: All running software that are upgraded may be killed with possible loss of data. WAPTexit may fail to upgrade a software program if a software that you are upgrading is in the ``impacted_process`` list of the :file:`control` file of one of the software you are trying to upgrade. See :ref:`below <impacted_process>` for more information.
fr: Tous les logiciels en cours d'exécution qui sont mis à jour peuvent être terminés avec une perte possible de données. WAPTexit peut ne pas réussir à mettre à jour un logiciel si un logiciel que vous mettez à jour se trouve dans la liste ``impacted_process`` du fichier :file:`control" d'un des logiciels que vous essayez de mettre à jour. Voir :ref:`below <impacted_process>` pour plus d'informations. Traduit avec www.DeepL.com/Translator (version gratuite)

source: The method of trigerring WAPTexit at a scheduled time is the least recommended method for desktops. It is better to let WAPTexit execute at shutdown or on user request.
fr: La méthode consistant à déclencher WAPTexit à une heure programmée est la moins recommandée pour les ordinateurs de bureau. Il est préférable de laisser WAPTexit s'exécuter à l'arrêt de la machine ou à l'initiative de l'utilisateur.

source: Avoiding the cancellation of upgrades
fr: Empêcher l'interruption de l'installation des mises à jour

source: To disable the interruption of the installation of updates you can run :program:`waptexit` with the argument:
fr: Pour désactiver l'interruption de l'installation des mises à jour vous pouvez lancer :program:`waptexit` avec l'argument :

source: Otherwise :program:`waptexit` will take the value indicated in :file:`C:\\Program Files (x86)\\wapt\\wapt-get.ini`:
fr: C:\\Program Files (x86)\\wapt\\

source: If this value is not indicated in :file:`C:\\Program Files (x86)\\wapt\\wapt\\wapt-get.ini`, then the default value will be **10**.
fr: C:\\Program Files (x86)\\wapt\\

source: Increase the trigger time in waptexit
fr: Augmenter le temps de déclenchement dans waptexit

source: To specify the wait time before the automatic start of the installations you can start :program:`waptexit` with the argument:
fr: Pour préciser le temps d'attente avant le lancement automatique des installations vous pouvez lancer :program:`waptexit` avec l'argument :

source: Otherwise :program:`waptexit` will take the value indicated in the configuration :file:`C:\\Program Files (x86)\\wapt\\wapt-get.ini`:
fr: C:\\Program Files (x86)\\wapt\\

source: If this value is not indicated in :file:`C:\\Program Files (x86)\\wapt\\wapt\\wapt-get.ini`, then the default value will be **1**.
fr: C:\\Program Files (x86)\\wapt\\

source: Do not interrupt user activity
fr: Ne pas interrompre l'activité des utilisateurs

source: To tell WAPT not to run an :command:`upgrade` of running software on the machine (*impacted_process* attribute of the package), you can run :program:`waptexit` with the argument:
fr: Pour indiquer à WAPT de ne pas lancer l':command:`upgrade` de logiciels en cours d'exécution sur la machine (attribut *impacted_process* du paquet), vous pouvez lancer :program:`waptexit` avec l'argument :

source: If this value is not indicated in :file:`C:\\Program Files (x86)\\wapt\\wapt\\wapt-get.ini`, then the default value will be **False**.
fr: C:\\Program Files (x86)\\wapt\\

source: Launching the installation of packages with a special level of priority
fr: Lancer l'installation des paquets avec une prioritée spécifique

source: To tell WAPT to only upgrade high priority packages, you can run :program:`waptexit` with the argument:
fr: Pour indiquer à WAPT de lancer uniquement les installations des paquets avec une priorité élevée, vous pouvez lancer :program:`waptexit` avec l'argument :

source: If this value is not indicated in :file:`C:\\Program Files (x86)\\wapt\\wapt\\wapt-get.ini`, then the default value will be **Empty** (no filter on priority).
fr: C:\\Program Files (x86)\\wapt\\

source: Customizing WAPTexit
fr: Personnaliser waptexit

source: It is possible to customize waptexit by placing the image you want in :file:`C:\\Program Files (x86)\\wapt\\templates\\waptexit-logo.png`.
fr: C:\\Program Files (x86)\\wapt\\

source: Registering/ unregistering WAPTexit
fr: Activer / Désactiver WAPTexit

source: To register or unregister :program:`waptexit` in local shutdown group strategy scripts, use:
fr: Pour activer ou désactiver :program:`waptexit` dans les stratégies locales d'arrêt de la machine, utilisez la commande suivante :

source: to enable :program:`waptexit` at host shutdown:
fr: pour activer :program:`waptexit` à l'extinction de la machine :

source: to disable :program:`waptexit` at host shutdown:
fr: pour désactiver :program:`waptexit` à l'extinction de la machine :
