Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/wapt-selfservice.po
Languages: fr

source: Using WAPT SelfService
fr: Utiliser le WAPT SelfService

source: Presentation
fr: Présentation

source: With WAPT 1.7 **Enterprise** you can now filter the list of self-service packages available for your users.
fr: Avec WAPT 1.7, vous pouvez maintenant filtrer les paquets en libre-service disponibles pour vos utilisateurs.

source: Your users will be able to install a selection of WAPT packages without having to be a :term:`Local Administrator` on their desktop.
fr: Vos utilisateurs pourront installer une sélection de paquets WAPT sans nécessiter de droits :term:`Administrateur Local`.

source: The :term:`Users` gain in autonomy while deploying software and configurations that are trusted and authorized by the :term:`Organization`. This is a time saving feature for the Organization's IT support Helpdesk.
fr: Les :term:`Utilisateurs` gagnent en autonomie en déployant des logiciels et des configurations fiables et autorisées par l':term:`Organisation`. Il s'agit d'un gain de temps pour le service d'assistance informatique de l'Organisation.

source: How does it work?
fr: Comment ça fonctionne ?

source: Create a *selfservice* package
fr: Créer un paquet *self-service*

source: A *selfservice* package may now be deployed on hosts to list the different self-service rules that apply to the host.
fr: Un package *self-service* peut maintenant être déployé sur les machines pour lister les différentes règles de self-service qui s'appliquent à la machine.

source: How to use the **selfservice** feature?
fr: Comment utiliser la focntionnalité de *self-service* ?

source: The **selfservice** feature is only available with WAPT **Enterprise**.
fr: La fonctionnalité **Self-Service** est uniquement disponible dans la version **WAPT Enterprise**.

source: In the **Community** version, only Local Administrator and members of the *waptselfservice* group can access self-service on the agent.
fr: Dans la version **Community**, seuls l'administrateur local et les membres du groupe *waptselfservice* peuvent accéder au libre-service sur l'agent.

source: In the **Community** version, it is not possible to filter the packages made accessible to the user.
fr: Dans la version **Community**, il n'est pas possible de filtrer les paquets rendus accessibles à l'utilisateur.

source: In the console go to the tab :guilabel:`Self-service` rules.
fr: Dans la console, allez dans l'onglet :guilabel:`Règles de self-service`.

source: You can now create your first *selfservice* rule package.
fr: Vous pouvez maintenant créer votre premier paquet de règles *self-service*.

source: give a name to your new *selfservice* package;
fr: donner un nom au nouveau paquet de *self-service* ;

source: click on :guilabel:`Add` to add an Active Directory group (at the bottom left);
fr: cliquer sur :guilabel:`Ajouter` pour ajouter un groupe Active Directory (en bas à gauche) ;

source: name the *selfservice* group (with :kbd:`F2` or type directly into the cell);
fr: nommer le groupe *self-service* (avec :kbd:`F2` ou tapez directement dans la cellule) ;

source: drag the allowed software and configuration packages for this *selfservice* group into the central column;
fr: faire glisser les paquets logiciels et les paquets de configuration autorisés pour ce groupe *self-service* dans la colonne centrale ;

source: add as many groups as you want in the package;
fr: ajouter autant de groupes que nécessaire dans le paquet ;

source: save the package and deploy the package on your selection of hosts;
fr: enregistrer le paquet et le déployer sur une sélection de machines ;

source: once the package is deployed, only allowed packages listed in the *selfservice* group(s) of which the :term:`User` is a member will be shown to the logged in :term:`User`;
fr: une fois le paquet déployé, seuls les paquets autorisés listés dans le(s) groupe(s) *self-service* dont l':term:`Utilisateur` est membre seront affichés pour l':term:`Utilisateur` actuellement connecté ;

source: How to use the self-service on the user station?
fr: Comment utiliser la focntionnalité de *self-service* ?

source: The self-service is accessible to users in the start menu under the name :guilabel:`Self-Service software WAPT`.
fr: Le self service est accessible aux utilisateurs dans le menu démarrer sous le nom "Self service logiciels WAPT".

source: It is also available directly in :file:`<base>\\waptself.exe`.
fr: Il est aussi disponible directement à :file:`<base>\\waptself.exe`

source: The login and password to enter when launching the self-service are the User's credentials (local or Active Directory credentials).
fr: Les identifiants à entrer au démarrage du self service sont ceux de Windows (local ou active directory).

source: The self-service then displays a list of packages available for installation.
fr: Le self service affiche ensuite une liste de paquets disponibles pour l'installation.

source: the user can have more details on each package with the :guilabel:`+` icon;
fr: L'utilisateur peut avoir plus de détails sur chaque paquets en cliquant sur le "+".

source: different filters are available for the user on the left side panel;
fr: Différents filtres sont disponibles pour l'utilisateur sur le panneau de gauche.

source: the :guilabel:`Update Catalog` button is used to force a :command:`wapt-get update` on the WAPT agent;
fr: Le bouton "mettre à jour le catalogue" est utilisé pour forcer un "wapt-get update" sur l'agent WAPT.

source: the list of package categories is displayed to the user. To add a category to the list, you must specify the category in the *categories* section of the :file:`control` file of the relevant package;
fr: La liste des catégories de paquets est disponible pour l'utilisateur. Pour ajouter une catégorie à la liste, vous devez juste spécifier une nouvelle catégorie dans le fichier control de paquet souhaité. Précisément dans le champ "categories".

source: the current task list of the WAPT agent is available with the :guilabel:`task bar` button;
fr: Les tâches actuellement en cours par l'agent wapt sont disponibles en cliquant sur le bouton "task bar".

source: it is possible to change the language of the interface with the :guilabel:`configuration` button at the bottom left.
fr: Il est possible de changer le langage de l'interface en cliquant sur le bouton de configuration en bas à gauche de l'interface.

source: Customizing the Self Service interface
fr: Personnaliser l'interface du libre-service

source: Adding the Logo of your Organisation
fr: Ajouter le logo de votre organisation

source: To do this, simply place the logo you want in :file:`<wapt>\\templates\\waptself-logo.png`
fr: Pour faire cela, placez simplement le logo que vous souhaitez à cet emplacement : :file:`<wapt>\\templates\\waptself-logo.png`

source: It is highly recommended to use a :mimetype:`.png` file with a *200 x 150px* resolution.
fr: Il est hautement recommandé d'utiliser une image PNG de dimension 200*150px.

source: Managing package categories
fr: Gérer les catégories de paquets

source: Default categories are:
fr: Les catégories par défaut sont :

source: You can create your own categories easily by filling the :file:`control` file's ``categories`` section of any WAPT package and write a new category of your choice, WAPT will automatically show the package in the new category.
fr: Vous pouvez créer vos propres catégories facilement en remplissant l'attribut ``catégories`` du fichier :file:`control` de n'importe quel paquet WAPT et écrire une nouvelle catégorie de votre choix, WAPT affichera automatiquement le paquet dans la nouvelle catégorie.

source: WAPT Agent Settings for WAPT Self-Service
fr: Paramétrage de WAPT Self-Service dans l'agent WAPT

source: Video demonstration
fr: Vidéo de démonstration
