Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/wapt-windows-update.po
Languages: fr

source: Using WAPT Windows Update Agent (WAPTWUA)
fr: Utiliser l'agent de mise à jour Windows (WAPTWUA)

source: WAPT, Windows, Updates, WUA, documentation
fr: WAPT, Windows, Mises à jour, WUA, documentation

source: Since version 1.7, WAPT is able to manage Windows Updates on your endpoints.
fr: Depuis la version 1.7, WAPT est capable de gérer les mises à jour Windows sur vos terminaux.

source: the internals of WAPTWUA is based on the :abbr:`WUA (Windows Update Agent)` API;
fr: le fonctionnement interne de WAPTWUA est basé sur l'API :abbr:`WUA (Windows Update Agent)` ;

source: for more information: https://docs.microsoft.com/en-us/windows/win32/wua_sdk/using-the-windows-update-agent-api;
fr: pour plus d'informations : https://docs.microsoft.com/en-us/windows/win32/wua_sdk/using-the-windows-update-agent-api ;

source: Working principle
fr: Principe de fonctionnement

source: Regularly, the WAPT server downloads an updated :file:`wsusscn2.cab` file from Microsoft servers. By default, downloads happen once a day and no download is triggered if the :file:`wsusscn2.cab` file has not changed since the last download.
fr: Régulièrement, le serveur WAPT télécharge un fichier :file:`wsusscn2.cab` mis à jour à partir des serveurs Microsoft. Par défaut, les téléchargements ont lieu une fois par jour et aucun téléchargement n'est déclenché si le fichier :file:`wsusscn2.cab` n'a pas été modifié depuis le dernier téléchargement.

source: WAPT Windows Update flow process
fr: Processus de mise à jour de Windows WAPT

source: In some cases, you may wish to push new KBs before the next Patch Tuesday release.
fr: Dans certains cas, vous souhaiterez peut-être diffuser de nouveaux KB avant la prochaine sortie du *Patch Tuesday*.

source: To do so, you may follow :ref:`this documentation <simple_msu_packaging>` on packaging :mimetype:`.msu` files for these *Out-of-band* updates.
fr: Pour cela, vous pouvez suivre :ref:`cette documentation <simple_msu_packaging>` pour packager des fichiers :mimetype:`.msu` pour ces mise à jour ponctuelles.

source: The :file:`wsusscn2.cab` file is then downloaded by the WAPT agent from its nearest repository and then passed on to the standard :abbr:`WUA (Windows Update Agent)` Windows utility to crunch the update tree for the host.
fr: Le fichier :file:`wsusscn2.cab` est ensuite téléchargé par l'agent WAPT à partir de son dépôt le plus proche et ensuite transmis à l'utilitaire standard *Windows Update Agent* Windows qui traitera l'arbre des mises à jour.

source: Regularly, the host will analyze the available updates using the :file:`wsusscn2.cab` file. The host will send its list of needed updates as determined by its WUA to the WAPT server.
fr: Régulièrement, la machine analysera les mises à jour disponibles en utilisant le fichier :file:`wsusscn2.cab`. La liste des mises à jour nécessaires déterminée par l'agent WUA est ensuite envoyée par l'hôte au serveur WAPT.

source: If an update is pending on the host and if that update is not present on the WAPT server, the server will download the needed update from official Microsoft servers.
fr: Si une mise à jour est en attente sur la machine et si cette dernière n'est pas présente sur le serveur WAPT, le serveur téléchargera la mise à jour nécessaire depuis les serveurs Microsoft.

source: This mode of operation allows to download only the necessary updates on the computers, thus saving bandwidth, download time and disk space.
fr: Ce mode de fonctionnement permet de ne télécharger que les mises à jour nécessaires sur les ordinateurs qui en ont besoin, économisant ainsi de la bande passante, du temps de téléchargement et de l\'espace disque.

source: Downloaded updates are stored:
fr: Les mises à jour téléchargées sont stockées :

source: on Linux hosts in :file:`/var/www/waptwua`;
fr: sur des serveurs Linux dans :file:`/var/www/waptwua` ;

source: on Windows hosts in :file:`C:\\wapt\\waptserver\\repository\\waptwua`;
fr: sur des machines Windows dans :file:`C:\wapt\waptserver\repository\waptwua` ;

source: The WAPT Windows Update Agent repository download URL is based on the ``repo_url`` parameter in :file:`wapt-get.ini`:
fr: L'URL de téléchargement des mise à jour Windows depuis le dépôt WAPT est basée sur le paramètre ``repo_url`` du fichier :file:`wapt-get.ini` :

source: in case of repository replication, it is fully operational with WAPT Windows Update to reduce bandwidth use;
fr: la réplication des WAPT Windows Update fonctionne pour réduire l\'usage de la bande passante ;

source: do not forget to synchronize the :file:`waptwua` folder if you are replicating your packages with distant repositories;
fr: n\'oubliez pas de synchroniser le dossier :file:`waptwua` si vous répliquez vos paquets avec des dépôts distants ;

source: If in your company, a proxy is needed to go out on the Internet, then be sure to :ref:`set the proxy server in the waptserver.ini file <waptserver_configuration>`.
fr: Si dans votre organisation, un proxy est nécessaire pour sortir sur Internet, alors assurez-vous de :ref:`définir le serveur proxy dans le fichier waptserver.ini <waptserver_configuration>`.

source: Difference between WAPT Windows Updates and WSUS
fr: Différence de fonctionnement des mises à jour Windows entre WAPT et WSUS

source: WSUS downloads by default the updates for selected categories. This can lead to very a very large update database and lots of storage used.
fr: Le WSUS télécharge par défaut toutes les mises à jour pour les catégories sélectionnées. Cela peut conduire à une base de données de mises à jour géante et à l'utilisation de beaucoup de stockage.

source: WAPT Windows Update only downloads updates that have been requested by at least one computer client. This helps to keep the local database small (a few 10s of Gigabytes) and it can be easily cleaned up if you want to recover space.
fr: WAPT Windows Update ne télécharge que les mises à jour qui ont été demandées par au moins une machine. Cela permet de conserver une petite base de données (quelques dizaines de gigaoctets) et elle peut être facilement nettoyée si vous voulez récupérer de l'espace.

source: Major OS upgrades
fr: Mises à jour majeures du système d'exploitation

source: Major OS upgrade are upgrades from one OS version to another. That includes, for example, upgrades from Windows 7 to Windows 10, or from Windows 10 1803 to Windows 10 1903.
fr: Les mises à niveau majeures du système d'exploitation sont des mises à niveau d'une version du système d'exploitation à une autre. Cela comprend, par exemple, les mises à niveau de Windows 7 à Windows 10, ou de Windows 10 1803 à Windows 10 1903.

source: Major upgrade versions are not handled in the same way as minor OS upgrades. Major upgrades are handled via the download of the new install ISO content (same content as for a fresh install) and running the :command:`setup.exe` with the correct parameters. This process is the same for WSUS, SCCM and WAPT Windows Updates.
fr: Les mises à jour majeures ne sont pas traitées de la même manière que les mises à jour mineures du système d'exploitation. Les mises à jour majeures sont traitées par le téléchargement du nouveau contenu ISO d'installation (le même contenu que pour une nouvelle installation) et l'exécution de la commande :command:`setup.exe` avec les paramètres corrects. Ce processus est le même pour les mises à jour Windows WSUS, SCCM et WAPT.

source: In the case of WAPT Windows Updates, you need to create a OS update package using a template package provided on https://store.wapt.fr.
fr: Dans le cas des mises à jour Windows WAPT, vous devez créer un paquet de mise à jour du système d'exploitation en utilisant un paquet modèle fourni sur https://store.wapt.fr.

source: Driver upgrades
fr: Mises à niveau des pilotes

source: Driver upgrades via WSUS are not recommanded since it is hard to properly handle side effects. In the case of WAPT Windows Updates, **DRIVERS ARE NOT DOWNLOADED** since they are not referenced in the :file:`wsusscn2.cab` files provided by Microsoft.
fr: Les mises à niveau des conducteurs via le WSUS ne sont pas recommandées car il est difficile de gérer correctement les effets secondaires. Dans le cas des mises à jour dans WAPT, les **PILOTES NE SONT PAS TÉLÉCHARGÉS** car ils ne sont pas référencés dans les fichiers :file:`wsusscn2.cab` fournis par Microsoft.

source: It is recommanded to push driver updates via a custom WAPT package. If the driver patch is packaged as a :mimetype:`msu`, you may package it as a standard WAPT package.
fr: Il est recommandé de pousser les mises à jour des pilotes via un paquet WAPT personnalisé. Si le correctif pour un pilote est packagé sous la forme d'un :mimetype:`msu`, vous pouvez le conditionner sous la forme d'un paquet WAPT standard.

source: Just select the :file:`msu` file and click :menuselection:`Create package` in the WAPT console to launch the wizard for simply creating new WAPT packages.
fr: Il suffit de sélectionner le fichier :file:`msu` et de cliquer sur :menuselection:`Créer un paquet` dans la console WAPT pour lancer l'assistant permettant de créer simplement de nouveaux paquets WAPT.

source: If the driver update is packaged as a :mimetype:`zip` containing the :file:`exe` file, you can create a WAPT package containing the necessary files and :program:`setup.exe` binary with the correct silent flag.
fr: Si la mise à jour du pilote est présentée sous la forme d'un paquet :mimetype:`zip` contenant le fichier :file:`exe`, vous pouvez créer un paquet WAPT contenant les fichiers nécessaires et le binaire :program:`setup.exe` avec les paramètres silencieux corrects.

source: Out of band KB
fr: KB hors bande

source: Microsoft sometimes provides :abbr:`OOB (Out of Band)` updates that are not contained in the :file:`wsusscn2.cab` index. Those updates are not included in the main update because they may fix a very specific problem or may have drawbacks in some situation.
fr: Microsoft fournit parfois des mises à jour de type :abbr:`OOB (Out of Band)` qui ne sont pas contenues dans l'index :file:`wsusscn2.cab`. Ces mises à jour ne sont pas incluses dans la mise à jour principale car elles peuvent corriger un problème très spécifique ou présenter des inconvénients dans certaines situations.

source: If you want to deploy an OOB KB update, you can download it from the microsoft catalog https://www.catalog.update.microsoft.com/Home.aspx.
fr: Si vous souhaitez déployer une mise à jour OOB KB, vous pouvez la télécharger à partir du catalogue microsoft https://www.catalog.update.microsoft.com/Home.aspx.

source: You have to be carefull that OOB updates may break your system, be sure to read the prerequisites on the Microsoft bulletin corresponding to the update and thoroughly test the update.
fr: Vous devez faire attention au fait que les mises à jour OOB peuvent casser votre système, assurez-vous de lire les conditions préalables sur le bulletin Microsoft correspondant à la mise à jour et de tester la mise à jour de manière approfondie.

source: Configuring WAPTWUA on the WAPT agent
fr: Configurer WAPTWUA sur l'agent WAPT

source: *WAPTWUA* is configured in :file:`wapt-get.ini`.
fr: *WAPTWUA* est configuré dans :file:`wapt-get.ini`.

source: Add ``[waptwua]`` section.
fr: Ajouter une section ``[waptwua]``.

source: You then have several options:
fr: Vous avez alors plusieurs options :

source: Configuration options in the ``[waptwua]`` section in the :file:`wapt-get.ini`
fr: Options de configuration dans la section ``[waptwua]`` du :file:`wapt-get.ini`

source: Default Value
fr: Valeur par défaut

source: Enable or disable WAPTWUA on this machine.
fr: Activez ou désactivez WAPTWUA sur cette machine.

source: Allow direct download of updates from Microsoft servers if the WAPT server is not available
fr: Autoriser le téléchargement direct des mises à jour à partir des serveurs Microsoft si le serveur WAPT n'est pas disponible

source: Set if missing update is authorized or not by default
fr: Définir si la mise à jour manquante est autorisée ou non par défaut

source: Type='Software' or Type='Driver'
fr: Type='Software' ou Type='Driver'

source: Define the filter to apply for the Windows update scan
fr: Définir le filtre à appliquer pour l'analyse des mises à jour Windows

source: Set the Windows Update scan recurrence (Will not do anything if *waptwua* package rule or :file:`wsusscn2.cab` file have not changed) (ex: 2h)
fr: Définir la fréquence d'analyse des mises à jour Windows (Ne fera rien si la règle du paquet *waptwua* ou le fichier :file:`wsusscn2.cab` n'ont pas changé) (ex : 2h)

source: Set the Windows Update install recurrence (Will do nothing if no update is pending) (ex: 2h)
fr: Définir la fréquence d'installation des mises à jour Windows (Ne fera rien si aucune mise à jour n'est en attente) (ex : 2h)

source: Install update when the machine will shutdown
fr: Installe les mises à jour à l'extinction de la machine

source: Set a deferred installation delay before publication in the repository (ex: 7d)
fr: Définir un délai d'installation différé avant la publication dans le dépôt (ex : 7d)

source: Define a severity list that will be automatically accepted during a WAPT windows update scan. ex: *Important*, *Critical*, *Moderate*
fr: Définit une liste de niveaux de gravité qui sera automatiquement acceptée lors d'un scan de mise à jour Windows avec WAPT Windows Update. ex : *Important*, *Critical*, *Moderate*

source: These options can be set when generating the agent.
fr: Ces options peuvent être définies lors de la génération de l'agent.

source: Example ``[waptwua]`` section in :file:`wapt-get.ini` file:
fr: Exemple de section ``[waptwua]`` dans le fichier :file:`wapt-get.ini` :

source: The :guilabel:`install_scheduling` option will try every 12 hours to install updates on client. It is not in graphical options due to a potential danger. Indeed, trying to install updates on your IT infrastructure while working hours can impact your production.
fr: L'option :guilabel:`install_scheduling` essaiera d'installer les misesà jours pour le client toutes les 12 heures. Cette option n'est pas graphique car elle représente un danger potentiel. En effet, tenter d'installer les misesà jour sur votre parc informatique pendant les heures de travail peut impacter votre production.

source: When you create the :file:`waptagent.exe` from your console, these options are equivalent to this:
fr: Lorsque vous créer waptagent.exe depuis la console, ces options sont équivalentes à celles-ci :

source: if :guilabel:`default_allow` option is ``True`` and Wapt WUA is enabled too, clients will contact the WAPT Server and ask to download the missing updates. The clients will install missing updates on their own at time of upgrade.
fr: si l'option :guilabel:`default_allow` est à ``True`` et que Wapt WUA est activé aussi,le client va contacter le serveur WAPT et va demander à télécharger les mises à jour manquantes. Le client installera ses mises à jour tout seul.

source: Example package source code to modify ``[waptwua]`` settings:
fr: Exemple de code source d'un paquet pour modifier les paramètres ``[waptwua]`` :

source: Using WAPTWUA from the console
fr: Utiliser de WAPTWUA depuis la console

source: The :guilabel:`WAPT Windows Update Agent` tab in the WAPT console comes with two sub-menus to manage WAPTWUA.
fr: L'onglet :guilabel:`WAPT Windows Update Agent` de la console WAPT est fourni avec deux sous-menus pour gérer WAPTWUA.

source: WAPTWUA Package
fr: Paquet WAPTWUA

source: The :guilabel:`WAPTWUA Package` tab allows you to create *waptwua* rules packages.
fr: L'onglet :guilabel:`WAPTWUA Package` vous permet de créer des paquets de règles *waptwua*.

source: when this type of package is installed on a machine, it indicates to the WAPTWUA agent the authorized or forbidden :abbr:`KBs (Knowledge Base articles)`;
fr: lorsque ce type de paquet est installé sur une machine, il indique à l'agent WAPTWUA les :abbr:`KBs (Knowledge Base articles)` autorisés ou interdits ;

source: when several *waptwua* packages are installed on a machine, the different rules will be merged;
fr: lorsque plusieurs paquets *waptwua* sont installés sur une machine, les différentes règles seront fusionnées ;

source: when a :file:`cab` is neither mentioned as authorized, nor mentioned as prohibited, WAPT agents will then take the value of ``default_allow`` in :file:`wapt-get.ini`;
fr: lorsqu'un :file:`cab` n'est ni mentionné comme autorisé, ni mentionné comme interdit, les agents WAPT prendront alors la valeur ``default_allow`` dans le fichier :file:`wapt-get.ini` ;

source: If a Windows update has not yet been downloaded to the WAPT server, then the WAPT agent will flag the update as *MISSING*.
fr: Si une mise à jour Windows n'a pas encore été téléchargée sur le serveur WAPT, l'agent WAPT marquera la mise à jour comme *MISSING*.

source: if the WAPTWUA agent configuration is set to ``default_allow = True``, then it will be necessary to specify the forbidden :file:`cab`;
fr: si la configuration de l'agent WAPTWUA est définie avec ``default_allow = True``, alors il sera nécessaire de spécifier la cabine interdite ;

source: if the WAPTWUA agent configuration is set to ``default_allow = False``, then it will be necessary to specify the authorized :file:`cab`;
fr: si la configuration de l'agent WAPTWUA est définie avec ``default_allow = False``, alors il sera nécessaire de spécifier le :file:`cab` autorisé ;

source: to test updates on a small set of computers, you can set WAPTWUA default value to ``default_allow = False``;
fr: pour tester les mises à jour sur un petit nombre d'ordinateurs, vous pouvez définir la valeur par défaut de WAPTWUA avec ``default_allow = False`` ;

source: you can test updates on a small sample of hosts and if everything is good, you can release the updates to the entire fleet of computers;
fr: vous pouvez tester les mises à jour sur un petit échantillon de machines et si tout va bien, vous pouvez diffuser les mises à jour sur l'ensemble de la base des ordinateurs ;

source: Creating a *waptwua* Package
fr: Créer un paquet *waptwua*

source: Windows Updates list tab
fr: Onglet Liste des mises à jour de Windows

source: The :guilabel:`Windows Update List` tab lists all needed Windows Updates.
fr: L'onglet :guilabel:`Windows Update List` liste toutes les mises à jour Windows nécessaires.

source: The server does not scan the :file:`wsussc2.cab` itself, it lets the WUA wapt agents do it. If an update seems to you as missing from the list, you must run a scan on one of the machines present in the console. If you run a WUA scan on a Windows 7 agent, the CAB and Windows 7 files will be displayed on the Windows Update List tab.
fr: Le serveur ne scanne pas le fichier :file:`wsussc2.cab` lui-même, il laisse les agents WAPT le faire. Si une mise à jour vous semble manquer dans la liste, vous devez lancer un scan sur l'une des machines présentes dans la console. Si vous lancez un scan WUA sur un agent Windows 7, les fichiers CAB et Windows 7 seront affichés sur l'onglet Liste des mises à jour de Windows.

source: The left pane displays updates categories, allowing you to filter by:
fr: Le volet de gauche affiche les catégories de mises à jour, vous permettant de filtrer par :

source: criticality;
fr: la criticité ;

source: product;
fr: le produit ;

source: classification;
fr: la classification ;

source: In the right panel grid, if the :guilabel:`Downloaded on` column is empty, it means that the update has not yet been downloaded by the WAPT server and is not present on the WAPT server (This update is not missing on any host).
fr: Dans la grille de droite, si la colonne :guilabel:`Downloaded on` est vide, cela signifie que la mise à jour n'a pas encore été téléchargée par le serveur WAPT et n'est pas présente sur le serveur WAPT (Cette mise à jour ne manque sur aucun hôte).

source: you can force the download of an update by :menuselection:`right-click --> Download`;
fr: vous pouvez forcer le téléchargement d'une mise à jour par :menuselection:`Clic droit --> Télécharger` ;

source: you can also force the download of the :file:`wsusscn2.cab` file with the :guilabel:`Download WSUSScan cab from Microsoft Web Site` button;
fr: vous pouvez également forcer le téléchargement du fichier :file:`wsusscn2.cab` avec le bouton :guilabel:`Download WSUSScan cab from Microsoft Web Site` ;

source: you can see the Windows Updates download on the server with the :guilabel:`Show download task` button;
fr: vous pouvez voir le téléchargement des mises à jour Windows sur le serveur avec le bouton :guilabel:`Montrer les téléchargements` ;

source: To cleanup your :file:`waptwua` folder, you can remove no longer needed Windows updates. WAPT server will only re-download deleted updates if one of the WAPT equipped hosts requests it;
fr: Pour nettoyer votre dossier :file:`WAPTWUA`, vous pouvez supprimer les mises à jour Windows qui ne sont plus nécessaires. Le serveur WAPT ne re-téléchargera les mises à jour supprimées que si l'un des hôtes équipés de WAPT le demande ;

source: Launch WUA on clients
fr: Lancer WAPT WUA sur le client

source: From the console you have three options.
fr: Vous avez alors trois options.

source: The :guilabel:`Trigger the scan of pending Windows Updates` button will launch the scan on the client and list all updates flagged for the OS. You can scan the client from the console like that or by using :command:`wapt-get waptwua-scan` from the command-line.
fr: Le bouton :guilabel:`Rechercher des mises ç jour Windows` lance l'analyse sur le client WAPT et liste toutes les mises à jour signalées pour le système d'exploitation. Vous pouvez scanner le client depuis la console comme cela ou en utilisant la commande :command:`wapt-get waptwua-scan` depuis la ligne de commande.

source: Every 30 minutes, the WAPT Server will look for updates that have been requested at least once by WAPT Clients and that have not yet been downloaded and cached. If an update is pending, the WAPT Server will download it from official Microsoft servers.
fr: Toutes les 30 minutes, le serveur WAPT recherche les mises à jour qui ont été demandées au moins une fois par les clients WAPT et qui n'ont pas encore été téléchargées et mises en cache. Si une mise à jour est en attente, le serveur WAPT la téléchargera à partir des serveurs officiels de Microsoft.

source: You can force this scan with the :guilabel:`Download index and missing cabs from Microsoft Web site` button in tab :menuselection:`Windows Updates --> Windows Updates list`
fr: Toutes les 30 minutes, le serveur va scanner tous les clients afin devérifier si une mise à jour en attente. Si elle n'est pas présente dans ses dépôts,le serveur wapt va la télécharger depuis les serveurs de Microsoft. Vous pouvezforcer ce scan avec le bouton :guilabel:`Télécharger l'index et les cabs manquant depuis le site de MS` dans l'onglet :menuselection:`Windows Updates --> Liste des mises à jour Windows`

source: If you want to download from the console, use the :guilabel:`Trigger the download of pending Windows Updates` button.
fr: Si vous voulez télécharger depuis la console, cliquez sur le bouton :guilabel:`Lancer le téléchargement des Mises à jour Windows en attente`.

source: The command-line for downloading kb from the client is :command:`wapt-get waptwua-download`, it will scan the current status of Windows against current rules, download missing kb and send the result to the server.
fr: La ligne de commande pour le téléchargement de kb depuis le client est :command:`wapt-get waptwua-download`, elle va analyser l'état actuel de Windows par rapport aux règles en vigueur, télécharger les kb manquants et envoyer le résultat au serveur.
