Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/wapt-profile-package.po
Languages: fr

source: Using profile bundles in WAPT
fr: Utiliser des paquets profils dans WAPT

source: Feature only available with WAPT **Enterprise**.
fr: Cette fonctionnalité est disponible uniquement dans la version **WAPT Enterprise**.

source: Working principle
fr: Principe de fonctionnement

source: WAPT Enterprise offers Active Directory profile bundle functionnality.
fr: WAPT Enterprise permet d'utiliser la fonctionnalité des paquets profile Active Directory.

source: It automates installation of WAPT software and configuration packages on hosts, based on their membership to Active Directory Computer Security Groups.
fr: Cela permet d'automatiser l'installation de logiciels à partir des groupes de sécurité d'Ordinateurs Active Directory.

source: **Active Directory Computer's security groups contains Computers, not Users**.
fr: **Les groupes de sécurité d'Ordinateur contiennent des Ordinateurs, pas des Utilisateurs**.

source: Active Directory computer group
fr: Groupe d'ordinateurs Active Directory

source: Automatically installing software and configurations based on user and user group membership is not implemented with WAPT. This use case is better served with the differenciated :ref:`self-service <wapt-selfservice>` feature that is also available with WAPT Enterprise.
fr: L'installation automatique de logiciels et de configurations basées sur un utilisateur ou l'appartenance à un groupe d'utilisateurs n'est pas mise en œuvre avec WAPT. Ce cas d'utilisation est mieux servi par la fonction de :ref:`self-service différencié <wapt-selfservice>` qui est également disponible avec WAPT Enterprise.

source: Creating profile bundle packages in WAPT console
fr: Creation d'un paquet profile dans la console WAPT

source: You can create *profile* bundle packages by clicking on :menuselection:`Bundles -> Create AD Profile`.
fr: Vous pouvez créer un paquet *profile* en cliquant sur :menuselection:`Groupes -> Nouveau profil AD`.

source: Right-click on OU to create unit bundle
fr: Cliquer avec le bouton droit de la souris sur l'UO pour créer un paquet *profile*

source: Requirements:
fr: Pré-requis :

source: the *profile* package name must be **exactly** the same as the AD Security group name;
fr: le nom du paquet *profil* doit être **exactement** le même que le nom du groupe de sécurité AD ;

source: the *profile* package name is case sensitive;
fr: le nom du paquet *profil* est sensible à la casse ;

source: Example:
fr: Exemple :

source: AD Security group: ``HW_laptops``;
fr: Groupe de sécurité AD : ``HW_laptops`` ;

source: WAPT profile bundle: ``HW_laptops``;
fr: Paquet *profile* WAPT : ``HW_laptops`` ;

source: A window opens and you are prompted to choose which packages must be in the just created **profile** bundle.
fr: Une fenêtre s'ouvre et vous demande de choisir les paquets qui doivent être dans ce paquet **profile**.

source: Adding package to profile bundle
fr: Ajouter des paquets au paquet profile

source: Save the *profile* bundle package and it will be uploaded to the WAPT server.
fr: Sauvegarder le paquet *profile* et il sera chargé sur le serveur WAPT.
