Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/wapt-web-interface.po
Languages: fr

source: Using the local web interface
fr: Utiliser l'interface web

source: Users and Local Administrators may access informations and perform WAPT actions directly from the host by visiting http://localhost:8088.
fr: L'utilisation locale de l'interface Web (http://localhost:8088) permet à l'utilisateur ou à l'administrateur d'accéder aux informations et fonctionnalités WAPT sur la machine.

source: Opening the WAPT web interface
fr: Ouverture de l'interface Web

source: The WAPT web interface opens by :menuselection:`Right-clicking on the WAPT icon in the Windows notification tray --> View software status`.
fr: L'interface Web s'ouvre en faisant :menuselection:`Clic-droit sur l'icône WAPTtray dans la barre des notifications --> Afficher le statut des logiciels`.

source: It is also accessible directly from a web browser by visiting http://localhost:8088.
fr: On pourra y accéder également directement depuis un navigateur à l'adresse : http://localhost:8088.

source: WAPT web interface
fr: Ouverture de l'interface Web

source: Description of the WAPT web interface
fr: Description de l'interface Web

source: The WAPT agent web interface is composed of 4 tabs:
fr: L'interface Web de l'agent WAPT se décompose en 4 onglets :

source: the :guilabel:`WAPT` tab that shows the status of the host and some system related informations;
fr: :guilabel:`Onglet WAPT` : statut de la machine et informations système ;

source: the :guilabel:`Installed packages` tab that lists the packages that are installed on the host;
fr: :guilabel:`Paquets installés` : liste des paquets présents sur la machine ;

source: the :guilabel:`List of packages` that lists the WAPT packages available on registered repositories;
fr: :guilabel:`Liste des paquets` : liste des paquets disponibles sur le dépôt local ;

source: the :guilabel:`Tasks` that lists tasks in *pending*, *done* and *error* states;
fr: :guilabel:`Tâches` : liste des tâches en attente, réalisées et en erreur ;

source: Available actions from the WAPT agent web interface
fr: Actions réalisables depuis l'interface Web

source: viewing host information, updating and upgrading actions are available for every users;
fr: La consultation et les actions d':command:`update` et d':command:`upgrade` sont disponibles pour tous les utilisateurs ;

source: Other actions need :term:`Local Administrator` rights; they are also available to users who are members of the *waptselfservice* Active Directory security group.
fr: Le reste des actions nécessite des droits :term:`Administrateur Local` ; elles sont également accessibles aux membres du groupe de sécurité **waptselfservice** que vous aurez créé dans Active Directory ;

source: Refreshing the list of available package:
fr: actualiser la liste des paquets disponibles :

source: In the tab :menuselection:`List of packages --> Update available packages`.
fr: Dans l'onglet :menuselection:`Liste des paquets --> Mettre à jour la liste des paquets disponibles`.

source: Installing a package:
fr: installer un paquet :

source: In the tab :menuselection:`List of packages --> Install` the desired package.
fr: Dans l'onglet :menuselection:`Liste des paquets --> Installer` en face du nom du paquet voulu.

source: clearing the cache:
fr: vider le cache des paquets :

source: In the tab :menuselection:`List of packages --> Clear package cache`.
fr: Dans l'onglet :menuselection:`Liste des paquets --> Vider le cache des paquets`.
