Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-usage/wapt-windows-update.po
Languages: fr

source: If you want to install the pending update(s), use :command:`wapt-get waptwua-install` from the command-line prompt.
fr: Si vous voulez installer la ou les mise(s) à jour en attente, utilisez :command:`wapt-get waptwua-install` à partir de l'invite de ligne de commande.

source: If you want to trigger the installation from the console, click on :guilabel:`Trigger the install of pending Windows Updates` button.
fr: Si vous voulez télécharger depuis la console, cliquez sur le bouton :guilabel:`Lancer le téléchargement des Mises à jour Windows en attente`.

source: When you want to install the pending updates stored in cache, the WAPT Service triggers the :abbr:`WUA (Windows Update Agent)` service.
fr: Lorsque vous souhaitez installer les mises à jour en attente stockées dans le cache, le service WAPT déclenche le service :abbr:`WUA (Windows Update Agent)`.

source: The WAPT Service will enable and start the WUA Service temporarily to install the updates. When updates are installed, waptservice will stop and disable the WUA service until the next cycle.
fr: Le service WAPT activera et démarrera temporairement le service WUA pour installer les mises à jour. Lorsque les mises à jour seront installées, le service WAPT arrêtera et désactivera le service WUA jusqu'au prochain cycle.

source: Video demonstration
fr: Vidéo de démonstration
