Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-security/security-configuration-certificate-authentication.po
Languages: fr

source: Configuring Client-Side Certificate Authentication
fr: Configurer l'authentification par Certificat sur le Client

source: certificat, WAPT, SSL / TLS, Certificate Authority, documentation
fr: certificat, WAPT, SSL / TLS, Certificat d'Authorité, documentation

source: This feature is only available with WAPT **Enterprise**.
fr: Cette fonctionnalité n'est disponible qu'en version **Enterprise** de WAPT.

source: If your business needs a public WAPT server on Internet, it can be secured with **Client-Side Certificate Authentication**.
fr: Si votre entreprise a besoin d'un serveur WAPT ouvert sur Internet, il peut être securisé grâce à l'**authentification par Certificat sur le Client**.

source: That configuration restricts the visibility of the WAPT Server to registered clients only. It is done by relying on the WAPT agent's private key generated during registration. It works as follows:
fr: Cette configuration restreint la visibilité du serveur WAPT aux clients enregistrés uniquement. Cela se base sur la clé privée de l'agent généré lors de son enregistrement. Il marche comme ce qui suit:

source: the WAPT agent sends a :abbr:`CSR (Certificate Signing Request)` to the WAPT server which the WAPT server signs and sends back to WAPT agent;
fr: l'agent WAPT envoie un :abbr:`CSR (Certificate Signing Request)` au serveur WAPT que ce dernier va signer et renvoyer à l'agent WAPT;

source: using the signed certificate, the agent can access protected parts of the :program:`Nginx` web server;
fr: en utilisant le certificat signé, l'agent peut accéder à l'arborescence protégée du serveur web :program:`Nginx`;

source: We advise you to enable Kerberos or login / password registration in WAPT Server post-configuration.
fr: Nous vous recommandons d'activer Kerberos ou bien l'enregistrement par identifiant / mot de passe dans le post-configuration du serveur WAPT.

source: Enabling Client-Side Certificate Authentication
fr: Activer l'authentification par Certificat sur le Client

source: add a :program:`Nginx` configuration file :file:`/etc/nginx/certificate-auth.conf`. This file is used to restrict access to specific actions with Certificate Authentication:
fr: Ajoutez une configuration :program:`Nginx` dans le fichier :file:`/etc/nginx/certificate-auth.conf`. Ce fichier est utilisé pour restreindre l'accès aux actions propres au Certificat d'Authentification:

source: Example config file:
fr: Exemple d'un fichier de configuration:

source: Be careful, as of |date|, WAPT does not support :abbr:`CRL (Certificate Revocation Lists)`, which means that when you delete a machine in the WAPT console, the machine will still have access to the WAPT repository.
fr: Soyez prudent, en date du |date|, WAPT ne supporte pas les :abbr:`CRL (Certificate Revocation Lists)`, ce qui signifie que lorsque vous supprimez une machine dans la console WAPT, la machine pourra toujours accéder au répertoire WAPT.
