Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-security/security-configuration-auth-ad.po
Languages: fr

source: Configuring authentication against Active Directory
fr: Configurer l'authentification par Active Directory

source: Feature only available with WAPT **Enterprise**.
fr: Fonctionnalité uniquement disponlible dans le version **Enterprise** de WAPT

source: By default, the WAPT Server is configured with a single :term:`SuperAdmin` account whose password is setup during initial post-configuration.
fr: Par défaut, le serveur WAPT est configuré avec un seul compte :term:`SuperAdmin` dont le mot de passe est configuré lors du premier post-configuration.

source: On large and security-minded network, this :term:`SuperAdmin` account should not be used since it cannot provide the necessary traceability for administrative actions that are done on the network.
fr: Sur un vaste réseau sécurisé, ce compte :term:`SuperAdmin` ne devrait pas être utilisé puisqu'il ne peut fournir une traçabilité nécessaire sur les actions d'administration menées sur le réseau.

source: It is thus necessary to configure authentication against the :term:`Organization`'s Active Directory for the :term:`Administrators` and the :term:`Package Deployers`; this will allow to use named accounts for administrative tasks.
fr: Il est donc nécessaire de configurer l'authentification par l'Active Directory de l':term:`Organisation` pour les :term:`Administrateurs` et les :term:`Déployeurs de paquets`; cela permettra d'utiliser des comptes nominatifs pour les tâches d'administration.

source: Active Directory authentication is used to authenticate access to the inventory via the WAPT Console;
fr: L'authentification par Active Directory est utilisé pour accéder à l'inventaire via la console WAPT;

source: however, all actions on the WAPT equipped remote devices are based on X.509 signatures, so an :term:`Administrator` will need both an Active Directory login **AND** a private key whose certificate is recognized by the remote devices to manage his installed base of devices using WAPT;
fr: cependant, toutes les actions menées sur les appareils équipés de WAPT sont basées sur les signatures X.509, un :term:`Administrateur` aura donc besoin d'un compte dans l'Active Directory **ET** d'une clé privée dont le certificat est reconnu par l'appareil avec WAPT qui va piloter le parc;

source: only the :term:`SuperAdmin` account and the members of the Active Directory security group **waptadmins** will be allowed to upload packages on the main repository (authentication mode by login and password);
fr: seul le compte :term:`SuperAdmin` et les membres du groupe **waptadmins** dans l'Active Directory pourra téléverser des paquets dans le répertoire principal ( le mode d'authentification se fait par login et mot de passe);

source: Enabling Active Directory authentication
fr: Activer l'authentification par Active Directory

source: to enable authentication of the WAPT server on Active Directory, configure the file :file:`/opt/wapt/conf/waptserver.ini` as follows:
fr: pour activer l'authentification par Active Directory sur le serveur WAPT, configurez les fichier :file:`/opt/wapt/conf/waptserver.ini` comme ceci:

source: Settings
fr: Réglages

source: Value
fr: Valeur

source: DN to the group name. All members of this group will be able to connect to WAPT
fr: DN du nom du groupe. Tous les membres de ce groupe pourra se connecter à WAPT

source: LDAP server that will be used by WAPT
fr: Le serveur LDAP qui sera utilisé par WAPT

source: DN for the search
fr: DN pour la recherche

source: Default value: True
fr: Valeur par défaut : True

source: restart :program:`waptserver` with :code:`systemctl restart waptserver`;
fr: redémarrez :program:`waptserver` avec :code:`systemctl restart waptserver`;

source: For Microsoft Active Directory, Microsoft has `announced <https://support.microsoft.com/en-gb/help/4520412/2020-ldap-channel-binding-and-ldap-signing-requirements-for-windows>`_ that *SimpleBind* authentication on MS-AD without SSL/TLS will be blocked by default from April 2020. If you don't have a certificate installed, you'll have to modify a registry key to have authentication working.
fr: Pour Microsoft Active Directory, Microsoft a `annoncé <https://support.microsoft.com/en-gb/help/4520412/2020-ldap-channel-binding-and-ldap-signing-requirements-for-windows>`_ que l'authentification *SimpleBind* sur MS-AD sans SSL/TLS sera bloquée par défaut à partir d'avril 2020. Si vous n'avez pas de certificat installé, vous devrez modifier une clé de registre pour que l'authentification fonctionne.

source: By default Samba-AD does not allow *SimpleBind* authentication without SSL/TLS. If you do not have a valid certificate you'll need to modify the ``ldap server require strong auth`` parameter in :file:`/etc/samba/smb.conf`. For more information you may refer to Tranquil IT documentation on https://dev.tranquil.it/samba/en/index.html.
fr: Par défaut, Samba-AD ne permet pas l'authentification *SimpleBind* sans SSL/TLS. Si vous ne disposez pas d'un certificat valide, vous devrez modifier le paramètre "Serveur d'authentification forte" dans le fichier :file:`/etc/samba/smb.conf`. Pour plus d'informations, vous pouvez consulter la documentation de Tranquil IT sur https://dev.tranquil.it/samba/fr/index.html.

source: Enabling SSL/ TLS support for the LDAP connection to the Active Directory Domain Controller
fr: Activez le support SSL/ TLS pour les connexions LDAP dans le Contrôleur de Domaine Active Directory

source: By default, authentication on Active Directory relies on LDAP SSL (default port 646).
fr: Par défaut, l'authentification d'un Active Directory se repose sur du LDAP SSL (port par défaut 646).

source: SSL/ TLS is not enabled by default on Microsoft Active Directory until a SSL certificate has been configured for the Domain Controller.
fr: SSL /TLS n'est pas activé par défaut sur un Microsoft Active Directory jusqu'à ce qu'un certificat SSL soit configuré sur le Contrôleur de Domaine.

source: The WAPT Server uses the Certificate Authority *bundles* from the operating system (CentOS) for validating the SSL/ TLS connection to Active Directory.
fr: Le serveur WAPT utilise des *paquets* de Certificat d'Authorité du système d'exploitation (CentOS) pour valider la connexion SSL /TLS vers l'Active Directory.

source: If the Active Directory certificate is self-signed or has been signed by an internal CA, you'll need to add these certificates to the certificate store of CentOS.
fr: Si le certificat Active Directory est auto-signé ou a été signé par un CA interne, vous aurez besoin d'ajouter ces certificats au magasin de certificat de CentOS.

source: Add a :term:`Certificate Authority` in the :file:`/etc/pki/ca-trust/source/anchors/` and update the CA store.
fr: Ajouter un :term:`Autorité de Certification` dans le dossier :file:`/etc/pki/ca-trust/source/anchors/` et mettez à jour le magasin des CA.

source: once you have setup LDAP SSL/ TLS on your Active Directory (please refer to Microsoft documentation for that), then you can enable support for SSL/ TLS security for AD in :file:`/opt/wapt/conf/waptserver.ini`:
fr: une fois que le LDAP SSL/ TLS sur votre Active Directory est configuré (veuillez vous référer à la documentation Microsoft), vous pouvez activer le support pour la sécurité SSL /TLS pour AD dans :file:`/opt/wapt/conf/waptserver.ini`:
