Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-security/security-install-kerberos.po
Languages: fr

source: Configuring Kerberos authentication
fr: Configurer l'authentification par Kerberos

source: Kerberos, authentication, Debian, WAPT, documentation, RedHat, CentOS
fr: Kerberos, authentification, Debian, WAPT, documentation, RedHat, CentOS

source: without Kerberos authentication, you have to either trust initial registration or enter a password for each workstation on initial registration;
fr: sans l'authentification par Kerberos, vous devez soit faire confiance lors de l'enregistrement initial ou bien entrer un mot de passe pour chaque poste lors de l'enregistrement;

source: for more information, visit the documentation on :ref:`registering a machine with the WAPT Server <initial_machine_registration>` and :ref:`signing inventory updates <signing_inventory_updates>`;
fr: pour plus d'information, consultez la documentation :ref:`enregistrer une machine sur le serveur WAPT <initial_machine_registration>` et :ref:`signer les mises à jour d'inventaire <signing_inventory_updates>`;

source: the Kerberos authentication will be used only when registering the device;
fr: l'authentification par Kerberos ne sera uniquement utilisé que lors de l'enregistrement de l'appareil;

source: Installing the Kerberos components and configuring krb5.conf file
fr: Installer les composants pour Kerberos et configurer le fichier krb5.conf

source: For centos
fr: Sous centos

source: For Debian
fr: Sous Debian

source: The feature is not available with a WAPT Windows server
fr: Cette fonctionnalité n'est pas disponible avec un serveur WAPT Windows

source: Modify the :file:`/etc/krb5.conf` file and **replace all the content with the following 4 lines** replacing **MYDOMAIN.LAN** with your Active Directory domain name (i.e. *<MYDOMAIN.LAN>*).
fr: Modifiez le fichier :file:`/etc/krb5.conf` et **remplacez tout le contenu par les 4 lignes suivantes** en remplaçant **MYDOMAIN.LAN** par votre nom de domaine Active Directory (i.e. *<MYDOMAIN.LAN>*).

source: ``default_realm`` must be written with **ALL CAPS**!!
fr: Le ``default_realm`` doit absolument être écrit en **lettres MAJUSCULES** !!

source: Retrieving a service keytab. Use the :`command:`kinit` and :command:`klist`. You can use an :term:`Administrator` account or any other account with the delegated right to join a computer to the domain in the proper destination container (by default *CN=Computers*).
fr: Récupérez un ticket keytab. Utilisez les commandes :command:`kinit` et :command:`klist`. Vous pouvez utiliser compte :term:`Administrator` ou n'importe quel autre compte avec une délégation de droit permettant de joindre un poste au domaine dans la bonne OU de destination (par défaut *CN=Computers*).

source: In the shell transcript below, commands are in black and returned text is commented in light gray:
fr: Dans le shell retranscrit ci-dessous, les commandes sont en noir et le texte retouné est commenté en gris clair:

source: If the authentication request is successful, you can then create your HTTP Keytab with the :program:`msktutil` command.
fr: Si la requête d'authentification est réussie, vous pouvez créer votre HTTP Keytab avec la commande :program:`msktutil`.

source: Be sure to modify the *<DOMAIN_CONTROLER>* string with the name of your domain controller (eg: **srvads.mydomain.lan**).
fr: Assurez-vous de modifier l'entrée *<DOMAIN_CONTROLER>* avec le nom de votre contrôleur de domaine (eg: **srvads.mydomain.lan**).

source: Be sure to have properly configured your WAPT Server *hostname* before running these commands;
fr: Assurez-vous d'avoir correctement configuré le nom du serveur WAPT avant de lancer ces commandes;

source: In order to double check your *hostname*, you can run :code:`echo $(hostname)` and it must return the name that will be used by WAPT agent running on client workstations.
fr: Pour faire une double vérification de votre *hostname*, vous pouvez lancer :code:`echo $(hostname)` et cela doit vous retourner le nom qui sera utilisé par l'agent WAPT lancé sur les postes clients.

source: apply the proper access rights to the :file:`http-krb5.keytab` file:
fr: appliquez les bons droits d'accès au fichier :file:`http-krb5.keytab`:

source: on Debian:
fr: Sous Debian

source: on Centos:
fr: sous Centos

source: Post-configuring
fr: Post-configuration

source: You can now use post-configuration script to configure the WAPT Server to use Kerberos.
fr: Vous pouvez désormais utiliser le script de post-configuration pour configurer Kerberos sur le serveur WAPT.

source: The post-configuration script will configure :program:`Nginx` and the WAPT Server to use Kerberos authentication.
fr: Le script de post-configuration va configurer :program:`Nginx` et l'utilisation de l'authentification par Kerberos sur le serveur WAPT.

source: This post-configuration script must be run as **root**.
fr: Ce script de post-configuration doit être lancé en tant que **root**.

source: Kerberos authentication will now be configured.
fr: L'authentication par Kerberos va maintenant être configuré.

source: Special use cases
fr: Cas spéciaux d'usage

source: My WAPT server does not have access to a writeable Active Directory
fr: Mon serveur WAPT n'a pas accès à un Active Directory en écriture

source: connect to your Active Directory (Not a RODC);
fr: connectez-vous à votre Active Directory (Pas un RODC);

source: create a computer account *srvwapt*;
fr: créez un compte machine *srvwapt*;

source: add a :abbr:`SPN (Service Principal Name)` on the *srvwapt$* account;
fr: ajoutez un champ :abbr:`SPN (Service Principal Name)` sur le compte *srvwapt$*;

source: create a keytab for this WAPT server:
fr: créez un keytab pour le serveur WAPT:

source: transfer this file to :file:`/etc/nginx/` (with :program:`winscp` for example);
fr: transférez ce fichier vers :file:`/etc/nginx/` (avec :program:`winscp` par exemple);

source: WAPT agent only have access to a RODC domain controller
fr: L'agent WAPT a uniquement un accès vers un contrôleur de domaine RODC

source: for :abbr:`RODC (Read-Only Domain Controller)`, add the *srvwapt* account to the allowed password group for replication;
fr: pour un :abbr:`RODC (Read-Only Domain Controller)`, ajoutez le compte *srvwapt*" au groupe autorisé à répliquer les mots de passe;

source: remember to preload the password of the WAPT server with the different RODC servers;
fr: n'oubliez pas de pré-charger le mot de passe du serveur WAPT avec les différents serveurs RODC;

source: You have multiple Active Directory domains with or without relationship
fr: Vous avez de multiples domaines Active Directory avec ou sans relations

source: If you have multiple Active Directory domains, you must create one :file:`keytab` per domain by following the procedure above, ex:
fr: Si vous avez des domaines Active Directory multiples, vous devez créer un :file:`keytab` par domaine en suivant la procédure ci-dessus, ex :

source: You will then have to merge all these :file:`keytabs` into a unique :file:`keytab`:
fr: Vous allez alors fusionner tous ces :file:`keytabs` en un unique :file:`keytab`:
