Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-update/migration13-16/migration-1.6-debian.po
Languages: fr

source: Upgrading WAPT from 1.3 to 1.6 on Debian
fr: Mettre à jour WAPT de 1.3 vers 1.6 avec Debian

source: WAPT, 1.3, 1.6, Debian, upgrade, upgrading, documentation
fr: WAPT, 1.3, 1.6, Debian, mise à jour, upgrade, documentation

source: Preamble
fr: Prélude

source: We make the assumption that your WAPT Server is installed on a basic minimal install of Debian9 (x64). If this is not the case, you may follow the documentation to :ref:`upgrade your base server <upgrade_host_server>`.
fr: Nous supposons que votre serveur WAPT est installé sur un système Debian 8 minimum (x64). Si ce n'est pas le cas, vous pouvez suivre la documentation de :ref:`mise à jour <upgrade_host_server>`.

source: This procedure aims to explain the migration of WAPT 1.3 to 1.6, only.
fr: Cette procédure vise exclusivement la migration de WAPT 1.3 vers WAPT 1.6.

source: Element
fr: Elément

source: Database
fr: Base de données

source: Web server
fr: Serveur Web

source: WAPT agent
fr: Agent WAPT

source: agent listening on agent port 8088
fr: l'agent écoute en local sur le port 8088

source: agent initiating and maintaining a websocket with the server.
fr: l'agent initie et maintient une *websocket* avec le serveur.

source: sha1 hashes
fr: Hashes sha1

source: a *Code Signing* certificate is required, :file:`control` file attributes are signed with sha256 hashes.
fr: un certificat *Code Signing* est désormais requis ; les attributs du fichier :file:`control` sont signés en sha256.

source: These changes require to follow scrupulously several operations for a smooth upgrade.
fr: Toutes ces différences induisent les manipulations décrites ci-après à scrupuleusement effectuer dans l'ordre.

source: Install systemd and ca-certificates
fr: Installer systemd et ca-certificates

source: install systemd
fr: lancer l'installation de systemd :

source: install ca-certificates:
fr: installer ca-certificates :

source: restart the WAPT service:
fr: redémarrer le serveur WAPT :

source: Uninstalling WAPT 1.3 from the Debian server
fr: Désinstaller WAPT 1.3 du serveur Debian

source: Setting up the GNU/ Linux Debian server
fr: Configurer le serveur Debian

source: Installing WAPT 1.6 on the Debian server
fr: Installer la nouvelle version sur le serveur Debian

source: The installation may ask you for the Kerberos realm. You may ignore it by pressing :guilabel:`Enter` to go on to the next step.
fr: L'installation peut vous demander le royaume Kerberos. Vous pouvez ignorer, appuyer sur :kbd:`Entrer` pour passer l'étape.

source: Launching the post-configuration script
fr: Lancer le script de post-configuration

source: we advise that you launch the post-configuration steps after each server upgrade so that the server uses the latest configuration format;
fr: il est recommandé de lancer la post-configuration après chaque mise à jour pour que le serveur utilise le format de configuration le plus sûr ;

source: it is not required to reset a password for the WAPT console during the post-configuration step;
fr: il n'est pas obligatoire de redéfinir un mot de passe pour la console WAPT lors de la post-configuration ;

source: The post-configuration step will offer you to change the password or to move to the next step, you may choose to change the password if desired.
fr: Le postconf va vous proposer de changer le mot de passe ou de poursuivre, vous pouvez change le mot de passe si vous le souhaitez.

source: The post-configuration step will then detect that the current version is 1.3 and it will try to launch the process of migrating the MongoDB database to PostgreSQL.
fr: Le postconf va ensuite détecter que vous venez d'une version 1.3 et va tenter de lancer une migration de la base de donnée MongoDB vers PostgreSQL. Acceptez cette migration.

source: The post-configuration step will next offer you to configure the :program:`Nginx` web server. Validate this step.
fr: Le postconf va ensuite vous proposer de configurer :program:`Nginx`, vous pouvez accepter.

source: Starting up WAPT on the Debian server
fr: Démarrer le serveur WAPT sur le serveur Debian

source: Cleaning up the Debian server
fr: Nettoyer le serveur Debian

source: At the end of the migration process, it is necessary to clean the WAPT Server.
fr: A l'issue de l'installation, il faut absolument nettoyer le serveur WAPT.

source: WAPT will use from now on :program:`Nginx` as its web server and :program:`PostgreSQL` as its database server.
fr: En effet, WAPT utilise désormais :program:`Nginx` pour son serveur Web et :program:`PostgreSQL` pour la base de donnée d'inventaire.

source: Installing the new WAPT console
fr: Installer la nouvelle console WAPT

source: download :program:`waptsetup`: https://srvwapt.mydomain.lan/wapt/waptsetup-tis.exe;
fr: télécharger :program:`waptsetup` : https://srvwapt.mydomain.lan/wapt/waptsetup-tis.exe ;

source: start the installation; the configuration of the WAPT repository and server URLs has not changed;
fr: lancer l'installation ; la configuration des url du repo et du serveur n'a pas changé ;

source: open the :program:`waptconsole` by selecting :file:`C:\\Program Files (x86)\\wapt\\waptconsole.exe` (default location) or :file:`C:\\wapt\\waptconsole.exe` (older WAPT versions);
fr: C:\\Program Files (x86)\\wapt\\

source: check that the WAPT Server works correctly by clicking on the :guilabel:`wrench icons` and the button :guilabel:`Verify`!
fr: vérifier que le serveur WAPT fonctionne correctement en cliquant sur les petites :guilabel:`clé à molette` et en cliquant sur le bouton :guilabel:`Vérifier` ;

source: You may now go to the next step to :ref:`generate the necessary keys <key-regenerate>`.
fr: Vous pouvez maintenant passer à la suite pour :ref:`générer les clés de signature <key-regenerate>` !!
