Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-replication/wapt-replicate-to-multiple-repositories/syncthing_usage.po
Languages: fr

source: (Deprecated) Introducing Syncthing
fr: Présentation de Syncthing (déprécié)

source: You can find the new documentation here: :ref:`replication_usage`.
fr: Vous pouvez trouver la nouvelle documentation ici : :ref:`replication_usage`.

source: Syncthing is a multi-OS open source peer to peer synchronization utility.
fr: Syncthing est un logiciel open-source multiplateforme de synchronisation de fichiers pair à pair.

source: It allows to synchronize folders on several machines while guaranteeing the security, the authenticity and the integrity of the files.
fr: Il permet de synchroniser des répertoires sur plusieurs machines en garantissant la sécurité et l'intégrité des fichiers.

source: The official Syncthing documentation is available `online <https://docs.syncthing.net/>`_.
fr: La documentation officielle de Syncthing est `disponible en ligne <https://docs.syncthing.net/>_`.

source: Implementing the replication
fr: Mettre en place de la réplication

source: The following documentation is applicable to Linux Debian and CentOS/ RedHat based WAPT Servers and remote repositories.
fr: La documentation suivante concerne des dépôts et serveurs WAPT basés sur Linux Debian ou CentOS / RedHat.

source: Setting up the remote WAPT repository
fr: Installer le dépôt WAPT distant

source: Debian Linux
fr: Linux Debian

source: CentOS/ RedHat Linux
fr: Linux CentOS / RedHat

source: The remote WAPT repository is set up, we now must implement the Syncthing replication.
fr: Le dépôt WAPT distant est installé, on doit mettre en place la réplication Syncthing.

source: Configuring the Syncthing service
fr: Configurer le service web Apache

source: modify the :program:`Apache` configuration files to define the correct roots of the *VirtualHosts*:
fr: modifier ensuite les fichiers de configuration Apache afin d'indiquer les racines correcte aux *VirtualHosts* :

source: change the value of *DocumentRoot* in each configuration file:
fr: modifier la valeur de *DocumentRoot* dans chaque fichier de configuration :

source: finally, restart the :program:`Apache` web service to apply the new configuration:
fr: redémarrer :program:`Apache` afin de prendre en compte la configuration :

source: It is advisable to specify valid SSL certificates in the Apache configuration of remote repositories.
fr: Il est préférable d'indiquer dans la configuration Apache des certificats SSL valides pour les dépôts distants.

source: empty the content of the folders :file:`/var/www/wapt` and :file:`/var/www/wapt-host`; Syncthing will fill again these folders with data from the main repository.
fr: vider le contenu des dossiers :file:`/var/www/wapt` et :file:`/var/www/wapt-host`, Syncthing ira peupler ces dossiers avec les données du dépôt principal :

source: Installing Syncthing on main and remote WAPT repositories
fr: Installer Syncthing sur les dépôts

source: This procedure is to be applied on the main repository and on the remote repositories.
fr: Cette procédure est à appliquer sur le dépôt principal et sur les dépôts secondaires.

source: Configuring Syncthing
fr: Configurer Syncthing

source: Operations to follow:
fr: Opérations à effectuer :

source: add the Syncthing service to :program:`systemd`;
fr: ajout du service dans :program:`systemd` ;

source: change the listening port to **0.0.0.0**;
fr: modifier le port d'écoute du service sur **0.0.0.0** ;

source: create an administrator account and enter a strong password;
fr: création d'un compte utilisateur administrateur et définition d'un mot de passe fort ;

source: activate the HTTPS protocole for the web access;
fr: activation du protocole https pour l'accès Web ;

source: create the definition file for the :program:`waptsync` service by editing :file:`/etc/systemd/system/waptsync.service`:
fr: créer le fichier de définition du service :program:`waptsync` en éditant :file:`/etc/systemd/system/waptsync.service` :

source: create the tree structure required for the :program:`waptsync` service to start:
fr: créer l'arborescence nécessaire au lancement du service :

source: change the owner of the files:
fr: changer le propriétaire de cette arborescence de fichiers :

source: activate the :program:`waptsync` service and start it. The configuration files will appear in the :file:`/opt/wapt/.config/syncthing/` folder:
fr: activer le service puis le lancer, les fichiers de configuration vont apparaître dans le dossier :file:`/opt/wapt/.config/syncthing/` :

source: change the listening port in the :file:`/opt/wapt/.config/syncthing/config.xml` file:
fr: modifier le port d'écoute dans le fichier :file:`/opt/wapt/.config/syncthing/config.xml` :

source: start the :program:`waptsync` service:
fr: démarrer le service :

source: Configuring Syncthing's web service
fr: Configurer le service Web de Syncthing

source: Syncthing's web interface is now accessible by visiting http://srvwapt.mydomain.lan:8384.
fr: L'interface Web Syncthing est maintenant accessible à l'adresse :file:`http://srvwapt.mydomain.lan:8384`.

source: change the host name of the remote repository;
fr: modifier le nom de l'appareil ;

source: add a *GUI authorized user*;
fr: ajouter un *Utilisateur autorisé GUI* ;

source: add the password for the *GUI authorized user*;
fr: ajouter un mot de passe d'authentification pour l'*Utilisateur autorisé GUI* ;

source: check the box :guilabel:`Use HTTPS for the GUI`;
fr: cocher "utiliser l'HTTPS pour le GUI" ;

source: click on :guilabel:`Save`;
fr: cliquer sur :guilabel:`Enregister` ;

source: connect with SSH on the WAPT Server and restart the Syncthing service:
fr: en ssh sur le serveur, redémarrer le service Syncthing :

source: Syncthing's web interface is now only accessible with HTTPS on https://srvwapt.mydomain.lan:8384.
fr: L'interface Web Syncthing est maintenant uniquement accessible en https à l'adresse : https://srvwapt.mydomain.lan:8384.

source: in the list of shared folders, remove the default folder: :menuselection:`Modify --> Remove`;
fr: dans la liste des partages, supprimer le répertoire par défaut : :menuselection:`Modifier --> Enlever` ;

source: configure the replication:
fr: configurer la réplication :

source: Those actions must be run on WAPT Server.
fr: Ces actions sont à effectuer sur le serveur WAPT.

source: In the list of shared folders (:guilabel:`Shares`):
fr: Dans la liste des dossiers partagés (:guilabel:`Partages`) :

source: add a shared folder with :menuselection:`Add a Share`;
fr: ajouter un répertoire partagé avec :menuselection:`Ajouter un appareil` ;

source: fill in the path to the directory to be shared, ex: :file:`/var/www/wapt/`;
fr: renseigner le chemin du dossier à partager, ex : :file:`/var/www/wapt/` ;

source: in the scroll-down menu :menuselection:`Directory Type --> Only Send`;
fr: dans le menu déroulant :menuselection:`Type de partage --> Envoyer seulement` ;

source: in the scroll-down menu :menuselection:`File Recovery Order --> Older First`;
fr: dans le menu déroulant :menuselection:`Ordre de récupération des fichiers --> Les plus anciens en premier` ;

source: redo the same operation for wapt-host: :file:`/var/www/wapt-host/`;
fr: recommencer l'opération pour wapt-host: :file:`/var/www/wapt-host/` ;

source: add the remote repository to WAPT Server's Syncthing:
fr: ajouter la machine distante :

source: Once Syncthing has been installed on the main and remote repositories, recover the remote repository's ID (:menuselection:`Actions --> Show My ID`).
fr: Une fois Syncthing installé sur les deux appareils, récupérer l'ID de l'appareil distant (:menuselection:`Actions --> afficher mon ID`).

source: This unique identifier appears like
fr: Cet identifiant unique est de la forme

source: On the main repository, in the list of remote devices (:guilabel:`Other Devices`):
fr: Sur le serveur maître, dans la liste des appareils (:guilabel:`Autres appareils`) :

source: add the remote repository with :menuselection:`Add a Device`;
fr: :menuselection:`Ajouter un appareil` ;

source: fill in the ID of the remote repository;
fr: renseigner l'ID du dépôt distant ;

source: tick the checkbox for the shared folder :guilabel:`wapt` and :guilabel:`wapt-host`;
fr: cocher les partages :guilabel:`wapt` et :guilabel:`wapt-host` ;

source: On the remote repository, follow these steps:
fr: Sur le dépôt distant effectuer les actions suivantes :

source: the remote device receives a Syncthing notification that it has been approved and added to the main device's replication schedule;
fr: l'appareil distant reçoit une notification d'approbation d'ajout par l'appareil maître ;

source: the client receives a popup form asking to accept the synchronized shares :file:`wapt` and :file:`wapt-host`;
fr: le client reçoit ensuite une popup pour accepter les partage :file:`wapt` et :file:`wapt-host` ;

source: The replication is now operational.
fr: La réplication est maintenant mise en place.

source: secure the replication:
fr: sécuriser la réplication :

source: By default, the following parameters are active in Syncthing:
fr: Par défaut, les paramètres suivant sont activés pour Syncthing :

source: Activate the :term:`NAT`
fr: Activer la translation d'adresses (:term:`NAT`)

source: Use a UPnP port mapping for incoming synchronization connections.
fr: Utiliser un mappage de port UPnP pour les connexions de synchronisation entrantes.

source: Local discovery
fr: Découverte locale

source: Syncthing will then broadcast to announce itself to other Syncthings.
fr: Syncthing fonctionnera alors avec un system de broadcast pour s'annoncer auprès des autres Syncthing.

source: Global discovery
fr: Découverte globale

source: Syncthing registers on an external cloud service and can use this cloud based service to search other Syncthing devices.
fr: Syncthing s'inscrit sur un serveur **mondial**, et peut utiliser celui-ci pour rechercher d'autres périphériques.

source: Possible relay
fr: Relais possible

source: The use of relays allows to use external servers to relay the communications. The relay is activated by default but it will be used only if two devices can not communicate directly between themselves.
fr: L'utilisation de relais permet d'utiliser des serveurs externes pour relayer la communication. Le relais est activé par défaut mais ne sera utilisé que si deux périphériques ne peuvent pas communiquer directement entre eux.

source: This operating mode simplifies the global setup but it is not the most advisable method in relation to security.
fr: Ce mode de fonctionnement permet une mise en place facilitée mais ce n'est pas le mode de fonctionnement le plus conseillé pour la sécurité.

source: uncheck all boxes in network configuration;
fr: décocher toutes les cases dans la configuration réseau ;

source: define the listening port (by default port 22000);
fr: définir le port d'écoute du protocole (par défaut 22000) ;

source: replace *default* by *tcp://0.0.0.0:22000*;
fr: remplacer *default par *tcp://0.0.0.0:22000* ;

source: Then go on the web interface of the remote repositories, click on :guilabel:`Change` and fill in the IP address of the remote repository:
fr: Se rendre ensuite sur l'interface de dépôts distants, cliquer sur :guilabel:`Modifier`, puis définir l'adresse de la machine distante :

source: replace *dynamic* by *tcp://<remote_repo_ip_address>:22000*;
fr: remplacer *dynamic* par *tcp://ip-du-syncthing-distant:22000*

source: This configuration is useful for limiting inbound connections to the Syncthing service.
fr: Cette configuration permet de limiter les connexions externes du service Synthing.

source: Configuring the WAPT agents
fr: Configurer les agents WAPT

source: WAPT clients on remote sites must now be configured to look for updates from their closest available repositories.
fr: Les clients des sites distants doivent maintenant être configurés pour pointer vers leurs dépôts les plus proches.

source: Two solutions exist:
fr: Deux solutions existent :

source: use automatic detection via :term:`DNS` :term:`SRV` fields;
fr: utiliser la détection automatique via les champs :term:`SRV` :term:`DNS` ;

source: change manually or via a WAPT package the parameter *repo_url* in the WAPT agent's :file:`wapt-get.ini` file;
fr: modifier le champs *repo_url* dans le :file:`wapt-get.ini` des agents WAPT manuellement ou à l'aide d'un paquet WAPT de configuration ;

source: Configuration example of the WAPT agent - filled in local repository:
fr: Exemple de configuration de l'agent WAPT - dépôt local renseigné :

source: Example of a WAPT package designed to remotely change the *repo_url* in :file:`wapt-get.ini`:
fr: Exemple de paquet pour modifier le champ *repo_url* de :file:`wapt-get.ini` :
