Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/package-exe-evo/index.po
Languages: fr

source: exe, WAPT, advanced, complex, installing, installation, documentation
fr: exe, WAPT, evolués, complexes, documentation

source: Advanced \*.exe package
fr: Créer un paquet \*.exe evolué

source: Improving the functionalities of packages
fr: Améliorer l'installation

source: Our package Mozilla Firefox ESR is functional but it requires some improvements.
fr: Notre paquet Mozilla Firefox ESR est fonctionnel mais il n'est pas encore optimal.

source: the package installs the software even if the software is already installed, it will overwrite older versions;
fr: le paquet exécute l'installation du logiciel même si le logiciel est déjà installé, il l'écrase dans tous les cas ;

source: the package does not check whether the software version is already installed;
fr: le paquet ne vérifie pas la version du logiciel s'il est déjà installé ;

source: As with MSI installers, those problems are addressed using the function :command:`install_exe_if_needed`.
fr: Comme avec les MSI, nous résolvons ces problèmes en utilisant la fonction ``install_exe_if_needed``.

source: Using *install_exe_if_needed*
fr: Utiliser *install_exe_if_needed*

source: The function is slightly the same as that used with MSI installers, with some differences:
fr: La fonction est sensiblement la même que celle utilisée pour les installeurs MSI, avec quelques différences :

source: the function requires to pass the silent flag as an argument;
fr: la fonction nécessite l'ajout des flags silencieux en paramètre ;

source: the function requires to pass the *uninstall key* as an argument;
fr: la fonction nécessite l'ajout de la clé de désinstallation en paramètre ;

source: We make changes to the Mozilla Firefox ESR setup accordingly.
fr: On modifie notre exemple Mozilla Firefox ESR en conséquence :

source: List of arguments available with *install_exe_if_needed*
fr: Liste des arguments disponibles avec *install_exe_if_need*.

source: Settings
fr: Paramètres

source: Default value
fr: Valeur par défaut

source: name of the :mimetype:`.exe` file to execute.
fr: nom du fichier :mimetype:`.exe` à exécuter.

source: silent parameters to pass as arguments to the installer.
fr: paramètres silencieux à passer en argument à l'installeur.

source: software *uninstall key*.
fr: clé de désinstallation du programme.

source: minimal version above which the software will update.
fr: version minimale au dessus de laquelle il mettra à jour.

source: list of programs to kill before installing the package.
fr: liste des programmes à tuer avant de lancer l'installation.

source: accepted codes other than 0 and 3010 returned by the function.
fr: codes de retour autres que 0 ou 3010 acceptés en retour par la fonction.

source: maximum installation wait time (in seconds).
fr: durée d'attente maximale d'installation (en secondes).

source: value passed as parameter to control the version number instead of the value returned by the :command:`installed_softwares` function.
fr: valeur passée en paramètre pour le contrôle de version au lieu de celle retournée par la fonction :command:`installed_softwares`.

source: automatically removes an older version of a software whose uninstallkey is identical
fr: Permet d'enclencher automatiquement la suppression d'une uninstallkey identique avec une version précédente à celle mentionnée

source: forces the installation of the software even though the same uninstallkey has been found
fr: Permet de forcer l'installation même si une uninstallkey avec une version identique est trouvée.

source: As a consequence, the package will have a different behavior:
fr: En conséquence, le paquet aura un comportement différent :

source: Firefox will install only if it is not yet installed or if the installed version of Firefox is less than 45.5.0, unless the ``--force`` option is passed as argument when installing the package;
fr: le logiciel Firefox s'installera uniquement si le logiciel n'est pas installé et si la version est strictement inférieure à 45.5.0, sauf si l'option ``--force`` est indiquée lors de l'installation du paquet ;

source: on installing, the running :program:`firefox.exe` processes will be killed;
fr: à l'installation, les processus :program:`firefox.exe` en cours d'exécution seront terminés ;

source: the function will add by itself the *uninstall key*, so leave the *uninstall key* argument empty;
fr: la fonction ajoutera elle-même la clé de désinstallation, donc laisser *uninstallkey* vide ;

source: when finishing the installation of the package, the function will check that the *uninstall key* is present on the machine and that the version of Firefox is greater than 45.5.0; if this not the case, the package will be flagged as **ERROR**;
fr: à la fin de l'installation, la fonction ira vérifier si l'*uninstallkey* est bien présente sur le poste et si la version est bien égale ou supérieure à 45.5.0, si ce n'est pas le cas, elle basculera le paquet en **ERROR** ;

source: Managing the de-installation of applications
fr: Gérer la désinstallation

source: Special case of a non-silent uninstaller
fr: Cas particulier d'un dé-installeur non-silencieux

source: In that particular case, a package using :command:`install_exe_if_needed` fills in the *uninstall key*, but the *uninstall key* points to a non silent uninstaller.
fr: Dans ce cas particulier, un paquet utilisant :command:`install_exe_if_needed` renseigne la clé de désinstallation, mais cette clé de désinstallation pointe vers un dé-installeur non-silencieux.

source: We have to circumvent that problem by using a function that will remove the *uninstall key* at the end of the installation.
fr: Il nous faut contourner le problème en utilisant une fonction qui va supprimer la clé de désinstallation à la fin de l'installation.
