Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-configuration/wapt-deploy/waptagent-linux.po
Languages: fr

source: Deploying the WAPT Agent on Linux
fr: Déployer l'agent WAPT sur Linux

source: waptagent, linux, deployment, deploy, deploying, documentation, WAPT
fr: waptagent, linux, déploiement, déployer, documentation, WAPT

source: Starting with WAPT 1.8, a Linux agent is available for |linux_debian| / |linux_ubuntu| and |linux_redhat|.
fr: À partir de WAPT 1.8, un agent Linux est disponible pour |linux_debian| / |linux_ubuntu| and |linux_redhat|.

source: the following procedure installs a WAPT agent using Tranquil IT's repositories for Debian/CentOS;
fr: la procédure suivante installe l'agent WAPT en utilisant les dépôts Tranquil IT pour Debian / CentOS ;

source: if you wish to install it manually, you can look for your `corresponding version <https://wapt.tranquil.it/wapt/releases/>`_;
fr: si vous souhaitez l'installer manuellement, vous pouvez rechercher votre `version correspondante <https://wapt.tranquil.it/wapt/releases/>`_ ;

source: copy the link of the binary that you need, download and install it with dpkg / rpm;
fr: copier le lien du binaire dont vous avez besoin, le télécharger et l'installer avec dpkg / rpm ;

source: Installing the WAPT agent on Debian
fr: Installer l'agent WAPT sur Debian

source: The most secure and reliable way to install the latest WAPT agent on Linux Debian is using Tranquil IT's public repository.
fr: La façon la plus sûre et la plus fiable d'installer le dernier agent WAPT sur Linux Debian est d'utiliser le dépôt public Tranquil IT.

source: add Tranquil IT's repository in apt repository lists:
fr: ajouter le dépôt Tranquil IT dans les listes apt :

source: **Follow this procedure for getting the right packages for the WAPT Enterprise** Edition. For WAPT Community Edition please refer to the next block.
fr: **Suivez cette procédure pour obtenir les bons paquets pour l'édition WAPT Enterprise**. Pour l'édition Community de WAPT, veuillez vous référer au bloc suivant.

source: To access WAPT Enterprise ressources, you must use the username and password provided by our sales department.
fr: Pour accéder au site de téléchargement WAPT Enterprise, vous devez utiliser le nom d'utilisateur et le mot de passe fournis par notre service commercial.

source: Replace **user** and **password** in the **deb** parameter to access WAPT Enterprise repository.
fr: Remplacez **user** et **password** dans le paramètre **deb** pour accéder au dépôt WAPT Enterprise.

source: **Follow this procedure for getting the right packages for the WAPT Community** Edition. For WAPT Enterprise Edition please refer to the previous block.
fr: **Suivez cette procédure pour obtenir les bons paquets pour l'édition Community de WAPT**. Pour l'édition WAPT Enterprise, veuillez vous référer au bloc précédent.

source: install WAPT agent using apt-get:
fr: installer l'agent WAPT en utilisant apt :

source: Installing the WAPT agent on CentOS
fr: Installer l'agent WAPT sur CentOS

source: The most secure and reliable way to install the latest WAPT agent on Linux CentOS is using Tranquil IT's public repository.
fr: La façon la plus sûre et la plus fiable d'installer le dernier agent WAPT sur Linux CentOS est d'utiliser le dépôt public Tranquil IT.

source: add Tranquil IT's repository in yum repository lists:
fr: ajouter le dépôt Tranquil IT dans les listes yum :

source: Replace **user** and **password** in the **baseurl** parameter to access WAPT Enterprise repository.
fr: Remplacez **user** et **password** dans le paramètre **baseurl** pour accéder au dépôt WAPT Enterprise.

source: install WAPT agent using yum:
fr: installer l'agent WAPT en utilisant yum :

source: Creating the agent configuration file
fr: Créer le fichier de configuration de l'agent

source: The requisites for your WAPT agent to work are:
fr: Les conditions requises pour que votre agent WAPT puisse travailler sont les suivantes :

source: ``wapt-get.ini`` config file in :file:`/opt/wapt/`;
fr: le fichier de configuration ``wapt-get.ini`` se trouve dans le fichier :file:`/opt/wapt/` ;

source: a public certificate of the package-signing authority in :file:`/opt/wapt/ssl/`;
fr: un certificat public de l'autorité de signature des paquets dans :file:`/opt/wapt/ssl/` ;

source: You need to create and configure the :file:`wapt-get.ini` file in :file:`/opt/wapt` (:ref:`wapt-get-ini`).
fr: Vous devez créer et configurer le fichier :file:`wapt-get.ini` dans :file:`/opt/wapt` (:ref:`wapt-get-ini`).

source: An example of what it should look like is present further down on this page. You may use it after changing the parameters to suit your needs.
fr: Un exemple de ce à quoi il devrait ressembler est présenté plus bas sur cette page. Vous pouvez l'utiliser après avoir modifié les paramètres en fonction de vos besoins.

source: Copying the package-signing certificate
fr: Copier le certificat Code-Signing

source: You need to copy manually, or by script, the public certificate of your package signing certificate authority.
fr: Vous devez copier manuellement, ou par script, le certificat public de votre autorité de certification de signature de paquets.

source: The certificate should be located on your Windows machine in :file:`C:\\Program Files (x86)\\wapt\\ssl\\`.
fr: Le certificat devrait être situé sur votre machine Windows dans :file:`C:\\Program Files (x86)\\wapt\\ssl\\`.

source: Copy your certificate(s) in :file:`/opt/wapt/ssl` using :program:`WinSCP` or :program:`rsync`.
fr: Copier les certificat(s) dans :file:`/opt/wapt/ssl` en utilisant :program:`WinSCP` ou :program:`rsync`.

source: Copying the SSL/TLS certificate
fr: Copier le certificat SSL/TLS

source: If you already have configured your WAPT server to use correct :ref:`Nginx SSL/TLS certificates <activating_HTTPS_certificate_verification>`, you must copy the certificate in your WAPT Linux agent.
fr: Si vous avez déjà configuré votre serveur WAPT pour utiliser les bons certificats :ref:`Nginx SSL/TLS <activating_HTTPS_certificate_verification>`, vous devez copier le certificat dans votre agent WAPT Linux.

source: The certificate should be located on your Windows machine in :file:`C:\\Program Files (x86)\\wapt\\ssl\\server\\`.
fr: Le certificat devrait être situé sur votre machine Windows dans :file:`C:\\Program Files (x86)\\wapt\\ssl\\server\\`.

source: Copy your certificate(s) in :file:`/opt/wapt/ssl/server/` using :program:`WinSCP` or :program:`rsync`.
fr: Copier le(s) certificat(s) dans :file:`/opt/wapt/ssl/server/` en utilisant :program:`WinSCP` ou :program:`rsync`.

source: Then, modify in your config file the path to your certificate.
fr: Ensuite, modifier le ficher de configuration en donnant le chemin de votre certificat.

source: And give absolute path of your cert.
fr: Et donner le chemin absolu de votre certificat.

source: If you are not using SSL/TLS certificates with your WAPT Server, you must change it in :file:`/opt/wapt/wapt-get.ini` the following lines to 0:
fr: Si vous n'utilisez pas de certificat SSL/TLS avec votre serveur WAPT, vous devez changer dans :file:`/opt/wapt/wapt-get.ini` les lignes suivantes à *0* :

source: Registering your Linux agent
fr: Enregistrer votre agent Linux avec le serveur WAPT

source: beware, by default, WAPT takes the system language by default for packages, you may have to define the language in :file:`wapt-get.ini` with ``locales=``.
fr: attention, par défaut, WAPT prend la langue du système par défaut pour les paquets, vous devrez peut-être définir la langue dans :file:`wapt-get.ini` avec ``locales=``.

source: restart the WAPT service:
fr: redémarrer le serveur WAPT :

source: finally, execute the following command to register your Linux host with the WAPT server:
fr: enfin, exécuter la commande suivante pour enregistrer votre hôte Linux auprès du serveur WAPT :

source: |clap| **Congratulations**, your Linux Agent is now installed and configured and it will now appear in your WAPT Console with a |pinguin| icon!!
fr: |clap| **Félicitations**,votre agent Linux est maintenant installé et configuré et il apparaîtra dans votre console WAPT avec une icône |pinguin| !!

source: Supported features
fr: Fonctionnalités supportées

source: Most features are now supported in version 1.8.2 of WAPT.
fr: La plupart des fonctionnalités sont désormais prises en charge dans la version 1.8.2 de WAPT.

source: Unsupported features
fr: Fonctionnalités non supportées

source: installing updates on shutdown |work_in_progress|;
fr: installer les mises à jour à l'extinction de la machine |travail_en_progression| ;

source: WAPT console is not currently available on linux |work_in_progress|;
fr: La console WAPT n'est actuellement pas disponible sur Linux |work_in_progress| ;

source: any Windows specific feature;
fr: toute fonctionnalité spécifique à Windows ;

source: Particularities with domain functionality
fr: Particularités du fonctionnement en domaine

source: testing was carried out with sssd with an Active Directory domain and kerberos authentication;
fr: les tests ont été effectués avec sssd avec un domaine Active Directory et une authentification kerberos ;

source: to integrate a machine in the Active Directory domain, you can choose to follow `this documentation <https://dev.tranquil.it/samba/en/samba_config_client/client_join_clients_linux.html>`_
fr: pour intégrer une machine dans le domaine Active Directory, vous pouvez choisir de suivre `cette documentation <https://dev.tranquil.it/samba/en/samba_config_client/client_join_clients_linux.html>`_

source: to force the update of Organisational Units on the host, you can apply a :command:`gpupdate` from the WAPT console;
fr: pour forcer la mise à jour des Unités Organisationnelles sur la machine, vous pouvez appliquer une commande :command:`gpupdate` depuis la console WAPT ;

source: in order for Active Directory groups to function properly, you must verify that the :command:`id hostname$` command returns the list of groups the host is member of;
fr: pour que les groupes Active Directory fonctionnent correctement, vous devez vérifier que la commande :command:`id hostname$` renvoie la liste des groupes dont la machine est membre ;

source: We have noticed that the Kerberos LDAP query does not work if the reverse DNS record is not configured correctly for your domain controllers. These records must therefore be created if they do not exist.
fr: Nous avons remarqué que la requête LDAP Kerberos ne fonctionne pas si l'enregistrement DNS inverse n'est pas configuré correctement pour vos contrôleurs de domaine. Ces enregistrements doivent donc être créés s'ils n'existent pas.
