Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-configuration/wapt-deploy/waptagent-ansible.po
Languages: fr

source: Deploying the Linux WAPT Agent with Ansible
fr: Déployer l'agent WAPT Linux avec Ansible

source: waptagent, linux, deployment, deploy, Ansible, documentation, WAPT
fr: waptagent, linux, deploiement, deployer, Ansible, documentation, WAPT

source: To avoid mistakes and automate your WAPT agents deployment on Linux, we provide Ansible roles for installing WAPT agents on:
fr: Pour éviter les erreurs et automatiser le déploiement de vos agents WAPT sous Linux, nous vous proposons des rôles Ansible pour installer des agents WAPT sur :

source: You can explore the role source code `by visiting this link on Github <https://github.com/tranquilit/ansible.waptagent>`_.
fr: Vous pouvez explorer le code source du rôle `en visitant ce lien sur Github <https://github.com/tranquilit/ansible.waptagent>`_.

source: Requirements
fr: Pré-requis

source: Debian Linux or CentOS hosts;
fr: Postes Debian Linux ou CentOS;

source: a sudoers user on these hosts;
fr: un compte utilisateur sudoers sur ces postes;

source: Installing the Ansible role
fr: Installer le rôle Ansible

source: install ``tranquilit.waptagent`` Ansible role;
fr: installer le rôle Ansible ``tranquilit.waptagent`` ;

source: to install the role elsewhere, use the *-p* subcommand like this;
fr: pour installer le rôle autre part, utiliser la commande *-p* comme ceci;

source: Using the Ansible role
fr: Utiliser le rôle Ansible

source: ensure you have a working ssh key deployed on your hosts, if not you can generate and copy one like below;
fr: assurez vous d'avoir une clé ssh déployée sur vos postes, sinon vous pouvez en générer une et la copier comme ci dessous;

source: edit Ansible hosts inventory ( :file:`./hosts` ) and add the Linux hosts;
fr: éditer le fichier d'inventaire Ansible ( :file:`./hosts` ) et ajouter les hôtes Linux ;

source: create a playbook with the following content in :file:`./playbooks/deploywaptagent.yml`;
fr: créer un playbook avec le contenu suivant dans :file:`./playbooks/deploywaptagent.yml` ;

source: ensure all variables are correctly set (see :ref:`install_waptagent_ansible_vars`);
fr: assurez-vous que les variables sont correctement renseignées (voir :ref:`install_waptagent_ansible_vars`) ;

source: Variables configuration is important as it will configure the behavior of the WAPT.
fr: La configuration des variables est importante car elles configurent le comportement de l'agent WAPT.

source: You **must** replace the default certificate with your Code-Signing public certificate.
fr: Vous **devez** remplacer le certificat par défaut avec votre certificat public de signature de vos paquets WAPT.

source: run your playbook with the following command;
fr: lancez votre playbook avec la commande suivante ;

source: **Congratulations, you have installed your WAPT agent on your Linux hosts!**
fr: **Félicitations, vous avez installé votre agent WAPT sur vos hôtes Linux!**

source: Role variables
fr: Variables du rôle

source: Available variables are listed below, along with default values (see ``defaults/main.yml``).
fr: Les variables disponibles sont listées ci-dessous, avec les valeurs par défaut (voir ``defaults/main.yml``).

source: WAPT agent variables
fr: Variables des agents WAPT

source: version of WAPT that will be installed from WAPT Deb/RPM repository;
fr: version de WAPT qui sera installée depuis les dépôts WAPT Deb/RPM ;

source: version of CentOS used for RPM repository address;
fr: version CentOS utilisée pour l'adresse du dépôt RPM ;

source: wapt-get.ini variables
fr: Variables wapt-get.ini

source: The ``wapt_server_url`` parameter points to your WAPT server and is used by default for the ``wapt_repo_url``.
fr: Le paramètre ``wapt_server_url`` pointe vers votre serveur WAPT et est utilisé par défaut pour ``wapt_repo_url``.

source: You can override it like so:
fr: Vous pouvez le surcharger comme ceci :

source: Certificate filename located in :file:`files/` subdirectory of the role:
fr: Nom du certificat situé dans le sous-dossier :file:`files/` du rôle :

source: Example Ansible playbook
fr: Exemple de playbook

source: Here is an example of an Ansible playbook.
fr: Voici un exemple de playbook Ansible.
