Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-software-best-practices.po
Languages: fr

source: Applying best practices to packaging software
fr: Appliquer les meilleures pratiques au packaging de logiciels

source: WAPT, packaging, best practice, documentation
fr: WAPT, packaging, meilleures pratiques, documentation

source: `_benwa <https://www.reddit.com/user/_benwa/>`_ is a system administrator and he has authorized Tranquil IT to republish his excellent rant on reddit `Developers, you can make sysadmins happier <https://www.reddit.com/r/sysadmin/comments/g6d5wx/developers_you_can_make_sysadmins_happier/>`_.
fr: `_benwa <https://www.reddit.com/user/_benwa/>`_ est un administrateur système et il a autorisé Tranquil IT à republier son excellente diatribe sur reddit `Developers, you can make sysadmins happier <https://www.reddit.com/r/sysadmin/comments/g6d5wx/developers_you_can_make_sysadmins_happier/>`_.

source: Environnement variables
fr: Variables d'environnement

source: Environmental variables `have been around since DOS <https://en.wikipedia.org/wiki/Environment_variable#DOS>`_. They can make your (and my) life easier.
fr: Les variables d'environnement `existent depuis le DOS <https://en.wikipedia.org/wiki/Environment_variable#DOS>`_. Elles peuvent vous faciliter la vie (et la mienne).

source: Program directories
fr: Répertoires des programmes

source: Not every system uses ``C:\`` as the main drive. Some enterprises use folder redirection, and relocate the Documents folder. Some places in the world don't speak English and their directories reflect that. **Use those environmental variables to make your programs "just work"**:
fr: Tous les systèmes n'utilisent pas "C:\" comme lecteur principal. Certaines entreprises utilisent la redirection de dossiers, et déplacent le dossier Documents. Certains endroits dans le monde ne parlent pas anglais et leurs noms de répertoires reflètent cela. **Utilisez ces variables d'environnement pour que vos programmes "fonctionnent tout simplement "** :

source: ``%SystemDrive%`` is the drive where ``%SystemRoot%`` is located. You most likely don't need to actually know this;
fr: ``%SystemDrive%`` est le lecteur où se trouve ``%SystemRoot%``. Vous n'avez probablement pas besoin de le savoir ;

source: ``%SystemRoot%`` is where the Windows directory is located. You hopefully don't care about this. Leave the Windows directory alone;
fr: Le système d'exploitation Windows est situé dans le répertoire ``%SystemRoot%``. Ne vous en souciez pas. Laissez le répertoire Windows tranquille ;

source: ``%ProgramFiles%`` is where you should place your program files, preferable in a ``Company\Program`` structure;
fr: ``%ProgramFiles%`` est l'endroit où vous devez placer vos fichiers de programme, de préférence dans une structure ``Company\Program`` ;

source: ``%ProgramFiles(x86)%`` is where you should place your 32-bit program files. Please update them for 64-bit. 32-bit will eventually be unsupported, and business will be waiting for you to get your shit together for far longer than necessary;
fr: ``%ProgramFiles(x86)%`` est l'endroit où vous devez placer vos fichiers de programme 32 bits. Veuillez les mettre à jour pour le 64 bits. Le 32-bit ne sera plus supporté dans l'avenir, et les entreprises attendront que vous vous organisiez pour bien plus longtemps que nécessaire ;

source: ``%ProgramData%`` is where you should store data that isn't user specific, but still needs to be written to by users (Users don't have write access to this folder either).
fr: ``ProgramData%`` est l'endroit où vous devez stocker les données qui ne sont pas spécifiques à l'utilisateur, mais qui doivent quand même être écrites par les utilisateurs (les utilisateurs n'ont pas non plus d'accès en écriture à ce dossier).

source: Your program shouldn't require administrator rights to run as you shouldn't have us writing to the ``%ProgramFiles%`` directory. Also, don't throw executables in here.
fr: Votre programme ne devrait pas nécessiter de droits d'administrateur pour s'exécuter, car vous ne devriez pas nous faire écrire dans le répertoire ``%ProgramFiles%``. Aussi, ne mettez pas d'exécutables dans ce répertoire.

source: ``%Temp%`` is where you can process temporary data. Place that data within a unique folder name (maybe a generated GUID perhaps) so you don't cause an incompatibility with another program. Windows will even do the cleanup for you. Don't put temporary data in in ``%ProgramData%`` or ``%ProgramFiles%``;
fr: ``%Temp%`` est l'endroit où vous pouvez traiter des données temporaires. Placez ces données dans un nom de dossier unique (peut-être un GUID généré) afin de ne pas provoquer d'incompatibilité avec un autre programme. Windows fera même le nettoyage à votre place. Ne placez pas de données temporaires dans les dossiers ``%ProgramData%`` ou ``%ProgramFiles%`` ;

source: ``%AppData%`` is where you can save the user running your program settings. This is a fantastic location that can by synced with a server and used to quickly and easily migrate a user to a new machine and keep all of their program settings. Don't put giant or ephemeral files here.
fr: ``%AppData%`` vous permet de sauvegarder les paramètres de l'utilisateur qui exécute votre programme. C'est un endroit fantastique qui peut être synchronisé avec un serveur et être utilisé pour migrer rapidement et facilement un utilisateur vers une nouvelle machine et conserver tous les paramètres de ses programmes. Ne mettez pas de fichiers géants ou éphémères ici.

source: You could be the cause of a very slow login if you put the wrong stuff here and a machine needs to sync it up. **DON'T PUT YOUR PROGRAM FILES HERE**. The business decides what software is allowed to run, not you and a bunch of users who may not know how their company's environment is set up;
fr: Vous pourriez être à l'origine d'une connexion très lente si vous mettez les mauvais éléments ici et qu'une machine doit les synchroniser. **NE METTEZ PAS VOS FICHIERS DE PROGRAMMES ICI**. C'est l'entreprise qui décide quels logiciels sont autorisés à fonctionner, ce n'est pas à vous de décider, ni aux utilisateurs qui ne savent peut-être pas comment l'environnement de leur entreprise est configuré ;

source: ``%LocalAppData%`` is where you can put bigger files that are specific to a user and computer. You don't need to sync up a thumbnail cache. They won't be transferred when a user migrates to a new machine, or logs into a new VDI station, or terminal server. **DON'T PUT YOUR PROGRAM FILES HERE EITHER**;
fr: ``LocalAppData%`` permet de placer des fichiers plus volumineux spécifiques à un utilisateur ou à un ordinateur. Par exemple, personne n'a besoin de synchroniser un cache de vignettes. Elles ne seront pas transférées lorsqu'un utilisateur migrera vers une nouvelle machine, ou se connectera à une nouvelle station VDI, ou à un nouveau serveur de terminal. **NE METTEZ PAS VOS FICHIERS DE PROGRAMME ICI NON PLUS** ;

source: You can get these directory paths through `API calls <https://docs.microsoft.com/en-us/windows/win32/shell/known-folders>`_ as well if you don't/can't use environmental variables.
fr: Vous pouvez aussi bien obtenir ces chemins de répertoires par des appels `API <https://docs.microsoft.com/en-us/windows/win32/shell/known-folders>`_ si vous n'utilisez pas ou ne pouvez pas utiliser de variables d'environnement.

source: Use the `Windows Event Log <https://docs.microsoft.com/en-us/windows/win32/eventlog/event-logging>`_ for logging. It'll handle the rotation for you and a sysadmin can forward those logs or do whatever they need to. You can even make your own little area just for your program.
fr: Utilisez le `Journal des événements Windows <https://docs.microsoft.com/en-us/windows/win32/eventlog/event-logging>`_ pour la journalisation. Il s'occupera de la rotation pour vous et un administrateur système peut transmettre ces journaux ou faire ce qu'il faut. Vous pouvez même créer votre propre petite zone juste pour votre programme.

source: Error codes
fr: Codes d'erreur

source: Use `documented Error Codes <https://docs.microsoft.com/en-us/windows/win32/debug/system-error-codes>`_ when exiting your program.
fr: Utilisez les `codes d'erreur standard <https://docs.microsoft.com/en-us/windows/win32/debug/system-error-codes>`_ lorsque vous quittez votre programme.

source: Printing
fr: Impression

source: Use the `Windows printing API <https://docs.microsoft.com/en-us/windows/win32/printdocs/printdocs-printing>`_ and do not use direct printing in your program.
fr: Utilisez l'`API d'impression Windows <https://docs.microsoft.com/en-us/windows/win32/printdocs/printdocs-printing>`_ et n'utilisez pas l'impression directe dans votre programme.

source: `Sign your installation file and executables <https://docs.microsoft.com/en-us/windows/win32/appxpkg/how-to-sign-a-package-using-signtool>`_. It's how we know it's valid and can whitelist in `AppLocker <https://docs.microsoft.com/en-us/powershell/module/applocker/?view=win10-ps>`_ or other policies.
fr: `Signez vos fichiers d'installation et vos exécutables <https://docs.microsoft.com/en-us/windows/win32/appxpkg/how-to-sign-a-package-using-signtool>`_. C'est ainsi que nous savons que votre MSI est valide et que nous pouvons le mettre sur une liste blanche dans `AppLocker <https://docs.microsoft.com/en-us/powershell/module/applocker/?view=win10-ps>`_ ou équivalent.

source: Update
fr: Mises à jour

source: Want to have your application update for you? That can be fine if the business is okay with it. You can create a scheduled task or service that runs elevated to allow for this without granting the user admin rights. I like the way Chrome Enterprise does it: gives a GPO to set update settings, the max version it will update to (say 81.* to allow all minor updates automatically and major versions are manual), and a service. They also have a GPO to prevent user-based installs;
fr: Vous souhaitez que votre programme se mette à jour ? C'est possible si l'entreprise est d'accord. Vous pouvez créer une tâche ou un service programmé qui s'exécute en mode élevé pour permettre cela sans accorder de droits d'administrateur à l'utilisateur. J'aime la façon dont Chrome Enterprise le fait : il donne une GPO pour définir les paramètres de mise à jour, la version maximale à laquelle elle va se mettre à jour (disons 81.* pour permettre toutes les mises à jour mineures automatiquement et les versions majeures sont manuelles), et un service. Ils ont également une GPO pour empêcher les installations lancées par les utilisateurs ;

source: WAPT is designed for businesses that don't allow users to run software updates, which is the policy often chosen in large security conscious enterprises.
fr: WAPT est conçu pour les entreprises qui ne permettent pas à leurs utilisateurs d'exécuter des mises à jour logicielles, c'est la politique souvent choisie par les grandes entreprises consciencieuses vis à vis de la sécurité.

source: Version numbers
fr: Numéros de version

source: Use `semantic versioning <https://semver.org/>`_ (should go in the version property in the installer file and in the Add/Remove Programs list, not in the application title) and have a `changelog <https://keepachangelog.com/>`_. You can also have your installer download at a predictable location to allow for automation. A published update path is nice too;
fr: Utilisez le `versionnage semantique <https://semver.org/>`_ (doit aller dans la propriété de version dans le fichier d'installation et dans la liste Ajout/Suppression de programmes, pas dans le titre de l'application) et ayez un `changelog <https://keepachangelog.com/>`_. Vous pouvez également mettre à disposition en téléchargement votre installateur à un endroit prévisible pour permettre l'automatisation. Un chemin de mise à jour publié est également utile ;

source: If you apply this practice, then you will make system administrators who deploy your software updates using the :ref:`WAPT function def_update() <envdev_setup>` **very happy**!!
fr: Si vous appliquez cette pratique, alors vous rendrez les administrateurs système qui déploient vos mises à jour logicielles en utilisant la fonction :ref:`WAPT def_update() <envdev_setup>` **très heureux** !

source: ADMX templates are dope;
fr: Les modèles ADMX sont des trucs très moches ;

source: We completely agree with you _benwa on this at Tranquil IT. If developers advise their customers to use GPOs to deploy their software or system or users settings, then, **they must know that GPOs are not fully reliable**.
fr: Nous sommes tout à fait d'accord avec vous _benwa sur ce point chez Tranquil IT. Si les développeurs conseillent à leurs clients d'utiliser des GPO pour déployer leur logiciel ou leur système ou les paramètres des utilisateurs, alors, **ils doivent apprendre que les GPO ne sont pas fiables**.

source: Instead, package your software, your system and user configurations using WAPT. A :file:`setup.py` is so much easier than an :mimetype:`xml` file for system admins to audit before deploying.
fr: Au lieu de cela, packagez vos logiciels, votre système et vos configurations utilisateur en utilisant WAPT. Un fichier :file:`setup.py` est beaucoup plus facile qu'un fichier :mimetype:`xml` pour les administrateurs système qui doivent le vérifier avant de le déployer.

source: WAPT packages can be applied recursively to trees of Organisational Units, so your WAPT package will behave in production exactly as a GPO would, **just much easier**.
fr: Les paquets WAPT peuvent être appliqués récursivement à des arbres d'Unités Organisationnelles, de sorte que votre paquet WAPT se comportera en production exactement comme le ferait une GPO, **juste beaucoup plus facilement**.

source: License dongles
fr: Dongles de licences

source: USB license dongles are a sin. Use a regular software or network license. I'm sure there are off the shelf ones so you don't have to reinvent the wheel;
fr: Les dongles de licence USB sont un péché. Utilisez une licence de logiciel ordinaire ou une licence activée par réseau. Je suis sûr qu'il y plein de systèmes de gestion des licences sur le marché pour que vous n'ayez pas à réinventer la roue ;

source: You can make your software accept a licence key as a parameter in your :mimetype:`msi` executable.
fr: Vous pouvez faire en sorte que votre logiciel accepte une clé de licence comme paramètre dans votre exécutable :mimetype:`msi`.

source: WAPT can be used to assign licence keys to individual workstations at install using a :ref:`method that ensures that the licence key can not be read during transport <encryting_sensitive_data_in_package>`.
fr: WAPT peut être utilisé pour attribuer des clés de licence à des postes de travail individuels lors de l'installation en utilisant une méthode :ref:`qui garantit que la clé de licence ne peut pas être lue pendant le transport <cryptage_des_données_sensibles_dans_le_paquet>`.

source: Then, if you want your software to call home to check on the validity of the licence, make the routine work with :ref:`proxies <proper_use_of_proxy_in_software>`.
fr: Ensuite, si vous voulez que votre logiciel appelle chez vous pour vérifier la validité de la licence, faites en sorte que votre méthode fonctionne avec des :ref:`serveur mandataires <proper_use_of_proxy_in_software>`.

source: Networking
fr: Fonctionnement en réseau

source: Don't use that damn custom IPv4 input field. Use FDQNs. IPv6 had been around since 1998 and will work with your software if you just give it a chance;
fr: N'utilisez pas ce fichu champ de saisie IPv4 personnalisé. Utilisez des FDQN. L'IPv6 existe depuis 1998 et fonctionnera avec votre logiciel si vous lui donnez une chance ;

source: The Windows Firewall (can't really say much about third party ones) is going to stay on. Know the difference between an incoming and outgoing rule. Most likely, your server will need incoming. Most likely, you clients won't even need an outgoing. Set those up at install time, not launch time. Use Firewall Groups so it's easy to filter. Don't use Any rules if you can help it. The goal isn't to make it work, it's to make it work securely. If you don't use version numbers in your install path, you might not even have to remake those rules after every upgrade;
fr: Le pare-feu Windows (je ne peux pas vraiment en dire plus sur les pare-feu tiers) va rester en place. Connaissez la différence entre une règle entrante et une règle sortante. Il est probable que votre serveur aura besoin d'une règle entrante. Vos clients n'auront probablement même pas besoin d'une règle sortante. Configurez-les au moment de l'installation, et non au moment du lancement. Utilisez les groupes de pare-feu pour faciliter le filtrage. N'utilisez aucune règle si vous pouvez. Le but n'est pas de faire fonctionner le système, mais de le faire fonctionner en toute sécurité. Si vous n'utilisez pas les numéros de version dans vos chemins d'installation, vous n'aurez peut-être même pas à refaire ces règles après chaque mise à jour ;

source: Proxies are good for hygiene and proxies are now a default security feature not just in corporate IT environments, but even on small networks. Making your software not compatible with proxies will require the network administrators of your customer to make and maintain special rules in their firewall, just for you. It is easy to code your software to work with proxies, so please do!
fr: Les serveurs mandataires sont bons pour l'hygiène et les serveurs mandataires sont maintenant une caractéristique de sécurité par défaut non seulement dans les environnements informatiques des entreprises, mais aussi sur les petits réseaux. En rendant votre logiciel non compatible avec les proxies, les administrateurs réseau de vos clients devront établir et maintenir des règles spéciales pour leurs pares-feu, et cela rien que pour vos beaux yeux. Il est facile de coder votre logiciel pour qu'il fonctionne avec des serveurs mandataires, alors faites-le !

source: Don't ship a software that requires allowing javascript to run in PDF readers. Business logic should be run before outputting to a PDF, not after.
fr: Ne livrez pas un logiciel qui nécessite d'autoriser le fonctionnement de javascript dans les lecteurs de PDF. La logique métier doit être exécutée avant la sortie au format PDF, pas après.

source: :mimetype:`PDF` files is the file format people use by default to exchange documents. PDF readers are meant to display documents, not execute unsigned programs.
fr: Le :mimetype:`PDF` est le format de fichier que les gens utilisent par défaut pour échanger des documents. Les lecteurs PDF sont destinés à afficher des documents, et non à exécuter des programmes non signés.
