Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-enterprise-community-comparison.po
Languages: fr

source: Comparing features between the WAPT Enterprise and Community versions
fr: Comparaison des caractéristiques entre les versions WAPT Enterprise et Community

source: WAPT, Enterprise, Community, summary, compare
fr: WAPT, Enterprise, Community, résumé, comparaison

source: Current feature list as of |date|
fr: Liste des caractéristiques actuelles en date du |date|

source: Feature
fr: Caractéristique

source: **Deploy, update and remove software** on hosts running |windows| |linux_debian| |linux_ubuntu| |linux_redhat| |apple| |linux_suse|
fr: **Déployer, mettre à jour et supprimer des logiciels** sur des hôtes fonctionnant sous |windows| |linux_debian| |linux_ubuntu| |linux_redhat| |apple| |linux_suse|

source: The repository is hosted on infrastructure under your control and not under the control of a large MegaCorp, Inc. that will prioritize its own interests over yours
fr: Le dépôt est hébergé sur une infrastructure sous votre contrôle et non sous le contrôle d'une grande MegaCorp, Inc. qui privilégiera ses propres intérêts plutôt que les vôtres

source: Deploy and update **configurations in SYSTEM context**
fr: Déployer et mettre à jour les **configurations dans le contexte du SYSTÈME**\v

source: Deploy and update **configurations in USER context**
fr: Déployer et mettre à jour les **configurations dans le contexte de l'UTILISATEUR**

source: Get a **comprehensive inventory** of hardware, software and applied WAPT packages
fr: Obtenir un **inventaire complet** du matériel, des logiciels et des progiciels appliqués avec WAPT

source: Benefit from the **differenciated self-service** (authorized users may install authorized software from authorized WAPT package stores)
fr: Bénéficier du **libre-service différencié** (les utilisateurs autorisés peuvent installer les logiciels autorisés à partir de magasins de paquets WAPT autorisés)

source: Benefit from **simplified Windows Updates** that work much better than a standard WSUS (only the required KBs are dowloaded from Microsoft)
fr: Bénéficiez de **Mises à jour Windows simplifiées** qui fonctionnent bien mieux qu'un WSUS standard (seuls les KB requis sont téléchargés depuis Microsoft)

source: Simplify and structure your administrative workload by applying WAPT packages to an :abbr:`OU (Organisational Unit)`
fr: Simplifiez et structurez votre charge de travail administrative en appliquant des paquets WAPT à vos :abbr:`UO (Unités d'Organisation)`

source: Configure and manage easily WAPT **store relays to preserve bandwidth** in multi-site environments
fr: Configurer et gérer facilement les relais WAPT **pour préserver la bande passante** dans vos scénarios multi-sites

source: Get access to **ready-to-deploy WAPT packages** for common free-to-use software
fr: Accédez à des dépôts de **paquets WAPT prêts à être déployés** pour des logiciels communs libres ou gratuits

source: Work with **easily verifiable python recipes** for installing, updating and removing software and configuration, recipes may embedd Powershell code or scripts made with other languages (ex: for personalizing a software using a LDAP directory)
fr: Travailler avec des **recettes python facilement vérifiables** pour l'installation, la mise à jour et la suppression de logiciels et de configurations, les recettes peuvent intégrer du code Powershell ou des scripts réalisés avec d'autres langages (ex : pour personnaliser un logiciel en utilisant un répertoire LDAP)

source: Benefit from **hundreds of Helpers** for simplifying your software packaging
fr: Bénéficiez de **centaines de Helpers** pour simplifier le conditionnement de vos logiciels

source: **Encrypt your sensitive data** for transport (software license keys, login, password, server FQDN, API informations for registering software with the vendor, etc)
fr: **Chiffrez vos données sensibles** pour le transport (clés de licence du logiciel, login, mot de passe, FQDN du serveur, informations API pour l'enregistrement du logiciel auprès du vendeur, etc)

source: Automate the auditing of your configurations for an **easy, automated and always up-to-date compliance**
fr: Automatisez l'audit de vos configurations pour une conformité **facile, automatisée et toujours à jour**

source: Benefit from the power of SQL integrated with the WAPT console to make **the reports that you need for your daily sysadmin work or that your organisational requires for budgeting decisions**
fr: Profitez de la puissance du SQL intégré à la console WAPT pour réaliser **les rapports dont vous avez besoin pour votre travail quotidien d'administrateur système ou dont votre organisation a besoin pour prendre des décisions budgétaires**

source: Authenticate your WAPT Administrator against an **Active Directory or LDAP**
fr: Authentifiez votre Administrateur WAPT par rapport à un **Active Directory ou LDAP**

source: Benefit from differenciated roles between software packagers and package deployers so you can **delegate your WAPT powers to the most adequate people** (packagers know security implications, deployers know user needs)
fr: Bénéficier de rôles différenciés entre les développeurs de paquets WAPT et les déployeurs de paquets afin que vous puissiez **déléguer vos pouvoirs WAPT aux personnes les plus appropriées** (les développeurs de paquets connaissent les implications en matière de sécurité, les déployeurs connaissent les besoins des utilisateurs)

source: Licensed under
fr: Licencié sous

source: Proprietary
fr: Propriétaire

source: Verified and approved by national cybersecurity agency |visa_secu|, **WAPT is the only deployment software in the world with this level of certification**
fr: Vérifié et approuvé par l'agence nationale de cybersécurité ANSSI |visa_secu|, **WAPT est le seul logiciel de déploiement au monde avec ce niveau de certification**

source: Professional phone support with Tranquil IT
fr: Support téléphonique professionnel avec Tranquil IT

source: Features coming soon
fr: Caractéristiques à venir prochainement

source: Multi-tenant, multi-client mode with :abbr:`ACL (Access Control Lists)` for :abbr:`MSPs (Managed Service Providers)` and large multi-departmental or international organisations using an internal :abbr:`PKI (Public Key Infrastructure)` based mecanism
fr: Mode multi-tenants, multi-clients avec :abbr:`ACL (Access Control Lists)` pour les infogérants et les grandes organisations multi-départementales ou internationales utilisant un mécanisme interne basé sur une :abbr:`PKI (Public Key Infrastructure)`.

source: Simple to use screensharing for user support, built with the same level of security and privacy as WAPT
fr: Partage d'écran simple à utiliser pour l'assistance aux utilisateurs, construit avec le même niveau de sécurité et de confidentialité que le WAPT

source: History of actions done via WAPT for a complete reporting of a host`s software maintenance lifecycle
fr: Historique des actions effectuées via WAPT pour un rapport complet du cycle de vie de la maintenance logicielle d'une machine

source: Authentication of WAPT Administrators using cryptographic tokens (ex: smartcards)
fr: Authentification des Administrateurs WAPT à l'aide de jetons cryptographiques (ex : cartes à puce)

source: Access to ready-to-deploy WAPT packages or recipes for licensed business software (common business software for industry, medical, office, public collectivities, cybersecurity, etc)
fr: Accès à des paquets WAPT prêts à être déployés ou à des recettes de logiciels commerciaux sous licence (logiciels commerciaux communs pour l'industrie, le secteur médical, les bureaux, les collectivités publiques, la cybersécurité, etc.)

source: Access to ready-to-deploy WAPT package extensions for simplifying desktop armoring using Applocker or equivalent
fr: Accès à des extensions de paquets WAPT prêtes à être déployées pour simplifier le blindage des postes de travail à l'aide d'Applocker ou de ses équivalents.

source: **Continued support for Windows XP** in WAPT for factory machine tools, Hospital medical equipment, expensive research instruments, etc
fr: **Poursuite du support Windows XP** avec WAPT pour les machines-outils d'usine, les équipements médicaux des hôpitaux, les instruments de recherche coûteux, etc

source: Operating system image deployment tool integrated within WAPT
fr: Outil de déploiement d'images du système d'exploitation intégré au WAPT

source: Integration of useful subset of WAPT inventory with popular :abbr:`ITSM (IT Service Management)` tools and triggering of actions from the users ITSM console
fr: Intégration d'un sous-ensemble utile de l'inventaire WAPT avec les outils populaires d':abbr:`ITSM (IT Service Management) et déclenchement d'actions depuis la console ITSM des utilisateurs

source: Summary of operating principles in WAPT
fr: Résumé des principes de fonctionnement de WAPT

source: WAPT is agent based to allow no inbound open port in hosts` firewalls that initiate a secured bi-directional websocket with the server for allowing real-time reporting and actions;
fr: WAPT est basé sur un agent qui n'autorise aucun port ouvert entrant dans les pare-feux des machine ; l'agent lance une *websocket* bidirectionnelle sécurisée avec le serveur pour permettre des remontées d'informations et des actions en temps réel ;

source: Can work with Trusted Data Gateways using simple task scheduling;
fr: Peut fonctionner avec des passerelles de rupture protocolaire en fonctionnant avec le principe des tâches planifiées ;

source: Works on the principle of smoothly pulling updates and then applying upgrades at convenient time (works with low / intermittent bandwidth, high latency, high jitter);
fr: Fonctionne sur le principe de l'extraction en douceur des mises à jour et de leur application à un moment opportun (fonctionne avec une bande passante faible / intermittente, une latence élevée, une forte gigue) ;

source: Does not require an AD (works with Windows Home edition too), but will show the host in its Active Directory tree if the host is joined to an AD;
fr: Ne nécessite pas d'AD (fonctionne également avec l'édition Home de Windows), mais affichera l'hôte dans son arborescence Active Directory si l'hôte est joint à un AD ;

source: Methods for deploying WAPT agent:
fr: Méthodes de déploiement de l'agent WAPT :

source: using a :abbr:`GPO (Group Policy Object)` or an Ansible script;
fr: en utilisant une :abbr:`GPO (Group Policy Object)` ou un script Ansible ;

source: manually after having downloaded the agent from the WAPT server or using :abbr:`SSH (Secured Shell)`;
fr: manuellement après avoir téléchargé l'agent depuis le serveur WAPT ou en utilisant :abbr:`SSH (Secured Shell)` ;

source: Methods for registering hosts with the WAPT server:
fr: Méthodes d'enregistrement des machines auprès du serveur WAPT :

source: automatically using the host`s kerberos account;
fr: automatiquement, en utilisant le compte kerberos de la machine ;

source: manually with the WAPT Superadmin login and password;
fr: manuellement avec le login et le mot de passe WAPT Superadmin ;

source: Upgrades may be triggered:
fr: Les mises à niveau peuvent être déclenchées :

source: upon shutdown of the host, the standard mode;
fr: lors de l'arrêt de la machine, c'est le mode standard ;

source: by an authorized WAPT Administrator in an emergency (ex: critical vulnerabilities running in the wild);
fr: par un Administrateur WAPT autorisé en cas d'urgence (ex : vulnérabilités critiques courant dans la nature) ;

source: by the user at a time she chooses (ex: 24/7 nursing cart unused during lunch break with a simple click);
fr: par l'utilisateur au moment qu'il choisit (ex : chariot de soins infirmiers fonctionnant 24h/24 et 7j/7 et mis à jour pendant la pause déjeuner avec un simple clic) ;

source: via a scheduled task running at a predetermined time (best for servers);
fr: via une tâche planifiée se déroulant à un moment prédéterminé (le mieux pour les serveurs) ;

source: Security is insured with:
fr: La sécurité est assurée avec :

source: signing of WAPT packages using asymetric cryptography;
fr: la signature des paquets WAPT en utilisant la cryptographie asymétrique ;

source: authentication of hosts against the WAPT server using symetric cryptography on registering;
fr: l'authentification des machines par rapport au serveur WAPT en utilisant la cryptographie symétrique lors de l'enregistrement ;

source: confidentiality of the WAPT server using WAPT deployed client certificates;
fr: la confidentialité du serveur WAPT en utilisant des certificats clients déployés par WAPT ;

source: Footnotes
fr: Notes de bas de page

source: The Enterprise version embeds more SetupHelper functions than the Community version.
fr: La version Enterprise intègre plus de fonctions SetupHelper que la version Community.

source: In the Community version, the WAPT SuperAdmin password is shared between individuals that manage the WAPT server.
fr: Dans la version Community, le mot de passe WAPT SuperAdmin est partagé entre les personnes qui gèrent le serveur WAPT.

source: A minimal volume of licences must be subscribed in order to benefit from Tranquil IT's telephone support for the daily operation of the software. Additional paid support is available to help you with your WAPT packaging needs.
fr: Un volume minimal de licences doit être souscrit afin de bénéficier du support téléphonique de Tranquil IT pour l'exploitation quotidienne du logiciel. Une assistance supplémentaire payante est disponible pour vous aider à répondre à vos besoins en matière de packaging WAPT.

source: Windows XP does not work with Python > 2.7. So a special branch of WAPT will be frozen with the last build of the WAPT agent running with 2.7. This version of the agent will of course be excluded from the target of evaluation in future security certifications.
fr: Windows XP ne fonctionne pas avec Python > 2.7. Une branche spéciale de WAPT sera donc gelée avec la dernière version de l'agent WAPT fonctionnant avec 2.7. Cette version de l'agent sera bien sûr exclue de la cible d'évaluation lors des futures certifications de sécurité.
