Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-install/security/security-install-ssl-certificate.po
Languages: fr

source: Using valid SSL / TLS certificates for the WAPT Server
fr: Utiliser un certificat SSL / TLS valide pour le serveur WAPT

source: certificat, WAPT, SSL / TLS, Certificate Authority, documentation
fr: certificat, WAPT, SSL / TLS, Autorité de Certification, documentation

source: Using valid SSL/ TLS certificates for the WAPT Server
fr: Utiliser un certificat SSL / TLS valide pour le serveur WAPT

source: When running the WAPT Server post-configuration script, the script will generate a self-signed certificate so to enable HTTPS communications.
fr: Lors de la post-configuration du serveur WAPT, le script crée un certificat auto-signé pour permettre l'utilisation du protocole HTTPS.

source: The self-signed certificate will of course not be recognized by web browsers and users may get warning messages.
fr: Ce certificat auto-signé ne sera pas reconnu par les navigateurs et il ne permettra pas une vérification correcte du serveur WAPT.

source: It is thus advised to set up a proper SSL/ TLS certificate that will be recognized by you :term:`Organization`'s web browser (either a commercial certificate or one emitted by your internal :term:`Certificate Authority`).
fr: Il est donc conseillé d'utiliser un certificat SSL / TLS reconnu par les navigateurs des postes client de votre :term:`Organisation` (certificat commercial ou provenant de votre :term:`Autorité de Certification` interne déjà poussé sur les postes).

source: Setting up a SSL / TLS certificate on Linux
fr: Mettre en place le certificat SSL / TLS avec linux

source: replace the self-signed public certificate and the private key file located in :file:`/opt/wapt/waptserver/ssl/` with keys and certificates provided by your Organization;
fr: remplacez les fichiers de certificats publics et la clef privée présents dans le répertoire :file:`/opt/wapt/waptserver/ssl/` par ceux de votre Organisation ;

source: we suppose here that the certificate has already been created with the **Common Name** corresponding to your WAPT Server name **srvwapt.mydomain.lan**;
fr: il est ici supposé qu'un certificat avec le **Common Name** ait été préalablement généré par le Gestionnaire de Certificats de l'Organisation pour **srvwapt.mydomain.lan** ;

source: first copy your certificates :file:`.crt` and :file:`.key` files on your WAPT Server. Below, we suppose that they are in the :file:`/etc/ssl/private` folder;
fr: copier au préalable vos certificats :file:`.crt` et :file:`.key` sur votre serveur. Ci-dessous, nous supposons qu'ils sont dans le dossier :file:`/etc/ssl/private` ;

source: **Special case where your certificate has been signed by an internal Certificate Authority**
fr: **Cas particulier des certificats issue d'une CA interne**

source: Certificates issued by an internal :term:`Certificate Authority` must have the complete certificate chain up to the :term:`Certificate Authority`'s certificate.
fr: Les certificats issus d'une :term:`Autorité de Certification` interne (CA) doivent comporter la chaîne complète de validation jusqu'au certificat de l':term:`Autorité de Certification`.

source: You can manually add the certificate chain up to the Certificate Authority to the certificate that will be used by :program:`Nginx`.
fr: Cet ajout pourra être réalisé manuellement en concaténant le certificat issu de la CA et la CA dans le certificat final qui sera utilisé par :program:`Nginx`.

source: Example: :code:`echo srvwapt.mydomain.lan.crt ca.crt > cert.pem`
fr: Exemple : :code:`echo srvwapt.mydomain.lan.crt ca.crt > cert.pem`

source: for more details on the WAPT agent verifying and validating certificates, visit :ref:`this documentation <activating_HTTPS_certificate_verification>`;
fr: pour plus de détails sur la vérification et la validation de certificats côté agent WAPT, visiter :ref:`cette documentation <activating_HTTPS_certificate_verification>` ;

source: for more information on :program:`Nginx` configuration, please refer to the :ref:`documentation on configuring Nginx <config_nginx>`;
fr: pour plus de détails sur la configuration Nginx utilisée : :ref:`config_nginx` ;

source: restart :program:`Nginx` to take into account the new certificates;
fr: relancer :program:`Nginx` pour prendre en compte les nouveaux certificats ;

source: check that :program:`Nginx` restarts;
fr: vérifier que le serveur :program:`Nginx` ait bien redémarré ;

source: Setting up a SSL/ TLS certificate on Windows
fr: Mettre en place le certificat SSL / TLS avec Windows

source: replace the self-signed public certificate and private key file located in :file:`/opt/wapt/waptserver/ssl/` with keys and certificates provided by your Organization;
fr: remplacez les fichiers de certificats publics et la clef privée présents dans le répertoire :file:`/opt/wapt/waptserver/ssl/` par ceux de votre Organisation ;

source: Checking the validity of the certificate
fr: Vérifier la validité du certificat

source: connect with an up-to-date web browser (for example Firefox 57/ Firefox 52.5 ESR) to the WAPT Server web console https://srvwapt.mydomain.lan;
fr: se connecter avec un navigateur à jour (Firefox 57 / Firefox 52.5 ESR) sur l'interface web du serveur WAPT : https://srvwapt.mydomain.lan ;

source: If you are using an internal :term:`Certificate Authority`, the web browser must already have your Organization's internal CA in its certificate store.
fr: Le navigateur doit avoir connaissance de l':term:`Autorité de Certification` utilisée pour la création du certificat SSL / TLS.

source: **Expected result**: you access WAPT Server web page without warning and with the SSL/ TLS validation icons in the address bar; all is fine.
fr: **Résultat attendu** : La connexion au site doit se faire sans encombre, sans avertissement de sécurité et le certificat émis par le serveur WAPT doit apparaître comme étant sûr et vérifié par l'Autorité de Certification de votre Organisation.

source: Go on to the next step to :ref:`configure AD authentication configuration <configure_ad_auth>` or directly to :ref:`install the WAPT console <installing_the_WAPT_console>`.
fr: Passez à l'étape de :ref:`configuration de l'Active Directory <configure_ad_auth>` ou passez directement à l':ref:`installation de la console avec WAPT Setup <installing_the_WAPT_console>`.
