Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/secret-data/encrypt-paquet.po
Languages: fr

source: Encrypting data in a WAPT package
fr: Chiffrer une donnée dans un paquet WAPT

source: WAPT, encrypt, cipher, sensitive data, password, documentation
fr: WAPT, encrypt, chiffrer, documentation, données sensibles, mots de passe

source: Encrypting some sensitive data contained in a WAPT package
fr: Chiffrer certaines données sensibles contenues dans un paquet WAPT

source: This part of the documentation is not recommended for users starting with WAPT.
fr: Cette partie de la documentation est déconseillée aux utilisateurs qui débutent avec WAPT.

source: What is the purpose for doing that?
fr: Pour quoi faire ?

source: With WAPT, the integrity of the package is ensured. A package whose content has been modified without being re-signed will systematically be refused by the WAPT client.
fr: Dans le fonctionnement de WAPT, l'intégrité du paquet est assurée. Un paquet dont le contenu a été modifié sans avoir été re-signé sera systématiquement refusé par le client WAPT.

source: On the other hand, the content of a WAPT package is not encrypted and will be readable by everyone. This technical model of transparency brings nevertheless many benefits.
fr: En revanche le contenu d'un paquet WAPT n'est pas chiffré et sera lisible de tous. Ce modèle technique de transparence apporte cependant de nombreux bénéfices.

source: This can be annoying in the case of a package that contains a password, a license key, or any sensitive or confidential data.
fr: Cela peut être génant dans le cas d'un paquet qui contiendrait un mot de passe, une clé de licence, ou une donnée sensible.

source: Fortunately, **we have a solution**!
fr: Heureusement **nous avons une solution.**!!

source: Working principle of encrypting portions of the content of a WAPT package
fr: Principe de fonctionnement du chiffrement d'une partie du contenu d'un paquet WAPT

source: When a WAPT agent registers with the WAPT server, it generates a private key/ public certificate pair in :file:`C:\\Program Files (x86)\\wapt\\private`.
fr: Lorsque qu'un agent WAPT s\'enregistre auprès du serveur WAPT, il génère un couple clé privée / certificat public dans :file:`C:\Program Files (x86)\\wapt\private`.

source: The certificate is sent to the server with the inventory when the WAPT client is first registered;
fr: Le certificat est envoyé au serveur avec l'inventaire lors de l'enregistrement initial du client WAPT ;

source: The private key is kept by the agent and is only readable locally by :term:`Local Administrators`;
fr: La clé privée est conservée par l'agent et n'est accessible en lecture que par les :term:`Administrateurs Locaux` ;

source: We will therefore encrypt the sensitive data contained inside the package with the certificate belonging to the machine.
fr: Nous allons donc chiffrer la donnée sensible contenue dans le paquet avec le certificat appartenant à la machine.

source: During installation, the WAPT agent will be able to decrypt the sensitive data using its private key.
fr: Lors de l'installation l'agent WAPT pourra ainsi déchiffrer la donnée sensible grâce à sa clé privé.

source: With this mode of operation, the WAPT server and secondary repositories have no knowledge of the sensitive data.
fr: Avec ce mode de fonctionnement le serveur WAPT et les dépôts secondaires n'ont pas connaissance de la donnée sensible.

source: Practical case
fr: Cas pratique

source: You will find here an example of a WAPT package where we encrypt a string of text in an :command:`update_package` function and then decrypt this text in the :command:`install` function.
fr: Vous trouverez ici un exemple de paquet WAPT ou nous chiffrons un texte dans dans une fonction :command:`update_package` puis nous déchiffrons ce texte dans la partie :command:`install`.

source: In this example, the :command:`update_package` function allows us to browse the WAPT server database to retrieve the certificate from each machine and then encrypt the sensitive text with it.
fr: Dans cet exemple, la fonction :command:`update_package` nous permet de parcourir la base de donnée du serveur WAPT pour récupérer le certificat de chaque machine pour ensuite chiffrer le texte sensible avec celui-ci.

source: The encrypted text for each machine is then stored in a :file:`encrypt-txt.json` file at the root of the package.
fr: Le texte chiffré pour chaque machine est ensuite stocké dans un fichier :file:`encrypt-txt.json` à la racine du paquet.

source: During the installation of the package, the WAPT agent will take the encrypted text and decrypt it with its private key.
fr: Lors de l'installation du paquet, l'agent WAPT prendra le texte chiffré et le déchiffrera avec sa clé privé.

source: The python output (log install of the package) is readable by the users on the machine, so **you should not display the decrypted text with a :command:`print` during installation**.
fr: La sortie python (log install du paquet) est accessible en lecture aux utilisateurs de la machine, **vous ne devez donc pas afficher le text déchiffré avec un :command:`print` lors de l'installation**.
