Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-configuration/ini-file/waptconsole.ini.po
Languages: fr

source: Configuring the WAPT console
fr: Configurer la console WAPT

source: wapt-get.ini, configuration, WAPT, documentation
fr: wapt-get.ini, configuration

source: The configuration file for the WAPT console is stored in :file:`C:\\Users\\%username%\\AppData\\Local\\waptconsole\\waptconsole.ini`. This file is automatically generated when the :program:`waptconsole` is first launched and it is generated from the :file:`wapt-get.ini` file configured on the :term:`Administrator`'s workstation.
fr: La configuration de la console WAPT est stockée dans le fichier :file:`C:\\Users\\%username%\\AppData\\Local\\waptconsole\\waptconsole.ini`. Ce fichier est généré automatiquement lors du premier lancement de :program:`waptconsole` à partir du fichier :file:`wapt-get.ini` de l'agent de l\':term:`Administrateur`.

source: Several options are available in the ``[global]`` section of the :file:`waptconsole.ini` file:
fr: On peut retrouver plusieurs options dans la section ``[global]`` du fichier :file:`waptconsole.ini` :

source: Description of available options for the WAPT console
fr: Description des options possibles pour la console WAPT

source: Address of the WAPT Server.
fr: Adresse du serveur WAPT.

source: Address of the main WAPT repository.
fr: Adresse du dépôt WAPT principal.

source: Date when the WAPT console was last used.
fr: Date du dernier usage de la console.

source: Address of the proxy server in the console.
fr: Adresse du proxy dans la console.

source: Use a proxy to connect to the WAPT Server from the console.
fr: Utiliser un proxy pour contacter le serveur WAPT depuis la console.

source: Use a proxy to connect to the main WAPT repository from the console.
fr: Utiliser un proxy pour contacter le dépôt WAPT depuis la console.

source: Prefix used for naming WAPT packages.
fr: Préfix pour personnaliser le nommage des paquets.

source: WAPT base package development folder.
fr: Répertoire de développement des paquets WAPT.

source: Path to the certificate associated with the :term:`Administrator`'s private key.
fr: Chemin du certificat associé à la clé privée de l':term:`Administrateur`.

source: Allows the WAPT console to send anonymous statistics to Tranquil IT.
fr: Autoriser la console à envoyer des statistiques anonymes à Tranquil IT.

source: Language of the WAPT console.
fr: Langue de la console.

source: Launches the console in debug mode.
fr: Lancer la console en debug.

source: ``verify_cert`` = C:\\Program Files (x86)\\wapt\\ssl\\server\\srvwapt.mydomain.lan.crt
fr: C:\\Program Files (x86)\\wapt\\

source: For :ref:`verifying HTTPS certificates <activating_HTTPS_certificate_verification>`.
fr: Pour :ref:`les options possibles, voir <activating_HTTPS_certificate_verification>` pour vérifier les certificats HTTPS.

source: Timeout for actions applied to WAPT agents (ex: :command:`update`).
fr: Timeout lors d'actions sur les agent WAPT. Ex = :command:`update`.

source: Displays the actions that call external applications (RDP, VNC, etc...).
fr: Afficher les actions faisant appel à des applications externes (RDP, VNC etc...).

source: Displays the button to create self-signed certificates or to create the WAPT agent's installer.
fr: Afficher le bouton de création de certificat et d'agent.

source: Hides actions that are not available for the WAPT agent.
fr: Cacher les actions indisponibles pour l'agent.

source: Forces the package certificate's date and CRL to be verified.
fr: Vérifier la date et la CRL du certificat du paquet.

source: List of allowed signature algorithms for the WAPT packages.
fr: Liste les algorithmes de signature autorisés pour les paquets.

source: Configuring external repositories
fr: Configurer des dépôts externes

source: You may add several external repositories by adding ``[sections]`` in :file:`C:\\Users\\%username%\\AppData\\Local\\waptconsole\\waptconsole.ini`.
fr: Vous pouvez ajouter plusieurs dépôts externes en ajoutant des ``[sections]`` dans le fichier :file:`C:\\Users\\%username%\\AppData\\Local\\waptconsole\\waptconsole.ini`.

source: Example:
fr: Exemple :

source: Description of available options for external repositories
fr: Description des options possibles pour les dépôts extérieurs

source: ``repo_url`` = http://srvwapt.mydomain.lan/wapt
fr: ``repo_url`` = https://srvwapt.mydomain.lan/wapt

source: Address of the external WAPT repository.
fr: Adresse du dépôt WAPT externe.

source: ``http_proxy`` = http://proxy.mydomain.lan:8080
fr: ``wapt_server`` = https://srvwapt.mydomain.lan

source: Address of the proxy to use to access the external repository referenced in the ``[section]``.
fr: Adresse du proxy à utiliser pour accéder au dépôt externe référencé dans la "[section]".

source: Folder that contains the certificates used to authenticate downloaded external packages.
fr: Dossier qui contient les certificats utilisés pour authentifier les paquets externes téléchargés.

source: Timeout for the external repository referenced in the ``[section]``. If left empty, no verification is performed.
fr: Délai d'attente pour le dépôt externe référencé dans la ``[section]``. S'il est laissé vide, aucune vérification n'est effectuée.

source: Settings for creating WAPT packages
fr: Paramètres pour la création de paquets WAPT

source: Description of available options for creating WAPT packages
fr: Description des options possibles pour créer des paquets WAPT

source: Path to the private key to be used to sign packages.
fr: Chemin de la clé privée pour signer les paquets.

source: WAPT host package development folder.
fr: Répertoire de développement des paquets machine.

source: Default prefix for new WAPT packages.
fr: Préfixe des paquets par défaut.

source: Default suffix for new WAPT packages.
fr: Suffixe des paquets par défaut.
