Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/waptserver-install/index.po
Languages: fr

source: Installing the WAPT Server
fr: Installer le serveur WAPT

source: install, WAPT, documentation
fr: installer, WAPT, documentation

source: The WAPT Server can be installed on Debian Linux, CentOS or Microsoft Windows **64 bits only**.
fr: Le serveur WAPT s'installe sur Linux Debian, Linux CentOS / RedHat ou Microsoft Windows **64bit uniquement**.

source: Installation tips and requirements
fr: Préconisations d'installation

source: You have to take into consideration a few security points in order to get all the benefits of WAPT:
fr: Quelques considérations de sécurité sont à prendre en compte afin de garantir un fonctionnement optimal de WAPT :

source: we advise you to install WAPT Server on a Linux server (Debian or CentOS) following the security recommendations of French :term:`ANSSI` or the `recommendations of your state cyberdefense agency <https://www.ssi.gouv.fr/uploads/2015/10/NP_Linux_Configuration.pdf>`_.
fr: nous vous conseillons d'installer le serveur WAPT sur un serveur Linux (Debian ou CentOS) en suivant les recommandations de sécurité de l':term:`ANSSI` ou les `recommandations de votre agence nationale de cyberdéfense <https://www.ssi.gouv.fr/uploads/2015/10/NP_Linux_Configuration.pdf>`_.

source: the WAPT Server must be installed on a **dedicated machine** (physical or virtual);
fr: l'installation d'un serveur WAPT doit être réalisée sur un serveur **réservé uniquement à cet usage** ;

source: In all steps of the documentation, you will not use any accent or special character for:
fr: Dans toutes les étapes de la documentation, vous n'utiliserez aucun accent ni caractère spécial pour :

source: user logins;
fr: le login des utilisateurs ;

source: path to the private key and the certificate bundle;
fr: le chemin de la clé privée et du certificat ;

source: the :abbr:`CN (Common Name)`;
fr: le :abbr:`CN (Common Name)` ;

source: the installation path for WAPT;
fr: le chemin d'installation de WAPT ;

source: group names;
fr: le noms de groupes ;

source: the name of hosts or the the name of the server;
fr: le nom des machines et du serveur ;

source: the path to the folder :file:`C:\\waptdev`;
fr: le chemin ver le répertoire :file:`C:\\waptdev` ;

source: Hardware recommendations
fr: Préconisations matérielles

source: The WAPT Server can be installed either on a virtual server or a physical server.
fr: WAPT s'installe dans une machine virtuelle ou directement sur une machine physique.

source: RAM and CPU recommendations are:
fr: Les préconisation RAM et CPU pour le serveur WAPT sont :

source: Size of the network
fr: Taille de parc

source: From 0 to 200 desktops
fr: De 0 a 200 postes

source: From 200 desktops onward
fr: A partir de 200 postes

source: A minimum of 10GB of free space is necessary for the system, the database and log files. **For better performance, Tranquil IT recommends the database to be stored on fast storage, such as SSD drives or PCIe-based solid-state drives**.
fr: Un minimum de 10 Go d'espace libre est nécessaire pour le système, la base de données et les fichiers de journalisation. **Pour de meilleures performances, Tranquil IT recommande que la base de données soit stockée sur des supports rapides, tels que des disques SSD ou des SSD sur PCIe**.

source: The overall disk requirement will depend on the number and size of your WAPT packages (software) that you will store on your main repository; 30GB is a good start. It is not strictly required to store WAPT packages on fast drives.
fr: Le besoin global en disque dépendra du nombre et de la taille de vos paquets WAPT (logiciels) que vous stockerez sur votre dépôt principal ; 30 Go est un bon début. Il n'est pas strictement nécessaire de stocker les paquets WAPT sur des lecteurs rapides.

source: Configuring the DNS
fr: Configurer les DNS

source: Installing WAPT Server on Debian Linux
fr: Installer le serveur WAPT sur Linux Debian

source: Installing WAPT Server on CentOS7
fr: Installer le serveur WAPT sur CentOS7

source: Installing WAPT Server on a Windows host
fr: Installer le serveur WAPT sur Windows

source: Installing WAPT Server with Ansible
fr: Installer le serveur WAPT avec Ansible
