Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/updatepackage/index.po
Languages: fr

source: Updating automatically a software package
fr: Automatiser la mise à jour d'un paquet logiciel

source: WAPT, documentation, automatic update
fr: WAPT, documentation, mise à jour automatique

source: This part of the documentation is for advanced users of WAPT.
fr: Cette partie de la documentation est déconseillée aux utilisateurs qui débutent avec WAPT.

source: Why is it useful to do that?
fr: Pour quoi faire ?

source: *update_package* functions are very practical, they allow to gain a lot of time when it is time to update a WAPT package with the most recent version of a piece of software.
fr: Les fonctions *update_package* sont très pratiques, elles permettent de gagner du temps lorsque qu'il faut mettre à jour un paquet avec la version la plus récente d'un logiciel.

source: Working principle
fr: Fonctionnement

source: The *update_package* function will:
fr: la fonction *update_package* paquet ira :

source: fetch online the latest version of the software;
fr: récupérer la dernière version du logiciel en ligne ;

source: download the latest version of the software binaries;
fr: télécharger la dernière version du binaire ;

source: remove old versions of the software binaries;
fr: supprimer les anciennes version des binaires ;

source: update the version number of the software in the :file:`control` file;
fr: mettre à jour la version dans le fichier :file:`control` ;

source: If you base your *install* function on the version number inside the :file:`control` file, then you do not even need to modify your :file:`setup.py`.
fr: Si votre fonction *install* se base sur la version du fichier :file:`control` pour l'installation, alors vous n'avez pas besoin de modifier votre :file:`setup.py`.

source: You just have to do your usual Quality Assurance tests before you :command:`build-upload` your new package.
fr: Il vous reste maintenant à tester l'installation avant de lancer un :command:`build-upload`.

source: Example
fr: Exemple

source: Here is the *update_package* script for :program:`firefox-esr` as an example:
fr: Voici l'*update_package* de :program:`firefox-esr` comme exemple :

source: You may launch the *update_package* script by pressing :kbd:`F9` in :program:`PyScripter`.
fr: Vous pouvez lancer l'update_package* en appuyant sur la touche :kbd:`F9` dans :program:`PyScripter`.

source: You will find many inspiring examples of *update_package* scripts in packages hosted in the `Tranquil IT store <https://store.wapt.fr/>`_.
fr: Vous trouverez de nombreux exemples d'*update_package* qui vous inspireront dans les paquets du `store de Tranquil IT <https://store.wapt.fr/>`_.
