Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/package-msi-evo/index.po
Languages: fr

source: msi, WAPT, advanced, complex, installation, installing, documentation
fr: msi, WAPT, evolués, complexes, documentation

source: Advanced \*.msi package
fr: Créer un paquet \*.msi evolué

source: Improving your MSI based package
fr: Améliorer le paquet MSI

source: The installation/ updating of the :program:`TightVNC` package chosen as an example in the previous part of the documentation requires to close all instances of :program:`TightVNC` for the software to upgrade.
fr: L'installation / la mise à jour du paquet TightVNC pris pour exemple précédemment nécessitera de le fermer le temps de la mise à jour.

source: Manual method: killalltasks
fr: Méthode manuelle : killalltasks

source: A simple method is to kill all existing processes of :program:`TightVNC` before launching the installation of the *tis-tightvnc* package.
fr: Une première méthode est de *tuer* tous les processus VNC avant de lancer l'installation du paquet *tis-tightvnc*.

source: Elegant method: install_msi_if_needed
fr: Méthode élégante : install_msi_if_needed

source: the Setuphelpers library provides a function called :command:`install_msi_if_needed` that addresses all the described problems in only one line of code;
fr: la librairie de fonctions setuphelpers fournit la fonction :command:`install_msi_if_needed` qui permet de gérer ce cas directement en une seule fonction ;

source: the function will also test whether a version of the software is already installed on the machine using the *uninstall key*;
fr: la fonction testera également si une version du logiciel est déjà installée sur la machine avec la clé de désinstallation ;

source: if the *uninstall key* is already present, the new version of the software will be installed only if the installed version is older;
fr: si présence il y a, l'installation sera enclenchée uniquement si la version actuellement installée est inférieure ;

source: after the installation, the function will finally test that the *uninstall key* is present and its version, to ascertain that all went well;
fr: après installation, la fonction testera finalement la présence de la clé de déinstallation et sa version pour vérifier que tout s'est bien passé ;

source: List of arguments available with *install_exe_if_needed*
fr: Liste des arguments disponibles avec *install_exe_if_need*.

source: Settings
fr: Paramètres

source: Default value
fr: Valeur par défaut

source: name of the MSI file to execute.
fr: nom du fichier MSI à exécuter.

source: minimal version above which the software will update.
fr: version minimale au dessus de laquelle il mettra à jour.

source: list of programs to kill before installing the package.
fr: liste des programmes à tuer avant de lancer l'installation.

source: accepted codes other than 0 and 3010 returned by the function.
fr: codes de retour autres que 0 ou 3010 acceptés en retour par la fonction.

source: maximum installation wait time (in seconds).
fr: durée d'attente maximale d'installation (en secondes).

source: additional properties to pass as arguments to MSI setup file.
fr: propriétés supplémentaires à passer en argument au MSI pour l'installation.

source: value passed as parameter to control the version number instead of the value returned by the *installed_softwares* function
fr: valeur passée en paramètre pour le contrôle de version au lieu de celle retournée par la fonction *installed_softwares*

source: automatically removes an older version of a software whose *uninstall key* is identical
fr: supprimme automatiquement une ancienne version d'un logiciel dont la *uninstallkey* est identique

source: forces the installation of the software even though the same *uninstall key* has been found
fr: force l'installation du logiciel même si une *uninstall key* avec une version identique est trouvée.

source: The :command:`install_msi_if_needed` method searches for an *uninstall key* in the MSI file properties, it is not necessary to fill it manually in the :file:`setup.py` file.
fr: La fonction :command:`install_msi_if_needed` récupère la clé de désinstallation depuis le MSI, il n'est pas nécessaire de l'écrire dans le fichier :file:`setup.py`.

source: Launch the installation and watch for what's happening in the WAPT console when the software is already installed.
fr: En lançant le paquet, on observe ce qu'il se passe dans la console quand le logiciel est déjà installé.

source: Handling x32 and x64 architectures
fr: Gérer les plateformes x32/x64

source: To handle different processor architectures, use the function :command:`iswin64()`.
fr: Pour la gestion de l'architecture de processeur x32 / x64, on utilise la fonction :command:`iswin64()`.

source: Passing additional arguments
fr: Ajouter des propriétés supplémentaires en argument

source: To pass additional arguments, store them in a *dict*.
fr: Pour ajouter des propriétés supplémentaires on va les stocker dans un élément *dict*.
