Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-concept/index.po
Languages: fr

source: Introduction to WAPT
fr: Présentation des grands principes de WAPT

source: WAPT, Why, How, principles, documentation, history, genesis
fr: WAPT, Pourquoi, Comment, principes, documentation

source: For what purpose is WAPT useful?
fr: A quoi sert WAPT ?

source: **WAPT** installs, updates and removes software and configurations on Windows devices. Software deployment (Firefox, MS Office, etc.) can be carried out from a central server using a graphical console. WAPT is taking many ideas from Debian Linux apt package management tool, hence its name. WAPT **Community** Edition is distributed under the **GPLv3** license. **Enterprise** Edition is distributed under a proprietary license.
fr: **WAPT** déploie, met à jour et et supprime des logiciels et des configurations sur un parc Windows. Le déploiement de logiciels (Firefox, MS Office, ...) s'effectue de manière centralisée avec la console graphique. Le fonctionnement de WAPT s'inspire fortement du gestionnaire de paquets du système GNU / Linux Debian apt, d'où son nom. WAPT est libre et soumis à la licence **GPLv3**. L'édition **Enterprise** est soumise à une licence propriétaire.

source: **WAPT** is intended to help IT administrators manage their deployed base of computer desktops, laptops, tablets running a Microsoft Windows client (from XP to 10), their deployed base of Windows servers (from 2003 to 2019) or their deployed base of Windows Intel tablets.
fr: **WAPT** est destiné aux gestionnaires de parcs de PC, de portables, de tablettes Windows fonctionnant avec des versions client de Windows (XP à 10) ou des versions serveur de Windows (2003 à 2019).

source: Private companies of all sizes, Colleges, Schools, Universities, research labs, local and state governments, Hospitals, city hall, state ministries are successfully using **WAPT**.
fr: Des entreprises de toutes tailles, françaises et internationales, des lycées, des collèges, des écoles, des rectorats, des universités, des centres de recherche, des mairies, des communautés d'agglomération, des communautés de communes, des hôpitaux, des Ministères utilisent **WAPT**.

source: **WAPT** exists in two versions, **Community** and **Enterprise**.
fr: **WAPT** existe en deux versions, **Community** et **Enterprise**.

source: **WAPT** is very efficient to address **recurrent Flash and Java update needs** and it is often to cover that basic need that WAPT is initially adopted; it then becomes a tool of choice for the sysadmin's daily tasks.
fr: **WAPT** est particulièrement efficace pour traiter le cas récurrent des **mises à jour Flash et Java** et c'est souvent pour couvrir ce besoin que WAPT est initialement adopté ; ensuite il devient un outil apprécié, voire indispensable pour le quotidien de l'administrateur système.

source: **If you're a developer, WAPT can help you configure your development environment on your computer as Chocolatey / NuGet can do.**
fr: **Si vous êtes un développeur, WAPT en mode ligne de commande peut vous aider à configurer votre PC de développement comme le font Chocolatey / NuGet.**

source: The genesis of WAPT
fr: Genèse WAPT

source: Our assessment after 15 years of IT management
fr: Notre constat après 15 ans d'infogérance

source: Managing large IT installed bases of Microsoft Windows computers is today a difficult task in a secured environment:
fr: L'administration d'un large parc de PC sous MS Windows est à l'heure actuelle un exercice acrobatique en environment sécurisé :

source: common ghosting methods (*Clonezilla* or *Ghost*) are efficient on homogeneous IT infrastructures with roaming user profiles;
fr: les méthodes généralement utilisées (mastérisations type *ghost* ou *clonezilla*) sont efficaces si les parcs machines et les parcs applicatifs sont homogènes et que les profils utilisateurs sont itinérants ;

source: deployment software (*OCSInventory* or *WPKG*) can broadcast software but does not easily allow software level or user level customizations that are useful to prevent or limit user support requests;
fr: les outils de télé-déploiement (*OCSInventory* ou *WPKG*) diffusent les logiciels mais ne permettent pas d'effectuer de manière simple les personnalisations qui évitent les demandes de support utilisateur ;

source: software from smaller vendors often need :term:`Local Administrator` rights to run properly;
fr: les logiciels de petits éditeurs nécessitent souvent des droits :term:`Administrateur Local` pour fonctionner ;

source: currently available solutions to address theses 3 problems are either too expensive or too inefficient, and they are in every case too complex;
fr: les solutions développées pour adresser ces trois problèmes s'appuient sur des méthodes soit trop chères, soit insuffisantes, et dans tous les cas trop complexes ;

source: WAPT development hypotheses and motivations
fr: Les hypothèses de travail qui animent le développement de WAPT

source: The development of WAPT is motivated by these two principles:
fr: Le développement de WAPT est animé par deux principes :

source: what is **complicated** should be made **simple**;
fr: ce qui est **compliqué** doit être rendu **simple** ;

source: what is **simple** should be made **trivial**;
fr: ce qui est **simple** doit être rendu **trivial** ;

source: WAPT relies on a small set of fundamental hypotheses:
fr: WAPT s'appuie sur un jeu d'hypothèses fondamentales :

source: sysadmins know script languages and WAPT has chosen Python for the depth and breadth of its libraries;
fr: les adminsys connaissent les langages de script, et WAPT a choisi python pour la profondeur et l'étendue de ses librairies ;

source: sysadmins who have little experience with scripting languages must find inspiration in simple and efficient examples that they'll adapt to fit their needs;
fr: les adminsys qui ne connaissent pas encore très bien les langages de script doivent pouvoir s'inspirer d'exemples simples et efficaces qu'ils adapteront à leurs situations spécifiques ;

source: sysadmins must be able to communicate on the efficiency of their actions to their superiors and report process gaps to internal or external auditors;
fr: les adminsys doivent pouvoir communiquer l'efficacité de leurs actions à leur direction et restituer les écarts de process aux auditeurs de leur société ;

source: sysadmins must be able to collaborate with their IT team in full trust; thereby WAPT local repositories provide signed packages they can trust to be deployed on their network. Alternatively, they can choose external repositories providing them the security guarantees they consider sufficient;
fr: les adminsys doivent pouvoir collaborer avec des collègues adminsys dans un climat de confiance ; ainsi les dépôts WAPT internes et privés servent des logiciels qu'ils signent eux-mêmes. Sinon, ils choisissent des dépôts publics qui leur fournissent les garanties de sécurité qu'ils jugent suffisantes ;

source: sysadmins are aware that user workstations serve business purposes and some customizations must be possible. The adaptation of the infrastructure to the business needs is facilitated by the notion of groups; it allows to select a large number of machines to customize their configuration;
fr: les adminsys sont conscients que les postes utilisateurs servent des objectifs métier et une certaine personnalisation doit être rendue possible ; l'adaptation du parc aux enjeux métiers est facilitée par la notion de groupes qui permet de sélectionner des machines respectant un critère de tri pour personnaliser leur configuration ;

source: Fundamental principles
fr: Principes fondamentaux

source: Package/ Repository principle
fr: Principe de Paquets / Dépôts

source: WAPT packages
fr: Les paquets WAPT

source: A WAPT package structure is similar to Debian Linux **.deb** packages. Each WAPT package includes the binaries to be executed and the other files it needs.
fr: La structure d'un paquet WAPT est similaire à celle d'un paquet **.deb** de Debian Linux. Chaque paquet WAPT embarque avec lui les binaires qui seront exécutés et les autres fichiers dont il aura besoin.

source: A package is easily transportable.
fr: Un paquet est transportable facilement.

source: Here is how a WAPT package looks:
fr: Voici la structure d'un paquet WAPT :

source: WAPT package structure
fr: Structure d'un paquet WAPT

source: WAPT repositories
fr: Les dépôts WAPT

source: Packages are stored in a web repository. They are not stored in a database.
fr: Les paquets sont stockés dans un répertoire web. Ils ne sont pas stockés dans une base de données.

source: They are served by the :program:`Nginx` web server, available with Linux and Windows.
fr: Ils sont servis par le serveur web :program:`Nginx`, disponible pour Linux et Windows.

source: The :file:`Packages` index file is the only thing necessary. It lists the packages available on allowed repositories and some basic information on each package.
fr: Seul le fichier d'index :file:`Packages` est nécessaire. Le fichier :file:`Packages` permet d'indiquer au client la liste des paquets disponibles sur le dépôt, et les informations de base de chacun des paquets du dépôt.

source: That mechanism allows to easily set up a replication process between multiple repositories.
fr: Ce fonctionnement permet de mettre en place facilement un mécanisme de réplication entre plusieurs dépôts.

source: Types of WAPT packages
fr: Types de paquets WAPT

source: There are 7 types of WAPT packages:
fr: Il existe 7 types de paquets WAPT:

source: Anatomy of a simple WAPT package
fr: Représentation d'un paquet WAPT simple

source: *Base* packages
fr: Les paquets *base*

source: They are classic software packages.
fr: Ce sont les paquets logiciels classiques.

source: They are stored in the web directory https://srvwapt.mydomain.lan/wapt/.
fr: Ils sont stockés dans le répertoire web https://srvwapt.mydomain.lan/wapt/.

source: *Group* packages
fr: Les paquets *group*

source: They are groups/ bundles of packages.
fr: Ce sont des paquets qui permettent de faire des groupes de logiciels ou des groupes de machines.

source: a group / bundle of softwares often corresponds to a *host profile* (ex: **accounting**);
fr: un groupe de logiciels correspond en réalité à un profil de machine (ex: **compta**) ;

source: a group of hosts often corresponds to a room, building, etc;
fr: un groupe de machines correspond en réalité à une salle, un bâtiment, etc ;

source: a host can be a member of several groups (ex: one or more hosts profiles in the same room in a building);
fr: une machine peut appartenir à plusieurs groupes (ex : un ou plusieurs profils de machine dans une salle dans un bâtiment) ;

source: *Host* packages
fr: Les paquets *host*

source: Host packages are named after the :term:`UUID` of the computer BIOS.
fr: Les paquets "machines" portent le nom :term:`UUID` Bios de la machine.

source: Each host will look for its *host* package to know the packages that it must install (i.e. *dependencies*).
fr: Chaque Poste client va par défaut chercher son paquet machine pour connaître la liste des paquets qu'il doit installer (*dépendances*).

source: They are stored in the web directory https://srvwapt.mydomain.lan/wapt-host/.
fr: Ces paquets sont stockés dans le répertoire https://srvwapt.mydomain.lan/wapt-host/.

source: *Unit* packages
fr: Les paquets *unit*

source: *Unit* packages bear the complete name of :abbr:`OU (Organizational Unit)`, example: **OU=room1,OU=prod,OU=computers,DC=mydomain,DC=lan**.
fr: Les paquets "unit" portent le nom complet d'une :abbr:`OU (Unité Organisationnelle)`, exemple : **OU=BUREAU1,OU=prod,OU=computers,DC=mydomain,DC=lan**.

source: By default, each computer looks for the *unit* packages that the host belongs to:
fr: Chaque Poste client va par défaut chercher les paquets *unit* dont il fait partie :

source: OU=room1,OU=prod,OU=computers,DC=mydomain,DC=lan;
fr: OU=BUREAU1,OU=prod,OU=computers,DC=mydomain,DC=lan ;

source: and then installs the list of associated dependencies.
fr: et ensuite installer la liste des dépendances associées.

source: If the computer is removed from an Organizational Unit, obsolete *unit* packages will be removed.
fr: Si la machine change d'OU, alors les paquets *unit* obsolètes seront désinstallés.

source: *waptwua* packages
fr: Les paquets *waptwua*

source: *waptwua* packages contain the list of authorized or prohibited Windows Updates.
fr: Les paquets *waptwua* contiennent le liste des mises à jour Windows autorisées et interdites.

source: When this package is installed on the endpoint, the next update scan performed by WAPT will choose Windows updates based on this filtering.
fr: Lorsque ce paquet est installé sur le terminal, la prochaine analyse de mise à jour effectuée par WAPT choisira les mises à jour Windows en fonction de ce filtrage.

source: If the host has several *waptwua* packages, then WAPT will merge all package rules.
fr: Si la machine a plusieurs listes de paquets *waptwua* applicables, alors WAPT combine les règles.

source: When this package is installed on the host, the next :command:`update` will scan for official Windows updates applicable to the host based on this filtering.
fr: Lorsque ce paquet est installé sur l'hôte, le prochain :command:`update` recherchera les mises à jour officielles de Windows applicables à l'hôte en fonction de ce filtrage.

source: *selfservice* packages
fr: Les paquets *self-service*

source: *selfservice* packages contain a list of groups or users (Active Directory or local) and their associated lists of authorized packages that Users are allowed to install by themselves.
fr: Les paquets *self-service* contiennent une liste de groupes ou d'utilisateurs (Active Directory ou local) et leurs listes associées de paquets que les utilisateurs seront autorisés à installer par eux-mêmes.

source: *profile* packages
fr: Les paquets *profile*

source: *profile* packages are similar to *group* packages.
fr: Les paquets *profile* sont similaires aux paquets *groupe*.

source: However, *profile* packages work a little differently and are most useful when an Active Directory Server is operating within the :term:`Organization`:
fr: Cependant, les paquets *profile* fonctionnent un peu différemment et sont plus utiles lorsqu'un serveur Active Directory fonctionne dans l':term:`Organisation` :

source: the WAPT agent will list the Active Directory groups where the host belongs;
fr: l'agent WAPT listera les groupes Active Directory auxquels appartient l'hôte ;

source: if a *profile* package has the same name as the Active Directory group, then the WAPT agent will install automatically the *profile* package for the Active Directory group of which it is a member;
fr: si un paquet *profile* porte le même nom que le groupe Active Directory, l'agent WAPT installera automatiquement le paquet *profile* pour le groupe Active Directory auquel il appartient ;

source: If the host is no longer a member of its Active Directory group, then the *profile* package will be uninstalled.
fr: Si l'hôte n'est plus membre de son groupe Active Directory, le paquet *profile* sera désinstallé.

source: For performance reasons, this feature is enabled only if the *use_ad_groups* option is enabled in :file:`wapt-get.ini`.
fr: Pour des raisons de performance, cette fonctionnalité n'est activée que si l'option *use_ad_groups* est activée dans :file:`wapt-get.ini`.

source: Dependency mechanism
fr: Principe de dépendances

source: In WAPT everything works on the principle of dependencies.
fr: Dans WAPT tout fonctionne selon le principe des dépendances.

source: By default, the WAPT agent will look for its host package. The *host* package lists packages to install on the computer.
fr: Par défaut, le client WAPT va chercher à installer son paquet machine. Le paquet *host* listera les autres paquets à installer sur la machine.

source: The *host* package is correctly installed when all its dependencies are satisfied.
fr: Ainsi, le paquet *host* sera correctement installé si toutes ses dépendances sont satisfaites.

source: Each sub-dependency must be satisfied to satisfy an upper-level dependency.
fr: Chaque dépendance devra satisfaire aux sous-dépendances et ainsi de suite.

source: When every dependency is satisfied, the host notifies its status to the WAPT Server and its indicator turns **OK** and green in the WAPT console, meaning the host has the host profile that the :term:`Administrator` or :term:`Package Deployer` has defined for it.
fr: Quand toutes les dépendances sont satisfaites, la machine remonte en état **OK** dans la console, signifiant que la machine est conforme au profil que l':term:`Administrateur` ou le :term:`Déployeur de Paquets` aura défini pour elle.

source: Conceptual diagram of the dependency mechanism
fr: Schéma conceptuel de la notion de dépendance

source: When attributing a software package to a host as a dependency, only the software canonical name without its version number is registered as a dependency (ex: I want Freemind to be installed on this machine in its latest version and :program:`Freemind` to be configured so that the :term:`User` does not call me because she does not find the icon on her desktop!).
fr: Lorsqu'on attribue un paquet logiciel à une machine, on lui affecte le nom canonique du logiciel sans son numéro de version (ex: je veux que :program:`Freemind` soit installé sur cette machine dans sa dernière version et que :program:`Freemind` soit configuré pour que l':term:`Utilisateur` ne m'appelle pas car il ne trouve pas l'icône sur son bureau!).

source: For each dependency, the WAPT agent will take care of automatically installing the latest available package version. So if several versions of :program:`Freemind` are available on the repository, the WAPT agent will always get the latest version, unless I have pinned the version for reason of compatibility with other sets of tools.
fr: Pour chaque paquet en dépendance, l'agent WAPT local s'occupera d'aller chercher automatiquement la dernière version du paquet. Donc si plusieurs versions de :program:`Freemind` sont disponibles sur le dépôt, l'agent WAPT ira toujours chercher la dernière version, à moins que vous ayez épinglé la version pour cause de compatibilité avec d'autres outils.

source: Afterwards, when the agent contacts the repository to check for new updates, it will compare the package versions on the repository with its own local list of packages already installed on the machine.
fr: Ensuite, lorsque l'agent contacte le dépôt pour vérifier s'il y a de nouvelles mises à jour, il compare les versions des paquets du dépôt avec sa propre liste locale de paquets déjà installés sur la machine.

source: If an update of an installed package is available, the client will switch the status of the package to **NEED UPGRADE**. It will then install the software updates during the next :command:`upgrade`.
fr: Si une mise à jour d'un paquet déjà installé est disponible, le client basculera le statut du paquet en **NEED UPGRADE**. Il installera ainsi les mises à jour au prochain :command:`upgrade`.

source: Private key / Public key principle
fr: Principe de clé privée / clé publique

source: Like Android **APK** packages, WAPT packages are signed; a hash of the control sum of all the files included in the package is calculated.
fr: Comme **APK** sous Android, les paquets WAPT sont signés et embarquent une somme de contrôle de la liste des fichiers contenus dans le paquet.

source: This signing method guarantees the origin and integrity of the package.
fr: Cette méthode de signature permet de garantir la provenance et l'intégrité du paquet.

source: Private key/ public certificate
fr: Principe de clé privée / clé publique

source: To work properly, WAPT requires a private key/ public key pair (self-signed, issued by an internal :term:`Certificate Authority` or commercially issued).
fr: L'usage de WAPT nécessite un couple clé privée / certificat public (auto-signé, issu d'une :term:`Autorité de Certification` interne, ou commercial).

source: The **private key** will be used to **sign** WAPT packages whereas the **public key** will be distributed with every WAPT client so that WAPT agents may validate the files that were signed with the private key.
fr: La **clé privée** servira à **signer** les paquets WAPT et un **certificat public** associé (CA associé ou certificat auto-signé) sera distribué sur chaque client WAPT pour qu'il puisse valider les fichiers signés avec la clé privée.

source: The different public keys will be stored in the WAPT subdirectory :file:`ssl`. That folder can contain several public keys.
fr: Les différents certificats publics seront stockés dans un dossier :file:`ssl` de l'agent WAPT, ce dossier peut contenir plusieurs certificats publics.

source: Package verification
fr: Vérification des paquets

source: When a WAPT package is downloaded, the WAPT agent (:program:`waptagent`) will check the integrity of the package, and then check that the package has been properly **signed**.
fr: Lorsqu'un paquet WAPT est téléchargé, l'agent WAPT (:program:`waptagent`) vérifie l'integrité des fichiers, puis vérifie que le paquet a été correctement **signé**.

source: If the WAPT package signature does not match any of the public keys located in :file:`C:\\Program Files (x86)\\wapt\\ssl`, the WAPT agent will refuse to install the package.
fr: Si la signature du paquet WAPT ne correspond à aucune des clés publiques situées dans :file:`C:\\\Program Files (x86)\\\wapt\\\\ssl`, l'agent WAPT refusera d'installer le paquet.

source: For more information, please refer to the documentation on :ref:`how the installation process integrity of a WAPT package is insured <WAPT_package_installation_process_integrity>`.
fr: Pour en savoir plus rendez-vous dans la section de documentation pour :ref:`protéger l'intégrité du processus d'installation des paquets WAPT <WAPT_package_installation_process_integrity>`.

source: The private certificate is important
fr: Importance de la clé privée

source: The private key must **NOT** be stored on the WAPT Server, nor on any public or shared storage that could be accessed by non-authorized personnel. Indeed, WAPT security is based on keeping the private key **private**.
fr: La clé privée ne doit pas être stockée sur le serveur WAPT, ni sur aucune machine potentiellement accessible à une entité non-autorisée car toute la sécurité de WAPT repose sur la confidentialité des jeux de clés privées.

source: The private key must be stored in a safe place, because **she who has your key controls your network**!
fr: Elle doit être stockée en lieu sûr car **celui qui contrôle votre clé contrôle votre parc** !

source: Finally, to ensure maximum security, the private key can be secured in a smartcard or a cryptographic token that WAPT :term:`Administrators` or :term:`Package Deployer` will carry physically on them, using the smartcard or the token only when needed to sign a WAPT package.
fr: Enfin, pour un maximum de sécurité, la clé privée pourra être une smartcard ou un jeton cryptographique que les :term:`Administrateurs` et :term:`Déployeurs de Paquets` transporteront physiquement sur eux, utilisant leur smartcard ou leur jeton cryptographique ponctuellement pour signer un paquet WAPT.

source: From WAPT 1.5 onward, the private key is protected with a password by default.
fr: Depuis la version 1.5 de WAPT, la clé privée est protégée par un mot de passe.

source: WAPT architecture and operating mode
fr: Fonctionnement et architecture WAPT

source: Inventory/ information feedback
fr: remontée des informations d'inventaire

source: WAPT keeps a hardware and software inventory of each host.
fr: WAPT fait un inventaire matériel et logiciel de chaque machine.
