Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-concept/index.po
Languages: fr

source: That inventory is stored in a small database integrated in each WAPT agent.
fr: Cet inventaire est stocké dans une petite base de données incorporée dans l'agent WAPT.

source: Inventory feedback mechanism
fr: Fonctionnement de la remontée d'inventaire

source: when first registering with the WAPT Server, the WAPT agent sends the entire inventory (BIOS, hardware, software) to the server;
fr: lors d'un premier enregistrement, le client WAPT remonte la totalité de son inventaire (BIOS, machine, logiciels) au serveur ;

source: when the WAPT agent updates, the WAPT agent will report its inventory status to the WAPT Server;
fr: lors de chaque mise à jour du client, l'agent WAPT remonte le delta de l'inventaire au serveur ;

source: The inventory in the WAPT console
fr: L'inventaire dans la console WAPT

source: The central inventory allows you to filter hosts by their components, software or any other searchable argument.
fr: Cet inventaire centralisé permettra de filtrer les postes par matériel, logiciel ou de filtrer sur tout autre paramètre remonté dans l'inventaire.

source: Information feedback
fr: La remontée d'informations

source: The WAPT agents also report back their WAPT package status.
fr: L'agent WAPT remonte également le statut des paquets WAPT.

source: Inventory feedback returned to the WAPT Server
fr: La remontée du statut des paquets vers le serveur WAPT

source: In case of errors during package installation, the information will be reported to the WAPT Server. The host will then appear in **ERROR** in the console.
fr: En cas d'erreur lors de l'installation du paquet, l'information sera transmise au serveur WAPT. La machine apparaîtra alors en **ERREUR** dans la console.

source: Packages with error status in the WAPT console
fr: Elément en erreur dans la console WAPT

source: The :term:`Administrator` can see the package returned in error in the console and fix the package accordingly.
fr: L':term:`Administrateur` pourra ensuite constater l'erreur dans la console et la corriger.

source: For each :command:`upgrade`, WAPT will try to install a new version of the package until no error status is returned.
fr: À chaque :command:`upgrade`, WAPT tentera une nouvelle fois l'installation du paquet en erreur.

source: From WAPT 1.3.13 onward, WAPT agents sign their inventory before sending it to the WAPT Server.
fr: Pour plus de sécurité, depuis la version 1.3.13, l'inventaire remontée par l'agent wapt est signé par l'agentwapt.

source: For more information, please refer to :ref:`signing inventory updates <signing_inventory_updates>`.
fr: Pour en savoir plus rendez-vous sur la documentation pour :ref:`signer les remontées d'inventaire <signing_inventory_updates>`.

source: Complete diagram of the WAPT operating mechanism
fr: Diagramme complet du fonctionnement de WAPT

source: WAPT general operating mode
fr: Fonctionnement général de WAPT

source: We find here the common WAPT behavior, from duplicating a package from an external repository accessible on the Internet, to deploying it on network hosts.
fr: On retrouve ici le comportement classique de WAPT, de la duplication d'un paquet depuis un dépôt externe sur Internet jusqu'à son déploiement sur les clients.

source: Read the diagram clockwise:
fr: Il faut lire ce schéma dans le sens des aiguilles d'une montre :

source: import packages from an external repository (or create a new package from scratch);
fr: importer des paquets depuis un dépôt (ou créer ex-nihilo un paquet) ;

source: test, validate, build and then sign the package;
fr: tester, ensuite valider, puis construire et enfin signer le paquet ;

source: upload the package onto the main repository;
fr: charger le paquet sur le dépôt principal ;

source: packages are automatically downloaded by WAPT clients;
fr: ensuite, téléchargement automatique des paquets par les clients WAPT ;

source: packages are executed based on the selected method:
fr: exécution des paquets selon la méthode sélectionnée :

source: The :term:`Administrator` forces the :command:`upgrade`;
fr: L':term:`Administrateur` force l':command:`upgrade` ;

source: the :term:`User` chooses the right time for themself;
fr: l':term:`Utilisateur` choisit le moment opportun pour lui ;

source: a scheduled task launches the upgrade;
fr: une tâche planifiée lance l'exécution de la mise à jour ;

source: the upgrade is executed when the machine shuts down;
fr: la mise à jour est exécutée à l'extinction de la machine ;

source: inventory information feedback;
fr: remontée des informations d'inventaire ;

source: the updated inventory is reported in the console;
fr: consultation de la remontée d'inventaire via la console ;

source: WAPT agent behavior with packages install / remove / session_setup / audit
fr: Comportement de l'agent WAPT pour installer / supprimer / configurer en contexte utilisateur / auditer un paquet

source: A key concept that can be hard to understand is the behavior of a WAPT agent when installing a package and the considerations around it.
fr: Un concept clé qui peut être difficile à comprendre est le comportement de l'agent WAPT lors de l'installation d'un paquet et les considérations qui l'entourent.

source: WAPT agent package installation can be split in SSS steps:
fr: L'installation du paquet d'agents WAPT peut être divisée en étapes :

source: package downloaded in agent cache;
fr: paquet téléchargé dans le cache de l'agent;

source: package unzip to temp folder;
fr: décompression du paquet dans un dossier temporaire ;

source: :file:`setup.py` content is stored in WAPT agent database located in :file:`C:\\Program Files (x86)\\wapt\\db\\waptdb.sqlite`;
fr: Le contenu de :file:`setup.py` est stocké dans la base de données de l'agent WAPT située dans :file:`C:\\Program Files (x86)\\wapt\\db\\waptdb.sqlite`;

source: software installed from unzipped files:
fr: les logiciels sont installés à partir des fichiers décompressés :

source: in case of success: downloaded package + unzipped files are deleted and status is sent to server;
fr: en cas de succès : le paquet téléchargé + les fichiers décompressés sont supprimés et le statut est envoyé au serveur ;

source: in case of failure: downloaded package is kept - unzipped files are deleted - error status sent to server;
fr: en cas d'échec : le paquet téléchargé est conservé - les fichiers décompressés sont supprimés - le statut d'erreur est envoyé au serveur ;

source: That behavior is important as it has an impact on further actions.
fr: Ce comportement est important car il a un impact sur les actions futures.

source: WAPT install behavior
fr: Comportement de l'installation d'un paquet WAPT

source: For instance when removing a package the following steps are taken:
fr: Par exemple, quand on supprime un paquet WAPT, les étapes suivantes sont effectuées :

source: :file:`setup.py` content is retrieved from WAPT agent database located in :file:`C:\\Program Files (x86)\\wapt\\db\\waptdb.sqlite`;
fr: Le contenu de :file:`setup.py` est récupéré depuis la base de données située dans :file:`C:\\Program Files (x86)\\wapt\\db\\waptdb.sqlite` ;

source: software uninstall from registry :command:`UninstallString` is executed;
fr: la valeur de *UninstallString* récupérée depuis la base de données, est exécutée ;

source: if defined, :command:`uninstall()` function is executed from retrieved package source code;
fr: Si elle est définie, la fonction :command:`uninstall()` est exécutée à partir du code source récupéré ;

source: Similar steps are reproduced when executing :command:`session_setup` and :command:`audit`.
fr: Des étapes similaires sont reproduites lors de l'exécution de :command:`session_setup` et :command:`audit`.

source: WAPT behavior with uninstall / session_setup and audit
fr: Comportement de l'agent WAPT avec la désinstallation, le session_setup et l'audit

source: WAPT Server architecture
fr: Architecture du serveur WAPT

source: The WAPT Server architecture relies on several distinct roles:
fr: L'architecture du serveur WAPT repose sur plusieurs rôles distincts et en partie dissociables :

source: the *repository role* for distributing packages;
fr: rôle de dépôt : *distribution de paquets* ;

source: the *inventory* and *central server* role for hardware and software inventory;
fr: rôle d'inventaire : *inventaire matériel et logiciel* ;

source: the *proxy* role to relay actions between the WAPT console and the WAPT agents;
fr: rôle de proxy : *proxy de commande depuis la console* ;

source: Repository role
fr: Rôle de dépôt

source: First, the WAPT Server serves as a web repository.
fr: Le serveur WAPT a pour premier rôle celui de dépôt de fichiers web.

source: WAPT repository mechanism
fr: Fonctionnement du dépôt WAPT

source: the repository role is accomplished by a :program:`Nginx` web server;
fr: ce rôle de dépôt est accompli par un serveur web Nginx ;

source: the repository allows the distribution of WAPT packages, the installers for :program:`waptagent` and :program:`waptsetup`;
fr: le dépôt permet la distribution des paquets WAPT, des installeurs :program:`waptagent` et :program:`waptsetup` ;

source: WAPT packages are available via a web browser by visiting https://srvwapt.mydomain.lan/wapt;
fr: les paquets WAPT sont accessibles avec un navigateur web à l'adresse : https://srvwapt.mydomain.lan/wapt ;

source: *host* packages are stored in a directory that is not accessible by default (https://srvwapt.mydomain.lan/wapt/wapt-host/);
fr: les paquets machines sont contenus dans un répertoire inaccessible par défaut (https://srvwapt.mydomain.lan/wapt/wapt-host/) ;

source: Inventory server role
fr: Rôle d'inventaire

source: Second, the WAPT Server serves as an inventory server.
fr: Le serveur WAPT a pour deuxième rôle celui de serveur d'inventaire.

source: The inventory server is a passive service that collects information reported by WAPT agents:
fr: Le serveur d'inventaire est un service passif qui collecte les informations que les agents WAPT lui envoient :

source: hardware inventory;
fr: inventaire matériel ;

source: software inventory;
fr: inventaire logiciel ;

source: WAPT packages status;
fr: statut des paquets WAPT ;

source: tasks status (*running*, *pending*, *error*);
fr: état des tâches (*running*, *pending*, *error*) ;

source: The WAPT service is not active in the sense that it only receives information from clients. As a consequence, if the inventory server fails, the inventory will recover by itself from inventory status reports received from the deployed WAPT agents.
fr: Le service n'est pas actif dans le sens où le serveur d'inventaire ne fait que recevoir de l'information. Aucun service actif interroge directement les agents WAPT. Par conséquent en cas de défaillance du serveur d'inventaire, l'inventaire se régénérera automatiquement à partir des remontées d'inventaire des agents déployés.

source: In the Community version of WAPT, access to inventory data is only possible through the WAPT console.
fr: En version **Community**, ce service d'inventaire n'a pas d'interface web pour la visualisation des données, l'accès aux données d'inventaire se fait au travers de la console WAPT.

source: WAPT **Enterprise** 1.7 will come with a *Business Intelligence* like web based reporting.
fr: En version **Enterprise**, l'inventaire est accessible à partir d'une console web de visualisation des données de type *Business Intelligence*.

source: Proxy role
fr: Rôle de Proxy

source: Third, the WAPT Server serves as a command relay proxy.
fr: Le serveur WAPT a pour troisième rôle celui de Proxy de commande.

source: It acts as a relay between the WAPT management console and deployed WAPT agents.
fr: Il agit comme un relai entre la console et les agents WAPT déployés.

source: WAPT proxy mechanism
fr: Fonctionnement du proxy WAPT

source: Every action triggered on a WAPT agent from the server are signed with the :term:`Administrator`'s private key. Without a valid private key, it is not possible to trigger remote actions on remote WAPT equipped devices. For more information on remote actions, please refer to :ref:`signing actions relayed to the WAPT agents <signing_actions_relayed_to_WAPT_agents>`.
fr: Toutes les actions envoyées aux agents WAPT sont signées par la clé privée de l':term:`Administrateur`. Sans la clé privé, aucune action ne pourra être envoyée sur les postes. Pour en savoir plus a propos de la signature des actions rendez-vous dans la documentation sur la :ref:`signature des actions envoyées aux agents WAPT <signing_actions_relayed_to_WAPT_agents>`.

source: WAPT common interactions
fr: Les interactions classiques de WAPT

source: When an :command:`update` command is launched on an agent (from the console, via the command-line or via the WAPT tray), it is equivalent to ordering the agent to check the WAPT repository for new packages. By default, the WAPT agent will look for updates every two hours.
fr: Lorsqu'on lance la commande :command:`update` sur un agent (depuis la console, en ligne de commande ou depuis le :program:`wapttray`), on dit à l'agent d'aller vérifier sur le dépôt WAPT si des nouveaux paquets ou des nouvelles versions de paquets sont disponibles. Par défaut, l'agent WAPT interroge son dépôt toutes les deux heures.

source: If the date of the :file:`Packages` index file has changed since the last :command:`update`, then the WAPT agent downloads the new :file:`Packages` file (between 20 and 100k), otherwise, it does nothing.
fr: Si la date du fichier :file:`Packages` a changé depuis le dernier :command:`update`, alors l'agent WAPT télécharge le nouveau fichier :file:`Packages` (entre 20 et 100ko).

source: The WAPT agent then compares the :file:`Packages` file with its own local database.
fr: L'agent WAPT compare ensuite le nouveau fichier :file:`Packages` avec sa base de données locale.

source: If the WAPT agent detects that a package must be added or updated, it will switch the status of the host and package to *NEED-UPGRADE*.
fr: Si l'agent WAPT constate qu'un paquet doit être ajouté, supprimé ou mis à jour, il basculera l'état du paquet en *NEED-UPGRADE*.

source: It will not launch the installation of the package immediately. The WAPT agent will wait for an ":command:`upgrade`" order to launch the upgrade.
fr: Il ne lancera pas immédiatement l'installation du paquet. Il attendra l'ordre :command:`upgrade` pour exécuter la mise à jour.

source: When we launch a command :command:`upgrade` (from the WAPT console, using the command line, with a Windows scheduled task or manually with the WAPT tray), we ask the WAPT agent to install the packages with a *NEED-UPGRADE* status.
fr: Lorsqu'on lance la commande :command:`upgrade` (depuis la console, en ligne de commande, depuis une tâche planifiée sur le poste ou manuellement depuis le :guilabel:`wapttray`), on ordonne à l'agent d'installer les paquets en statut *NEED-UPGRADE*.

source: An :command:`update` must come before an :command:`upgrade`, otherwise the agent will not know whether updates are available.
fr: Un :command:`update` doit précéder un :command:`upgrade`, sinon l'agent ne saura pas que des mises à jour sont devenues disponibles.

source: Working principle of the WAPT agent
fr: Fonctionnement de l'agent WAPT

source: By default, the WAPT agent will trigger an :command:`update`/ a :command:`download-upgrade` at startup; after starting up, the WAPT agent will check every 2 hours to see whether it has something to do.
fr: Par défaut l'agent WAPT fera un :command:`update` / :command:`download-upgrade` au démarrage du service, puis toutes les deux heures pour vérifier s'il a des choses à faire.

source: Packages to be installed will be downloaded and cached in the folder :file:`C:\\Program Files (x86)\\wapt\\cache`.
fr: C:\\Program Files (x86)\\wapt\\

source: :program:`waptexit` will launch an :command:`upgrade` when the computer shuts down. An :term:`Administrator` will also be able to launch an :command:`upgrade` from the WAPT console.
fr: Un :command:`upgrade` sera ensuite lancé automatiquement à l'arrêt de l'ordinateur avec le :program:`waptexit`. Un :term:`Administrateur` pourra également forcer un :command:`upgrade` depuis la console.

source: If the WAPT Server is not reachable when upgrading, the WAPT agent will still be able to install cached packages.
fr: Si le serveur WAPT n'est pas disponible au moment de l':command:`upgrade`, l'agent WAPT pourra tout de même installer ses paquets en attente car ils seront disponibles dans le cache.

source: Inventory updates will then be sent to the WAPT Server when network connectivity returns.
fr: L'inventaire sera ensuite envoyé quand le serveur WAPT sera de nouveau disponible.

source: The 4 goals of the WAPT agent are therefore:
fr: Les 4 buts de l'agent WAPT sont donc :

source: to install a *base*, a *group* or a *unit* package if it is available;
fr: d'installer un paquet *host*, *group* ou *unit* si celui-ci est disponible ;

source: to remove obsolete packages;
fr: de supprimer les paquets obsolètes ;

source: to resolve package dependencies and conflicts;
fr: de résoudre les dépendances et les conflits ;

source: to make sure all installed WAPT packages are up to date compared to the ones stored on the repository;
fr: de maintenir tous ses paquets WAPT installés à jour par rapport à ceux du dépôt ;

source: to regularly update the WAPT server with its hardware status and the status of installed software;
fr: d'envoyer régulièrement son inventaire matériel et l'état d'installation de ses paquets ;

source: WAPT package creation
fr: La création de paquets WAPT

source: WAPT language and development environment
fr: Le langage de WAPT et les environments de développement

source: WAPT is built using the `Python language <https://www.python.org>`_.
fr: WAPT est édité avec le `langage de programmation Python <https://www.python.org/>`_.

source: Any Rapid Application Development environment intended for Python development is suitable.
fr: N'importe quel environment de développement rapide (RAD) destiné à la programmation python convient.

source: Tranquil IT has developed some useful WAPT specific plugins for the :program:`PyScripter` IDE (https://sourceforge.net/projects/pyscripter).
fr: WAPT a développé quelques extensions très utiles dans le RAD PyScripter https://sourceforge.net/projects/pyscripter.

source: Tranquil IT recommends using :program:`PyScripter`, available with the *tis-waptdev* meta-package.
fr: Tranquil IT recommande l'usage de :program:`PyScripter`, disponible dans le paquet *tis-waptdev*.

source: Principles of WAPT package development
fr: Les grands concepts du développement de paquets WAPT

source: The strength of Python
fr: La puissance de Python

source: All the power of :program:`Python` can be advantageously put to use.
fr: Toute la puissance de :program:`Python` peut être avantageusement exploitée.

source: Many libraries already exist in Python for:
fr: De nombreuses librairies existent en standard avec Python pour :

source: doing conditional loops (if ... then ... else ...);
fr: faire des boucles de vérification (if ... then ... else ...) ;

source: copying, pasting, moving files and directories;
fr: copier, coller, déplacer des fichiers ou des répertoires ;

source: checking whether files or directories exist;
fr: tester l'existence ou l'absence de fichiers ou de répertoires ;

source: checking whether registry keys exist;
fr: tester l'existence ou l'absence d'éléments de base de registre ;

source: checking access rights, modifying access rights;
fr: tester des droits, les modifier ;

source: looking up information on external data sources (LDAP, databases, files, etc);
fr: interroger des sources de données extérieures (annuaires, bases de données, autres référentiels) ;

source: The power of WAPT
fr: La puissance de WAPT

source: Functions most commonly used with WAPT were simplified within libraries called :term:`SetupHelpers`.
fr: Les actions les plus fréquemment employées avec WAPT ont été simplifiées dans des fonctions appelées :term:`SetupHelpers`.

source: **SetupHelpers** libraries simplify the process of creating and testing WAPT packages, thus validating WAPT's main objectives:
fr: Les fonctions **SetupHelpers** simplifient la création ou l'évaluation de paquets WAPT, validant l'objectif initial de WAPT :

source: **what was complicated is made simple**;
fr: **ce qui était compliqué est rendu simple avec WAPT** ;

source: **what was simple is made trivial**;
fr: **ce qui était simple est rendu trivial avec WAPT** ;

source: Now, I want to :ref:`install my WAPT Server <installing_WAPT_Server>`!!
fr: Je veux maintenant :ref:`installer mon serveur WAPT <installing_WAPT_Server>` !!
