Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-concept/wapt-SRP.po
Languages: fr

source: Disrupting Microsoft's plan for forcing you to go Corporate licensing
fr: Perturber le plan de Microsoft visant à vous forcer à prendre des licences Windows Entreprise

source: Disrupting Microsoft's plan to force you to go Corporate licensing
fr: Perturber le plan de Microsoft visant à vous forcer à prendre des licences Windows Entreprise

source: One **fantastic side benefit** that can be obtained from WAPT is enforcing a concept that has traditionally been called :abbr:`SRP (Software Restriction Policies)` on Windows systems.
fr: Un **énorme bénéfice** que l'on peut tirer d'une exploitation avancée de WAPT est l'application d'un concept traditionnellement appelé :abbr:`SRP (Software Restriction Policies)` sur les systèmes Windows.

source: **SRPs can complement, and even replace costly and sometimes ineffective anti-virus software. SRPs work on the very simple principle of allowing only known and trusted programs to run, while forbidding any other executable. Allowed programs are just a signed list of paths (absolute paths or paths validating a set of rules) leading to binaries that have themselves been signed by a trusted Authority, either by the operating system manufacturer, by a well known software editor, or ideally by your own Organisation.**
fr: **Les SRPs peuvent compléter, voire remplacer, des logiciels antivirus coûteux et parfois inefficaces. Les SRPs fonctionnent sur le principe très simple de ne permettre l'exécution que de programmes connus et fiables, tout en interdisant tout autre exécutable. Les programmes autorisés ne sont qu'une liste signée de chemins (chemins absolus ou validant un ensemble de règles) menant à des binaires qui ont eux-mêmes été signés par une autorité de confiance, soit par le fabricant du système d'exploitation, soit par un éditeur de logiciels bien connu, ou idéalement par votre propre organisation.**

source: **Basically, what the admin does not know does not run, SIMPLE!!**
fr: **En gros, ce que l'administrateur ne connaît pas ne fonctionne pas, SIMPLE !!**

source: *SRPs* work most effectively if the following two principles are applied:
fr: Les *SRP* fonctionnent plus efficacement si les deux principes suivants sont appliqués :

source: the user logs without administration rights because anyone with admin rights to their local device can subvert Software Restriction Policies;
fr: l'utilisateur se connecte sans droits d'administration car toute personne ayant des droits d'administration sur son appareil local peut subvertir les politiques de restrictions logicielles ;

source: the host has been freshly reimaged from a trusted source, updated and is therefore free from any virus or malware program;
fr: la machine a été récemment ré-initialisée à partir d'une source fiable, mise à jour et est donc exempt de tout virus ou programme malveillant ;

source: The only known drawback to the concept of *Software Restriction Policies* is that system administrators need to be good listeners of the needs of their users and be quick to cycle a solid solution into production when a legitimate user need arises.
fr: Le seul inconvénient connu du concept des *politiques de restrictions logicielles* est que les administrateurs système doivent être à l'écoute des besoins de leurs utilisateurs et être rapides à mettre en production une solution solide lorsqu'un besoin légitime d'un utilisateur est exprimé.

source: SRPs since Windows7
fr: Les SRPs depuis Windows7

source: SRPs have existed in Professional Edition since Windows XP. They can be managed by setting :abbr:`GPO (Group Policy Object)` with the :abbr:`RSAT (Remote Server Administration Tool)` console in an Active Directory Environment.
fr: Les SRPs existent dans les éditions professionnelles de WIndows depuis XP. Elles peuvent être gérées en définissant une :abbr:`GPO (Group Policy Object)` dans une console :abbr:`RSAT (Remote Server Administration Tool)` en environnement Active Directory.

source: In Windows7 and Windows8 Enterprise version, SRPs are called *Applocker* and come with some additional features over simple SRPs. *Applocker* rules are deployed using GPO.
fr: Dans les versions Enterprise de Windows7 et Windows8, les SRPs sont appelées *Applocker* et sont dotées de certaines fonctionnalités supplémentaires par rapport aux SRP simples. Les règles *Applocker* sont déployées à l'aide de GPO.

source: SRPs with Windows10 and beyond
fr: SRPs avec Windows10 et au-delà

source: In Windows10, SRPs and *Applocker* are replaced with a thing called WDAC or `Windows Defender Application Control <https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/windows-defender-application-control>`_.
fr: Dans Windows10, les SRPs et *Applocker* sont remplacés par une chose appelée WDAC ou `Windows Defender Application Control <https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/windows-defender-application-control>`_.

source: We believe this move demonstrates the underlying strategy from Microsoft to try to move all non corporate Windows users to its Azure cloud platform, while making pay exorbitant amounts per desktop to allow corporate customers, who can not adopt a GAFAM cloud for sovereign reasons, to keep their own systems for managing their fleets of users, passwords, desktops, software and configurations.
fr: Nous pensons que cette décision démontre la stratégie sous-jacente de Microsoft pour essayer de faire passer tous les utilisateurs Windows non professionnels à sa plateforme Azure, tout en faisant payer des montants exorbitants par poste de travail pour permettre aux entreprises clientes, qui ne peuvent pas adopter un Cloud GAFAM pour des raisons de souveraineté, de conserver leurs propres systèmes de gestion de leurs parcs d'utilisateurs, mots de passe, postes de travail, logiciels et configurations. Traduit avec www.DeepL.com/Translator (version gratuite)

source: WDAC policies can only be created on computers beginning with Windows 10 Enterprise or Windows Server 2016 and above.
fr: Les politiques WDAC ne peuvent être créées que sur des ordinateurs à partir de Windows 10 Enterprise ou Windows Server 2016 et au-delà.

source: WDAC rules can be applied to computers running any edition of Windows 10 or Windows Server 2016.
fr: Les règles WDAC peuvent être appliquées aux ordinateurs fonctionnant sous n'importe quelle édition de Windows 10 ou de Windows Server 2016.

source: Group Policy can be used to deploy WDAC policies only to **Windows 10 Enterprise edition** or Windows Server 2016 and above.
fr: Des GPOs peuvent être utilisées pour déployer les politiques WDAC uniquement sur des plateformes **Windows 10 Enterprise edition** ou Windows Server 2016 et supérieur.

source: The WDAC rules can be managed via Mobile Device Management (MDM) and WAPT can be your MDM of choice to deploy WDAC rules on your fleets of workstations.
fr: Les règles WDAC peuvent être gérées via un outil de gestion des appareils mobiles (MDM) et WAPT peut être votre MDM de choix pour déployer les règles WDAC sur vos parcs de postes de travail.

source: Why WAPT is the WDAC companion system that will rule them all?
fr: Pourquoi WAPT est-il le meilleur compagnon de WDAC ?

source: *Applocker* had been created to improve on the concept of SRPs for the following main reasons:
fr: *Applocker* avait été créé pour améliorer le concept des SRPs pour les raisons suivantes :

source: making software restriction policies version aware because hash rules quickly become invalidated as application updates are released;
fr: en permettant aux politiques de restrictions logicielles d'être plus permissives avec les versions de logiciels à déployer, car les règles de hachage sont rapidement invalidées lorsque les mises à jour des applications sont publiées ;

source: making the process of creating policies easier with a rule generation wizard;
fr: en facilitant pour l'administrateur le processus de création des politiques de restriction grâce à un assistant de génération de règles ;

source: making easier the import and export of rule sets, which allows to create a set of rules and then export them to a file that can be imported onto another computer (ex: computers that are not domain members and therefore not subject to a centralized set of Group Policy rules);
fr: en facilitant l'importation et l'exportation d'ensembles de règles, ce qui permet de créer un ensemble de règles puis de les exporter vers un fichier qui peut être importé sur un autre ordinateur (ex : ordinateurs qui ne sont pas membres du domaine et ne sont donc pas soumis à un ensemble centralisé de règles de politique de groupe) ;

source: So, if we think of WAPT as a surrogate for GPOs that can apply scheduled audits for inspecting registry hives and insuring that checksums have not changed, we can have the following benefits:
fr: Ainsi, si nous considérons WAPT comme un substitut des GPO qui peuvent appliquer des audits programmés pour inspecter les registres et s'assurer que les sommes de contrôle n'ont pas changées, nous pouvons avoir les avantages suivants :

source: corporate entities can **avoid paying the Microsoft Enterprise subscription for Windows 10 and stay with the Windows 10 Professional** edition because WDAC rules can be managed using WAPT instead of GPOs in Active Directory;
fr: les organisations peuvent **éviter de payer l'abonnement Microsoft Enterprise pour Windows 10 et rester avec l'édition Windows 10 Professional** car les règles WDAC peuvent être gérées en utilisant WAPT au lieu des GPO dans Active Directory ;

source: the telemetry in Windows10 Professional can be mostly tamed using off-she-shelf WAPT packages and firewall and proxy rules;
fr: la télémétrie dans Windows10 Professional peut être apprivoisée principalement en utilisant des paquets WAPT prêts à l'emploi et des règles de pare-feu et de proxy ;

source: entities can insure *Software Restriction Policies* **compliance on devices that are not joined to a domain**;
fr: les organisations peuvent assurer les *politiques de restrictions logicielles* **sur des appareils qui ne sont pas joints à un domaine** ;

source: *Software Restriction Policies* and WDAC rules and checks **can be embedded into WAPT packages so that policies can be easily audited**;
fr: Les *politiques de restrictions logicielles* et les règles et contrôles WDAC **peuvent être intégrés dans des paquets WAPT afin que les règles puissent être facilement auditées** ;

source: fleet wide **SRP reporting can be easily setup** using WAPT's native reporting framework and tools;
fr: à l'échelle de la flotte, **des rapports SRP peuvent être facilement générés pour le pilotage et le contrôle** en utilisant le cadre et les outils de reporting natifs de WAPT ;

source: *Software Restriction Policies* and WDAC rules can de facto be **safely imported from one computer and exported to another** so long it is running a WAPT agent equipped with the proper certificates;
fr: Les *politiques de restrictions logicielles* et les règles WDAC peuvent de facto être **importées en toute sécurité d'un ordinateur et exportées vers un autre** tant qu'un agent WAPT équipé des certificats appropriés est en fonctionnement ;
