Repository: gaetan-31/WAPT-Documentation
Catalog: source/locale/*/LC_MESSAGES/wapt-create-packages/package-linux/index.po
Languages: fr

source: Packaging simple Linux packages
fr: Packager des paquets Linux simplifiés

source: linux, WAPT, package, documentation
fr: linux, WAPT, paquet, documentation

source: Before starting, we assume several conditions:
fr: Avant de commencer, nous assumons quelques hypothèses :

source: you have a graphical interface on your Linux system;
fr: vous avez une interface graphique sur votre linux ;

source: you have installed the :program:`vscode` package from the Tranquil IT repository;
fr: vous avez installé le paquet :program:`vscode` depuis les dépôts officiels de Tranquil IT ;

source: your user is named *linuxuser* and is a member of the *sudoers* group;
fr: votre utilisateur se nomme "linuxuser" et est membre du groupe des sudoers ;

source: create a base template from you linux computer
fr: Crer un modèle de paquet depuis votre poste linux

source: start up a Command Line utility;
fr: ouvrir une invite de commande;

source: as *linuxuser*, create a WAPT package template;
fr: en tant que *linuxuser*, créer un modèle de paquet WAPT ;

source: Do not launch this command as root or with sudo.
fr: Ne pas lancer cette commande en tant que root ou avec sudo.

source: When you create a template, there will be several files in the folder :file:`.vscode` inside your package folder:
fr: Lorsque vous créez un modèle, plusieurs fichiers son créés dans le dossier :file:`.vscode` à l'intérieur de votre dossier du paquet :

source: Example with VLC:
fr: Exemple avec VLC:

source: All packages are stored in linuxuser's home.
fr: Tous les paquets sont situés dans le dossier personnel de l'utilisateur *linuxuser*.

source: VSCode loads up and opens package project.
fr: VSCode charge et s'ouvre sur le projet du paquet.

source: VSCode opening with focus on the *setup* file
fr: VSCode s'ouvre en se focalisant sur le fichier *setup*

source: check the :file:`control` file content;
fr: vérifier le contenu du fichier :file:`control` ;

source: You have to give a **description** to you package, give the **os_target** and the **version** of you package.
fr: Vous devez donner une **description** à votre paquet, renseignez l' **os_target** et la **version** de votre paquet.

source: **os_target** for unix is *linux*
fr: **os_target** pour unix est *linux*

source: *version* in you :file:`control` file must start at 0, not the version number of the software, we don't know precisely from apt/yum repo which version will be.
fr: *version* dans votre fichier :file:`control` doit commencer à 0 et non pas la version du logiciel, nous ne savons pas précisément quelle version sera récupérée depuis les dépôts apt/yum.

source: Original *control* file
fr: Fichier *control* original

source: Modified *control* file
fr: Fichier *control* modifié

source: It is to be noted that a sub-version *-1* has been added. It is the packaging version of WAPT package.
fr: Une sous-version *-1* a été ajoutée. C'est la version de packaging du paquet WAPT.

source: It allows the Package Developer to release several WAPT package versions of the same software.
fr: Cela permet de ne pas modifier la version réelle du logiciel quand on pousse par exemple une nouvelle configuration du même logiciel sur le parc.

source: make changes to the code in the :file:`setup.py` file accordingly;
fr: changer le code du fichier :file:`setup.py` en conséquence ;

source: save the package;
fr: enregistrer le paquet ;

source: Managing the uninstallation
fr: Gérer la désinstallation

source: make changes to the :file:`setup.py` file with an uninstall ;
fr: changer le code du fichier :file:`setup.py` avec une desinstallation ;

source: launch a :guilabel:`remove` from VSCode :guilabel:`Run Configurations`;
fr: lancer un :guilabel:`remove` du paquet depuis le panneau :guilabel:`Run Configurations` de VSCode ;

source: check that the software has been correctly removed
fr: vérifier que le programme est désinstallé

source: In the :command:`uninstall()` function, it is not possible to call for files included inside the WAPT package. To call files from the package, it is necessary to copy/ paste the files in a temporary directory during package installation.
fr: Dans la fonction :command:`uninstall()`, on ne peut pas appeler des fichiers contenus dans le paquet WAPT. Pour les appeler, il faudra avoir copié les fichiers dans un répertoire local de la machine lors de l'installation du paquet.

source: Managing the session-setup
fr: Gérer le session-setup

source: make changes to the :file:`setup.py` file with an session-setup ;
fr: changer le code du fichier :file:`setup.py` avec un session-setup ;

source: In this example, you'll need a :file:`vlcrc` file in your package to copy in home user. ``ensure_dir`` function and ``filecopyto`` are from **setuphelpers**, the first one will test if the path exists, the second one will copy your file from the WAPT package to its destination.
fr: Dans cet exemple, vous aurez besoin d'un fichier :file:`vlcrc` dans votre paquet pour le copier dans le dossier personnel de l'utilisateur. La fonction ``ensure_dir`` et la fonction ``filecopyto`` proviennent de la bibliothèque des **setuphelpers**, la première va tester si le chemin existe, la seconde va copier votre fichier depuis le paquet WAPT vers sa destination.

source: launch a :guilabel:`session-setup` from VSCode :guilabel:`Run Configurations`;
fr: lancer un :guilabel:`session-setup` du paquet depuis le panneau :guilabel:`Run Configurations` de VSCode ;

source: Build and upload the package
fr: Construire et charger le paquet WAPT

source: Once the installation and the de-installation are configured and tested and the package is customized to your satisfaction, you may build and upload your new WAPT package onto your WAPT repository.
fr: Une fois l'installation et la désinstallation configurées et testées vous pouvez effectuer un :command:`build-upload` pour charger votre nouveau paquet WAPT sur votre dépôt.

source: If you have built packages on a different machine (ex: Windows for building your Windows WAPT packages), you have to copy your :mimetype:`.pem` and :mimetype:`.crt` keys on your Linux machine with :program:`WinSCP` or equivalent. Usually, this certificate bundle will be located in :file:`C:\\private` on your Windows computer. Then, provide the path to the certificates in :file:`/opt/wapt/wapt-get.ini`.
fr: Si vous avez construit des paquets sur une autre machine (ex : Windows pour construire vos paquets WAPT Windows), vous devez copier vos clés :mimetype:`.pem` et :mimetype:`.crt` sur votre machine Linux avec :program:`WinSCP` ou équivalent. Habituellement, ce paquet de certificats se trouve dans le dossier :file:`C:\\\private` de votre ordinateur Windows. Ensuite, indiquez le chemin d'accès aux certificats dans le fichier :file:`/opt/wapt/wapt-get.ini`.

source: provide the path to your certificate;
fr: renseigner le chemin de votre certificat ;

source: then launch a :command:`build-upload` from VSCode :guilabel:`Run Configurations`;
fr: Puis lancer un :command:`build-upload` depuis le panneau VSCode :guilabel:`Run Configurations` ;

source: provide the password to your private key then admin/password of your *waptconsole*;
fr: renseigner le mot de passe de votre clé privée puis l'identifiant et le mot de passe de passe de votre console WAPT ;

source: Your package is now uploaded and available in your private repository on your WAPT server.
fr: Votre paquet est maintenant téléchargé et disponible dans votre dépôt privé sur votre serveur WAPT.
